#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Reaper

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Reaper.ABP_Reaper_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Reaper_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Reaper_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Reaper_C_AnimGraph");
static_assert(sizeof(ABP_Reaper_C_AnimGraph) == 0x000010, "Wrong size on ABP_Reaper_C_AnimGraph");
static_assert(offsetof(ABP_Reaper_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Reaper_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Reaper.ABP_Reaper_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Reaper_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Reaper_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Reaper_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Reaper_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Reaper_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Reaper_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Reaper_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Reaper.ABP_Reaper_C.ExecuteUbergraph_ABP_Reaper
// 0x0028 (0x0028 - 0x0000)
struct ABP_Reaper_C_ExecuteUbergraph_ABP_Reaper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Reaper_C*                           K2Node_DynamicCast_AsBP_Reaper;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Reaper_C_ExecuteUbergraph_ABP_Reaper) == 0x000008, "Wrong alignment on ABP_Reaper_C_ExecuteUbergraph_ABP_Reaper");
static_assert(sizeof(ABP_Reaper_C_ExecuteUbergraph_ABP_Reaper) == 0x000028, "Wrong size on ABP_Reaper_C_ExecuteUbergraph_ABP_Reaper");
static_assert(offsetof(ABP_Reaper_C_ExecuteUbergraph_ABP_Reaper, EntryPoint) == 0x000000, "Member 'ABP_Reaper_C_ExecuteUbergraph_ABP_Reaper::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Reaper_C_ExecuteUbergraph_ABP_Reaper, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'ABP_Reaper_C_ExecuteUbergraph_ABP_Reaper::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_Reaper_C_ExecuteUbergraph_ABP_Reaper, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'ABP_Reaper_C_ExecuteUbergraph_ABP_Reaper::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Reaper_C_ExecuteUbergraph_ABP_Reaper, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'ABP_Reaper_C_ExecuteUbergraph_ABP_Reaper::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Reaper_C_ExecuteUbergraph_ABP_Reaper, K2Node_DynamicCast_AsBP_Reaper) == 0x000018, "Member 'ABP_Reaper_C_ExecuteUbergraph_ABP_Reaper::K2Node_DynamicCast_AsBP_Reaper' has a wrong offset!");
static_assert(offsetof(ABP_Reaper_C_ExecuteUbergraph_ABP_Reaper, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ABP_Reaper_C_ExecuteUbergraph_ABP_Reaper::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

