#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Crawler

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Crawler.ABP_Crawler_C
// 0x05F0 (0x0940 - 0x0350)
class UABP_Crawler_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0358(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_BlendSpaceGraph;            // 0x0360(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0368(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0370(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0390(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x03B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x03E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0408(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0430(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0478(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0498(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x04E0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0500(0x0048)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_2;            // 0x0548(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0568(0x0048)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_1;            // 0x05B0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x05D0(0x0048)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult;              // 0x0618(0x0020)()
	struct FAnimNode_BlendSpaceGraph              AnimGraphNode_BlendSpaceGraph;                     // 0x0638(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x06A0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x06C0(0x00C8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0788(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x08B0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x08D0(0x0020)()
	double                                        Speed;                                             // 0x08F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanSeePlayer;                                      // 0x08F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F9[0x7];                                      // 0x08F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               HeadRotation;                                      // 0x0900(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsAttacking;                                       // 0x0918(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_919[0x7];                                      // 0x0919(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Crawler_C*                          Crawler;                                           // 0x0920(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGrawling;                                        // 0x0928(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_929[0x7];                                      // 0x0929(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Crawler_C*                          Target;                                            // 0x0930(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_Footstep_Mutant_Sound();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ABP_Crawler(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Crawler_C">();
	}
	static class UABP_Crawler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Crawler_C>();
	}
};
static_assert(alignof(UABP_Crawler_C) == 0x000010, "Wrong alignment on UABP_Crawler_C");
static_assert(sizeof(UABP_Crawler_C) == 0x000940, "Wrong size on UABP_Crawler_C");
static_assert(offsetof(UABP_Crawler_C, UberGraphFrame) == 0x000350, "Member 'UABP_Crawler_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, AnimBlueprintExtension_PropertyAccess) == 0x000358, "Member 'UABP_Crawler_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, AnimBlueprintExtension_BlendSpaceGraph) == 0x000360, "Member 'UABP_Crawler_C::AnimBlueprintExtension_BlendSpaceGraph' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, AnimBlueprintExtension_Base) == 0x000368, "Member 'UABP_Crawler_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, AnimGraphNode_Root) == 0x000370, "Member 'UABP_Crawler_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, AnimGraphNode_TransitionResult_3) == 0x000390, "Member 'UABP_Crawler_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, AnimGraphNode_TransitionResult_2) == 0x0003B8, "Member 'UABP_Crawler_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, AnimGraphNode_TransitionResult_1) == 0x0003E0, "Member 'UABP_Crawler_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, AnimGraphNode_TransitionResult) == 0x000408, "Member 'UABP_Crawler_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, AnimGraphNode_SequencePlayer_4) == 0x000430, "Member 'UABP_Crawler_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, AnimGraphNode_StateResult_2) == 0x000478, "Member 'UABP_Crawler_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, AnimGraphNode_SequencePlayer_3) == 0x000498, "Member 'UABP_Crawler_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, AnimGraphNode_StateResult_1) == 0x0004E0, "Member 'UABP_Crawler_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, AnimGraphNode_SequencePlayer_2) == 0x000500, "Member 'UABP_Crawler_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, AnimGraphNode_BlendSpaceSampleResult_2) == 0x000548, "Member 'UABP_Crawler_C::AnimGraphNode_BlendSpaceSampleResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, AnimGraphNode_SequencePlayer_1) == 0x000568, "Member 'UABP_Crawler_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, AnimGraphNode_BlendSpaceSampleResult_1) == 0x0005B0, "Member 'UABP_Crawler_C::AnimGraphNode_BlendSpaceSampleResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, AnimGraphNode_SequencePlayer) == 0x0005D0, "Member 'UABP_Crawler_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, AnimGraphNode_BlendSpaceSampleResult) == 0x000618, "Member 'UABP_Crawler_C::AnimGraphNode_BlendSpaceSampleResult' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, AnimGraphNode_BlendSpaceGraph) == 0x000638, "Member 'UABP_Crawler_C::AnimGraphNode_BlendSpaceGraph' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, AnimGraphNode_StateResult) == 0x0006A0, "Member 'UABP_Crawler_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, AnimGraphNode_StateMachine) == 0x0006C0, "Member 'UABP_Crawler_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, AnimGraphNode_ModifyBone) == 0x000788, "Member 'UABP_Crawler_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, AnimGraphNode_LocalToComponentSpace) == 0x0008B0, "Member 'UABP_Crawler_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, AnimGraphNode_ComponentToLocalSpace) == 0x0008D0, "Member 'UABP_Crawler_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, Speed) == 0x0008F0, "Member 'UABP_Crawler_C::Speed' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, CanSeePlayer) == 0x0008F8, "Member 'UABP_Crawler_C::CanSeePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, HeadRotation) == 0x000900, "Member 'UABP_Crawler_C::HeadRotation' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, IsAttacking) == 0x000918, "Member 'UABP_Crawler_C::IsAttacking' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, Crawler) == 0x000920, "Member 'UABP_Crawler_C::Crawler' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, IsGrawling) == 0x000928, "Member 'UABP_Crawler_C::IsGrawling' has a wrong offset!");
static_assert(offsetof(UABP_Crawler_C, Target) == 0x000930, "Member 'UABP_Crawler_C::Target' has a wrong offset!");

}

