#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Shamble_Common

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Shamble_Common.ABP_Shamble_Common_C
// 0x0870 (0x0BC0 - 0x0350)
class UABP_Shamble_Common_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0358(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_BlendSpaceGraph;            // 0x0360(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0368(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0370(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0390(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x03B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x03E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0408(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x0430(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0478(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x0498(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x04E0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x0500(0x0048)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_12;           // 0x0548(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x0568(0x0048)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_11;           // 0x05B0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x05D0(0x0048)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_10;           // 0x0618(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x0638(0x0048)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_9;            // 0x0680(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x06A0(0x0048)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_8;            // 0x06E8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0708(0x0048)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_7;            // 0x0750(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x0770(0x0048)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_6;            // 0x07B8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x07D8(0x0048)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_5;            // 0x0820(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0840(0x0048)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_4;            // 0x0888(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x08A8(0x0048)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_3;            // 0x08F0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0910(0x0048)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_2;            // 0x0958(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0978(0x0048)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_1;            // 0x09C0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x09E0(0x0048)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult;              // 0x0A28(0x0020)()
	struct FAnimNode_BlendSpaceGraph              AnimGraphNode_BlendSpaceGraph;                     // 0x0A48(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0AB0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0AD0(0x00C8)()
	class ABP_Shamble_C*                          Shamble;                                           // 0x0B98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGrawling;                                        // 0x0BA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAttacking;                                       // 0x0BA1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA2[0x6];                                      // 0x0BA2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Speed;                                             // 0x0BA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Direction;                                         // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_Footstep();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ABP_Shamble_Common(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Shamble_Common_C">();
	}
	static class UABP_Shamble_Common_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Shamble_Common_C>();
	}
};
static_assert(alignof(UABP_Shamble_Common_C) == 0x000010, "Wrong alignment on UABP_Shamble_Common_C");
static_assert(sizeof(UABP_Shamble_Common_C) == 0x000BC0, "Wrong size on UABP_Shamble_Common_C");
static_assert(offsetof(UABP_Shamble_Common_C, UberGraphFrame) == 0x000350, "Member 'UABP_Shamble_Common_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimBlueprintExtension_PropertyAccess) == 0x000358, "Member 'UABP_Shamble_Common_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimBlueprintExtension_BlendSpaceGraph) == 0x000360, "Member 'UABP_Shamble_Common_C::AnimBlueprintExtension_BlendSpaceGraph' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimBlueprintExtension_Base) == 0x000368, "Member 'UABP_Shamble_Common_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_Root) == 0x000370, "Member 'UABP_Shamble_Common_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_TransitionResult_3) == 0x000390, "Member 'UABP_Shamble_Common_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_TransitionResult_2) == 0x0003B8, "Member 'UABP_Shamble_Common_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_TransitionResult_1) == 0x0003E0, "Member 'UABP_Shamble_Common_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_TransitionResult) == 0x000408, "Member 'UABP_Shamble_Common_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_SequencePlayer_14) == 0x000430, "Member 'UABP_Shamble_Common_C::AnimGraphNode_SequencePlayer_14' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_StateResult_2) == 0x000478, "Member 'UABP_Shamble_Common_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_SequencePlayer_13) == 0x000498, "Member 'UABP_Shamble_Common_C::AnimGraphNode_SequencePlayer_13' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_StateResult_1) == 0x0004E0, "Member 'UABP_Shamble_Common_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_SequencePlayer_12) == 0x000500, "Member 'UABP_Shamble_Common_C::AnimGraphNode_SequencePlayer_12' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_BlendSpaceSampleResult_12) == 0x000548, "Member 'UABP_Shamble_Common_C::AnimGraphNode_BlendSpaceSampleResult_12' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_SequencePlayer_11) == 0x000568, "Member 'UABP_Shamble_Common_C::AnimGraphNode_SequencePlayer_11' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_BlendSpaceSampleResult_11) == 0x0005B0, "Member 'UABP_Shamble_Common_C::AnimGraphNode_BlendSpaceSampleResult_11' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_SequencePlayer_10) == 0x0005D0, "Member 'UABP_Shamble_Common_C::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_BlendSpaceSampleResult_10) == 0x000618, "Member 'UABP_Shamble_Common_C::AnimGraphNode_BlendSpaceSampleResult_10' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_SequencePlayer_9) == 0x000638, "Member 'UABP_Shamble_Common_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_BlendSpaceSampleResult_9) == 0x000680, "Member 'UABP_Shamble_Common_C::AnimGraphNode_BlendSpaceSampleResult_9' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_SequencePlayer_8) == 0x0006A0, "Member 'UABP_Shamble_Common_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_BlendSpaceSampleResult_8) == 0x0006E8, "Member 'UABP_Shamble_Common_C::AnimGraphNode_BlendSpaceSampleResult_8' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_SequencePlayer_7) == 0x000708, "Member 'UABP_Shamble_Common_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_BlendSpaceSampleResult_7) == 0x000750, "Member 'UABP_Shamble_Common_C::AnimGraphNode_BlendSpaceSampleResult_7' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_SequencePlayer_6) == 0x000770, "Member 'UABP_Shamble_Common_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_BlendSpaceSampleResult_6) == 0x0007B8, "Member 'UABP_Shamble_Common_C::AnimGraphNode_BlendSpaceSampleResult_6' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_SequencePlayer_5) == 0x0007D8, "Member 'UABP_Shamble_Common_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_BlendSpaceSampleResult_5) == 0x000820, "Member 'UABP_Shamble_Common_C::AnimGraphNode_BlendSpaceSampleResult_5' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_SequencePlayer_4) == 0x000840, "Member 'UABP_Shamble_Common_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_BlendSpaceSampleResult_4) == 0x000888, "Member 'UABP_Shamble_Common_C::AnimGraphNode_BlendSpaceSampleResult_4' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_SequencePlayer_3) == 0x0008A8, "Member 'UABP_Shamble_Common_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_BlendSpaceSampleResult_3) == 0x0008F0, "Member 'UABP_Shamble_Common_C::AnimGraphNode_BlendSpaceSampleResult_3' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_SequencePlayer_2) == 0x000910, "Member 'UABP_Shamble_Common_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_BlendSpaceSampleResult_2) == 0x000958, "Member 'UABP_Shamble_Common_C::AnimGraphNode_BlendSpaceSampleResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_SequencePlayer_1) == 0x000978, "Member 'UABP_Shamble_Common_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_BlendSpaceSampleResult_1) == 0x0009C0, "Member 'UABP_Shamble_Common_C::AnimGraphNode_BlendSpaceSampleResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_SequencePlayer) == 0x0009E0, "Member 'UABP_Shamble_Common_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_BlendSpaceSampleResult) == 0x000A28, "Member 'UABP_Shamble_Common_C::AnimGraphNode_BlendSpaceSampleResult' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_BlendSpaceGraph) == 0x000A48, "Member 'UABP_Shamble_Common_C::AnimGraphNode_BlendSpaceGraph' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_StateResult) == 0x000AB0, "Member 'UABP_Shamble_Common_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, AnimGraphNode_StateMachine) == 0x000AD0, "Member 'UABP_Shamble_Common_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, Shamble) == 0x000B98, "Member 'UABP_Shamble_Common_C::Shamble' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, IsGrawling) == 0x000BA0, "Member 'UABP_Shamble_Common_C::IsGrawling' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, IsAttacking) == 0x000BA1, "Member 'UABP_Shamble_Common_C::IsAttacking' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, Speed) == 0x000BA8, "Member 'UABP_Shamble_Common_C::Speed' has a wrong offset!");
static_assert(offsetof(UABP_Shamble_Common_C, Direction) == 0x000BB0, "Member 'UABP_Shamble_Common_C::Direction' has a wrong offset!");

}

