#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_LowPolyAvatar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_LowPolyAvatar.ABP_LowPolyAvatar_C.AnimBlueprintGeneratedConstantData
// 0x0277 (0x0278 - 0x0001)
struct ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_790;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_791;                               // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_792;                                // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_793;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_794;                                // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_795;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_796;                                // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_797;                                 // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_798;                               // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_799;                               // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_800;                                // 0x003C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_801;                                // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_802;                                 // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_803;                                // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_804;                                 // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_805;                                // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_806;                                 // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_807;                                // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_808;                                 // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_809;                               // 0x0070(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_810;                               // 0x0080(0x0010)(BlueprintVisible)
	int32                                         __IntProperty_811;                                 // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_812;                                // 0x0094(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_813;                                 // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_814;                                // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_815;                                 // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_816;                                // 0x00AC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_817;                                 // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_818;                                // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_819;                                 // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_820;                                // 0x00C4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_821;                                // 0x00CC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_822;                                // 0x00D4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_823;                               // 0x00E0(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_824;                                // 0x00F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_825;                                // 0x00F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_826;                                 // 0x0100(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_827;                                // 0x0108(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_828;                                  // 0x0110(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_829;                                // 0x0118(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_830;                                // 0x0119(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_831;                               // 0x0120(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_832;                               // 0x0130(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_833;                                // 0x0140(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_834;                                 // 0x0148(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_835;                                // 0x014C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_836;                                 // 0x0154(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_837;                                // 0x0158(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_838;                               // 0x015C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_839;                              // 0x0160(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_840;                               // 0x018C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_841;                                // 0x0190(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_842;                                // 0x0191(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_843;                                // 0x0192(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_193[0x1];                                      // 0x0193(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_844;                                // 0x0194(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_845;                                // 0x019C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_846;                                 // 0x01A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_847;                              // 0x01A8(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x01C8(0x0080)()
	struct FAnimSubsystem_BlendSpaceGraph         AnimBlueprintExtension_BlendSpaceGraph;            // 0x0248(0x0018)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0260(0x0018)()
};
static_assert(alignof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData) == 0x000278, "Wrong size on ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __NameProperty_790) == 0x000004, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__NameProperty_790' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __FloatProperty_791) == 0x00000C, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__FloatProperty_791' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __NameProperty_792) == 0x000010, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__NameProperty_792' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __IntProperty_793) == 0x000018, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__IntProperty_793' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __NameProperty_794) == 0x00001C, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__NameProperty_794' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __IntProperty_795) == 0x000024, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__IntProperty_795' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __NameProperty_796) == 0x000028, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__NameProperty_796' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __IntProperty_797) == 0x000030, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__IntProperty_797' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __FloatProperty_798) == 0x000034, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__FloatProperty_798' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __FloatProperty_799) == 0x000038, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__FloatProperty_799' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __EnumProperty_800) == 0x00003C, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__EnumProperty_800' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __NameProperty_801) == 0x000040, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__NameProperty_801' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __IntProperty_802) == 0x000048, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__IntProperty_802' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __NameProperty_803) == 0x00004C, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__NameProperty_803' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __IntProperty_804) == 0x000054, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__IntProperty_804' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __NameProperty_805) == 0x000058, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__NameProperty_805' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __IntProperty_806) == 0x000060, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__IntProperty_806' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __NameProperty_807) == 0x000064, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__NameProperty_807' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __IntProperty_808) == 0x00006C, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__IntProperty_808' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __ArrayProperty_809) == 0x000070, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__ArrayProperty_809' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __ArrayProperty_810) == 0x000080, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__ArrayProperty_810' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __IntProperty_811) == 0x000090, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__IntProperty_811' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __NameProperty_812) == 0x000094, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__NameProperty_812' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __IntProperty_813) == 0x00009C, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__IntProperty_813' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __NameProperty_814) == 0x0000A0, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__NameProperty_814' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __IntProperty_815) == 0x0000A8, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__IntProperty_815' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __NameProperty_816) == 0x0000AC, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__NameProperty_816' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __IntProperty_817) == 0x0000B4, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__IntProperty_817' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __NameProperty_818) == 0x0000B8, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__NameProperty_818' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __IntProperty_819) == 0x0000C0, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__IntProperty_819' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __NameProperty_820) == 0x0000C4, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__NameProperty_820' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __NameProperty_821) == 0x0000CC, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__NameProperty_821' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __NameProperty_822) == 0x0000D4, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__NameProperty_822' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __ArrayProperty_823) == 0x0000E0, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__ArrayProperty_823' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __NameProperty_824) == 0x0000F0, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__NameProperty_824' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __NameProperty_825) == 0x0000F8, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__NameProperty_825' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __IntProperty_826) == 0x000100, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__IntProperty_826' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __BlendProfile_827) == 0x000108, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__BlendProfile_827' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __CurveFloat_828) == 0x000110, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__CurveFloat_828' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __EnumProperty_829) == 0x000118, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__EnumProperty_829' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __EnumProperty_830) == 0x000119, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__EnumProperty_830' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __ArrayProperty_831) == 0x000120, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__ArrayProperty_831' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __ArrayProperty_832) == 0x000130, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__ArrayProperty_832' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __NameProperty_833) == 0x000140, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__NameProperty_833' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __IntProperty_834) == 0x000148, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__IntProperty_834' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __NameProperty_835) == 0x00014C, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__NameProperty_835' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __IntProperty_836) == 0x000154, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__IntProperty_836' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __BoolProperty_837) == 0x000158, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__BoolProperty_837' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __FloatProperty_838) == 0x00015C, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__FloatProperty_838' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __StructProperty_839) == 0x000160, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__StructProperty_839' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __FloatProperty_840) == 0x00018C, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__FloatProperty_840' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __BoolProperty_841) == 0x000190, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__BoolProperty_841' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __EnumProperty_842) == 0x000191, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__EnumProperty_842' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __ByteProperty_843) == 0x000192, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__ByteProperty_843' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __NameProperty_844) == 0x000194, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__NameProperty_844' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __NameProperty_845) == 0x00019C, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__NameProperty_845' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __IntProperty_846) == 0x0001A4, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__IntProperty_846' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, __StructProperty_847) == 0x0001A8, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::__StructProperty_847' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0001C8, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_BlendSpaceGraph) == 0x000248, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_BlendSpaceGraph' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000260, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_LowPolyAvatar.ABP_LowPolyAvatar_C.AnimBlueprintGeneratedMutableData
// 0x0023 (0x0024 - 0x0001)
struct ABP_LowPolyAvatar::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         __ByteProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_0;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_4;                                  // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_5;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_7;                                  // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_LowPolyAvatar::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedMutableData) == 0x000024, "Wrong size on ABP_LowPolyAvatar::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedMutableData, __ByteProperty) == 0x000001, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedMutableData::__ByteProperty' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000004, "Member 'ABP_LowPolyAvatar::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
