#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Parasite

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Parasite.ABP_Parasite_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Parasite_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Parasite_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Parasite_C_AnimGraph");
static_assert(sizeof(ABP_Parasite_C_AnimGraph) == 0x000010, "Wrong size on ABP_Parasite_C_AnimGraph");
static_assert(offsetof(ABP_Parasite_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Parasite_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Parasite.ABP_Parasite_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Parasite_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Parasite_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Parasite_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Parasite_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Parasite_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Parasite_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Parasite_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Parasite.ABP_Parasite_C.ExecuteUbergraph_ABP_Parasite
// 0x0058 (0x0058 - 0x0000)
struct ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Parasite_C*                         K2Node_DynamicCast_AsBP_Parasite;                  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFraction_ReturnValue; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_VariableSet_Speed_ImplicitCast;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite) == 0x000008, "Wrong alignment on ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite");
static_assert(sizeof(ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite) == 0x000058, "Wrong size on ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite");
static_assert(offsetof(ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite, EntryPoint) == 0x000000, "Member 'ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite, CallFunc_GetVelocity_ReturnValue) == 0x000008, "Member 'ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000020, "Member 'ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite, CallFunc_VSize_ReturnValue) == 0x000028, "Member 'ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite, K2Node_DynamicCast_AsBP_Parasite) == 0x000030, "Member 'ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite::K2Node_DynamicCast_AsBP_Parasite' has a wrong offset!");
static_assert(offsetof(ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite, CallFunc_Not_PreBool_ReturnValue) == 0x00003A, "Member 'ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite, CallFunc_BooleanAND_ReturnValue) == 0x00003B, "Member 'ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite, CallFunc_IsValid_ReturnValue_1) == 0x00003C, "Member 'ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite, CallFunc_GetInstanceAssetPlayerTimeFraction_ReturnValue) == 0x000040, "Member 'ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite::CallFunc_GetInstanceAssetPlayerTimeFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000044, "Member 'ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite, K2Node_VariableSet_Speed_ImplicitCast) == 0x000048, "Member 'ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite::K2Node_VariableSet_Speed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x000050, "Member 'ABP_Parasite_C_ExecuteUbergraph_ABP_Parasite::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

