#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Shiny

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Shiny.ABP_Shiny_C.AnimBlueprintGeneratedConstantData
// 0x0147 (0x0148 - 0x0001)
struct ABP_Shiny::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_185;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_186;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_187;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_188;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_189;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_190;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_191;                                // 0x002C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_192;                                 // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_193;                               // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_194;                              // 0x003C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_195;                               // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_196;                                // 0x006C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_197;                                // 0x006D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_198;                                // 0x006E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_199;                                // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_200;                                // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_201;                                // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_202;                                 // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_203;                              // 0x0090(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0130(0x0018)()
};
static_assert(alignof(ABP_Shiny::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Shiny::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Shiny::FAnimBlueprintGeneratedConstantData) == 0x000148, "Wrong size on ABP_Shiny::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Shiny::FAnimBlueprintGeneratedConstantData, __NameProperty_185) == 0x000004, "Member 'ABP_Shiny::FAnimBlueprintGeneratedConstantData::__NameProperty_185' has a wrong offset!");
static_assert(offsetof(ABP_Shiny::FAnimBlueprintGeneratedConstantData, __NameProperty_186) == 0x00000C, "Member 'ABP_Shiny::FAnimBlueprintGeneratedConstantData::__NameProperty_186' has a wrong offset!");
static_assert(offsetof(ABP_Shiny::FAnimBlueprintGeneratedConstantData, __IntProperty_187) == 0x000014, "Member 'ABP_Shiny::FAnimBlueprintGeneratedConstantData::__IntProperty_187' has a wrong offset!");
static_assert(offsetof(ABP_Shiny::FAnimBlueprintGeneratedConstantData, __NameProperty_188) == 0x000018, "Member 'ABP_Shiny::FAnimBlueprintGeneratedConstantData::__NameProperty_188' has a wrong offset!");
static_assert(offsetof(ABP_Shiny::FAnimBlueprintGeneratedConstantData, __IntProperty_189) == 0x000020, "Member 'ABP_Shiny::FAnimBlueprintGeneratedConstantData::__IntProperty_189' has a wrong offset!");
static_assert(offsetof(ABP_Shiny::FAnimBlueprintGeneratedConstantData, __NameProperty_190) == 0x000024, "Member 'ABP_Shiny::FAnimBlueprintGeneratedConstantData::__NameProperty_190' has a wrong offset!");
static_assert(offsetof(ABP_Shiny::FAnimBlueprintGeneratedConstantData, __NameProperty_191) == 0x00002C, "Member 'ABP_Shiny::FAnimBlueprintGeneratedConstantData::__NameProperty_191' has a wrong offset!");
static_assert(offsetof(ABP_Shiny::FAnimBlueprintGeneratedConstantData, __IntProperty_192) == 0x000034, "Member 'ABP_Shiny::FAnimBlueprintGeneratedConstantData::__IntProperty_192' has a wrong offset!");
static_assert(offsetof(ABP_Shiny::FAnimBlueprintGeneratedConstantData, __FloatProperty_193) == 0x000038, "Member 'ABP_Shiny::FAnimBlueprintGeneratedConstantData::__FloatProperty_193' has a wrong offset!");
static_assert(offsetof(ABP_Shiny::FAnimBlueprintGeneratedConstantData, __StructProperty_194) == 0x00003C, "Member 'ABP_Shiny::FAnimBlueprintGeneratedConstantData::__StructProperty_194' has a wrong offset!");
static_assert(offsetof(ABP_Shiny::FAnimBlueprintGeneratedConstantData, __FloatProperty_195) == 0x000068, "Member 'ABP_Shiny::FAnimBlueprintGeneratedConstantData::__FloatProperty_195' has a wrong offset!");
static_assert(offsetof(ABP_Shiny::FAnimBlueprintGeneratedConstantData, __BoolProperty_196) == 0x00006C, "Member 'ABP_Shiny::FAnimBlueprintGeneratedConstantData::__BoolProperty_196' has a wrong offset!");
static_assert(offsetof(ABP_Shiny::FAnimBlueprintGeneratedConstantData, __EnumProperty_197) == 0x00006D, "Member 'ABP_Shiny::FAnimBlueprintGeneratedConstantData::__EnumProperty_197' has a wrong offset!");
static_assert(offsetof(ABP_Shiny::FAnimBlueprintGeneratedConstantData, __ByteProperty_198) == 0x00006E, "Member 'ABP_Shiny::FAnimBlueprintGeneratedConstantData::__ByteProperty_198' has a wrong offset!");
static_assert(offsetof(ABP_Shiny::FAnimBlueprintGeneratedConstantData, __NameProperty_199) == 0x000070, "Member 'ABP_Shiny::FAnimBlueprintGeneratedConstantData::__NameProperty_199' has a wrong offset!");
static_assert(offsetof(ABP_Shiny::FAnimBlueprintGeneratedConstantData, __NameProperty_200) == 0x000078, "Member 'ABP_Shiny::FAnimBlueprintGeneratedConstantData::__NameProperty_200' has a wrong offset!");
static_assert(offsetof(ABP_Shiny::FAnimBlueprintGeneratedConstantData, __NameProperty_201) == 0x000080, "Member 'ABP_Shiny::FAnimBlueprintGeneratedConstantData::__NameProperty_201' has a wrong offset!");
static_assert(offsetof(ABP_Shiny::FAnimBlueprintGeneratedConstantData, __IntProperty_202) == 0x000088, "Member 'ABP_Shiny::FAnimBlueprintGeneratedConstantData::__IntProperty_202' has a wrong offset!");
static_assert(offsetof(ABP_Shiny::FAnimBlueprintGeneratedConstantData, __StructProperty_203) == 0x000090, "Member 'ABP_Shiny::FAnimBlueprintGeneratedConstantData::__StructProperty_203' has a wrong offset!");
static_assert(offsetof(ABP_Shiny::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B0, "Member 'ABP_Shiny::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Shiny::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000130, "Member 'ABP_Shiny::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

