#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Insect

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Insect.ABP_Insect_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Insect_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Insect_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Insect_C_AnimGraph");
static_assert(sizeof(ABP_Insect_C_AnimGraph) == 0x000010, "Wrong size on ABP_Insect_C_AnimGraph");
static_assert(offsetof(ABP_Insect_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Insect_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Insect.ABP_Insect_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Insect_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Insect_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Insect_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Insect_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Insect_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Insect_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Insect_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Insect.ABP_Insect_C.ExecuteUbergraph_ABP_Insect
// 0x0070 (0x0070 - 0x0000)
struct ABP_Insect_C_ExecuteUbergraph_ABP_Insect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue_1; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Insect_C*                           K2Node_DynamicCast_AsBP_Insect;                    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Insect_C_ExecuteUbergraph_ABP_Insect) == 0x000008, "Wrong alignment on ABP_Insect_C_ExecuteUbergraph_ABP_Insect");
static_assert(sizeof(ABP_Insect_C_ExecuteUbergraph_ABP_Insect) == 0x000070, "Wrong size on ABP_Insect_C_ExecuteUbergraph_ABP_Insect");
static_assert(offsetof(ABP_Insect_C_ExecuteUbergraph_ABP_Insect, EntryPoint) == 0x000000, "Member 'ABP_Insect_C_ExecuteUbergraph_ABP_Insect::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Insect_C_ExecuteUbergraph_ABP_Insect, CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue) == 0x000004, "Member 'ABP_Insect_C_ExecuteUbergraph_ABP_Insect::CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Insect_C_ExecuteUbergraph_ABP_Insect, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000008, "Member 'ABP_Insect_C_ExecuteUbergraph_ABP_Insect::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Insect_C_ExecuteUbergraph_ABP_Insect, CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue_1) == 0x00000C, "Member 'ABP_Insect_C_ExecuteUbergraph_ABP_Insect::CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Insect_C_ExecuteUbergraph_ABP_Insect, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000010, "Member 'ABP_Insect_C_ExecuteUbergraph_ABP_Insect::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Insect_C_ExecuteUbergraph_ABP_Insect, K2Node_Event_DeltaTimeX) == 0x000014, "Member 'ABP_Insect_C_ExecuteUbergraph_ABP_Insect::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_Insect_C_ExecuteUbergraph_ABP_Insect, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000018, "Member 'ABP_Insect_C_ExecuteUbergraph_ABP_Insect::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Insect_C_ExecuteUbergraph_ABP_Insect, K2Node_DynamicCast_AsBP_Insect) == 0x000020, "Member 'ABP_Insect_C_ExecuteUbergraph_ABP_Insect::K2Node_DynamicCast_AsBP_Insect' has a wrong offset!");
static_assert(offsetof(ABP_Insect_C_ExecuteUbergraph_ABP_Insect, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'ABP_Insect_C_ExecuteUbergraph_ABP_Insect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Insect_C_ExecuteUbergraph_ABP_Insect, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'ABP_Insect_C_ExecuteUbergraph_ABP_Insect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Insect_C_ExecuteUbergraph_ABP_Insect, CallFunc_GetVelocity_ReturnValue) == 0x000030, "Member 'ABP_Insect_C_ExecuteUbergraph_ABP_Insect::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Insect_C_ExecuteUbergraph_ABP_Insect, CallFunc_GetMovementComponent_ReturnValue) == 0x000048, "Member 'ABP_Insect_C_ExecuteUbergraph_ABP_Insect::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Insect_C_ExecuteUbergraph_ABP_Insect, CallFunc_VSize_ReturnValue) == 0x000050, "Member 'ABP_Insect_C_ExecuteUbergraph_ABP_Insect::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Insect_C_ExecuteUbergraph_ABP_Insect, CallFunc_IsFalling_ReturnValue) == 0x000058, "Member 'ABP_Insect_C_ExecuteUbergraph_ABP_Insect::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Insect_C_ExecuteUbergraph_ABP_Insect, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000060, "Member 'ABP_Insect_C_ExecuteUbergraph_ABP_Insect::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Insect_C_ExecuteUbergraph_ABP_Insect, CallFunc_Less_DoubleDouble_A_ImplicitCast_1) == 0x000068, "Member 'ABP_Insect_C_ExecuteUbergraph_ABP_Insect::CallFunc_Less_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

}

