#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Shamble_Rare

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Shamble_Rare.ABP_Shamble_Rare_C.AnimBlueprintGeneratedConstantData
// 0x0147 (0x0148 - 0x0001)
struct ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_331;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_332;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_333;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_334;                                // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_335;                                // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_336;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_337;                                // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_338;                               // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_339;                              // 0x0030(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_340;                               // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_341;                                // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_342;                                // 0x0061(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_343;                                // 0x0062(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x1];                                       // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_344;                                // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_345;                                // 0x006C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_346;                                 // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_347;                              // 0x0078(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0098(0x0080)()
	struct FAnimSubsystem_BlendSpaceGraph         AnimBlueprintExtension_BlendSpaceGraph;            // 0x0118(0x0018)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0130(0x0018)()
};
static_assert(alignof(ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData) == 0x000148, "Wrong size on ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData, __NameProperty_331) == 0x000004, "Member 'ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData::__NameProperty_331' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData, __NameProperty_332) == 0x00000C, "Member 'ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData::__NameProperty_332' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData, __IntProperty_333) == 0x000014, "Member 'ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData::__IntProperty_333' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData, __EnumProperty_334) == 0x000018, "Member 'ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData::__EnumProperty_334' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData, __NameProperty_335) == 0x00001C, "Member 'ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData::__NameProperty_335' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData, __IntProperty_336) == 0x000024, "Member 'ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData::__IntProperty_336' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData, __BoolProperty_337) == 0x000028, "Member 'ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData::__BoolProperty_337' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData, __FloatProperty_338) == 0x00002C, "Member 'ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData::__FloatProperty_338' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData, __StructProperty_339) == 0x000030, "Member 'ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData::__StructProperty_339' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData, __FloatProperty_340) == 0x00005C, "Member 'ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData::__FloatProperty_340' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData, __BoolProperty_341) == 0x000060, "Member 'ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData::__BoolProperty_341' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData, __EnumProperty_342) == 0x000061, "Member 'ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData::__EnumProperty_342' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData, __ByteProperty_343) == 0x000062, "Member 'ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData::__ByteProperty_343' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData, __NameProperty_344) == 0x000064, "Member 'ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData::__NameProperty_344' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData, __NameProperty_345) == 0x00006C, "Member 'ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData::__NameProperty_345' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData, __IntProperty_346) == 0x000074, "Member 'ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData::__IntProperty_346' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData, __StructProperty_347) == 0x000078, "Member 'ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData::__StructProperty_347' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000098, "Member 'ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_BlendSpaceGraph) == 0x000118, "Member 'ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_BlendSpaceGraph' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000130, "Member 'ABP_Shamble_Rare::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

