#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Insect

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Insect.ABP_Insect_C.AnimBlueprintGeneratedConstantData
// 0x0147 (0x0148 - 0x0001)
struct ABP_Insect::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_119;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_120;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_121;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_122;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_123;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_124;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_125;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_126;                              // 0x0030(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_127;                                // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_128;                                 // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_129;                                // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_130;                               // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_131;                               // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_132;                                // 0x0074(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_133;                                // 0x0075(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_134;                                // 0x0076(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77[0x1];                                       // 0x0077(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_135;                                // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_136;                                // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_137;                                 // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_138;                              // 0x0090(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0130(0x0018)()
};
static_assert(alignof(ABP_Insect::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Insect::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Insect::FAnimBlueprintGeneratedConstantData) == 0x000148, "Wrong size on ABP_Insect::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Insect::FAnimBlueprintGeneratedConstantData, __NameProperty_119) == 0x000004, "Member 'ABP_Insect::FAnimBlueprintGeneratedConstantData::__NameProperty_119' has a wrong offset!");
static_assert(offsetof(ABP_Insect::FAnimBlueprintGeneratedConstantData, __NameProperty_120) == 0x00000C, "Member 'ABP_Insect::FAnimBlueprintGeneratedConstantData::__NameProperty_120' has a wrong offset!");
static_assert(offsetof(ABP_Insect::FAnimBlueprintGeneratedConstantData, __IntProperty_121) == 0x000014, "Member 'ABP_Insect::FAnimBlueprintGeneratedConstantData::__IntProperty_121' has a wrong offset!");
static_assert(offsetof(ABP_Insect::FAnimBlueprintGeneratedConstantData, __NameProperty_122) == 0x000018, "Member 'ABP_Insect::FAnimBlueprintGeneratedConstantData::__NameProperty_122' has a wrong offset!");
static_assert(offsetof(ABP_Insect::FAnimBlueprintGeneratedConstantData, __IntProperty_123) == 0x000020, "Member 'ABP_Insect::FAnimBlueprintGeneratedConstantData::__IntProperty_123' has a wrong offset!");
static_assert(offsetof(ABP_Insect::FAnimBlueprintGeneratedConstantData, __NameProperty_124) == 0x000024, "Member 'ABP_Insect::FAnimBlueprintGeneratedConstantData::__NameProperty_124' has a wrong offset!");
static_assert(offsetof(ABP_Insect::FAnimBlueprintGeneratedConstantData, __IntProperty_125) == 0x00002C, "Member 'ABP_Insect::FAnimBlueprintGeneratedConstantData::__IntProperty_125' has a wrong offset!");
static_assert(offsetof(ABP_Insect::FAnimBlueprintGeneratedConstantData, __StructProperty_126) == 0x000030, "Member 'ABP_Insect::FAnimBlueprintGeneratedConstantData::__StructProperty_126' has a wrong offset!");
static_assert(offsetof(ABP_Insect::FAnimBlueprintGeneratedConstantData, __NameProperty_127) == 0x00005C, "Member 'ABP_Insect::FAnimBlueprintGeneratedConstantData::__NameProperty_127' has a wrong offset!");
static_assert(offsetof(ABP_Insect::FAnimBlueprintGeneratedConstantData, __IntProperty_128) == 0x000064, "Member 'ABP_Insect::FAnimBlueprintGeneratedConstantData::__IntProperty_128' has a wrong offset!");
static_assert(offsetof(ABP_Insect::FAnimBlueprintGeneratedConstantData, __BoolProperty_129) == 0x000068, "Member 'ABP_Insect::FAnimBlueprintGeneratedConstantData::__BoolProperty_129' has a wrong offset!");
static_assert(offsetof(ABP_Insect::FAnimBlueprintGeneratedConstantData, __FloatProperty_130) == 0x00006C, "Member 'ABP_Insect::FAnimBlueprintGeneratedConstantData::__FloatProperty_130' has a wrong offset!");
static_assert(offsetof(ABP_Insect::FAnimBlueprintGeneratedConstantData, __FloatProperty_131) == 0x000070, "Member 'ABP_Insect::FAnimBlueprintGeneratedConstantData::__FloatProperty_131' has a wrong offset!");
static_assert(offsetof(ABP_Insect::FAnimBlueprintGeneratedConstantData, __BoolProperty_132) == 0x000074, "Member 'ABP_Insect::FAnimBlueprintGeneratedConstantData::__BoolProperty_132' has a wrong offset!");
static_assert(offsetof(ABP_Insect::FAnimBlueprintGeneratedConstantData, __EnumProperty_133) == 0x000075, "Member 'ABP_Insect::FAnimBlueprintGeneratedConstantData::__EnumProperty_133' has a wrong offset!");
static_assert(offsetof(ABP_Insect::FAnimBlueprintGeneratedConstantData, __ByteProperty_134) == 0x000076, "Member 'ABP_Insect::FAnimBlueprintGeneratedConstantData::__ByteProperty_134' has a wrong offset!");
static_assert(offsetof(ABP_Insect::FAnimBlueprintGeneratedConstantData, __NameProperty_135) == 0x000078, "Member 'ABP_Insect::FAnimBlueprintGeneratedConstantData::__NameProperty_135' has a wrong offset!");
static_assert(offsetof(ABP_Insect::FAnimBlueprintGeneratedConstantData, __NameProperty_136) == 0x000080, "Member 'ABP_Insect::FAnimBlueprintGeneratedConstantData::__NameProperty_136' has a wrong offset!");
static_assert(offsetof(ABP_Insect::FAnimBlueprintGeneratedConstantData, __IntProperty_137) == 0x000088, "Member 'ABP_Insect::FAnimBlueprintGeneratedConstantData::__IntProperty_137' has a wrong offset!");
static_assert(offsetof(ABP_Insect::FAnimBlueprintGeneratedConstantData, __StructProperty_138) == 0x000090, "Member 'ABP_Insect::FAnimBlueprintGeneratedConstantData::__StructProperty_138' has a wrong offset!");
static_assert(offsetof(ABP_Insect::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B0, "Member 'ABP_Insect::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Insect::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000130, "Member 'ABP_Insect::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_Insect.ABP_Insect_C.AnimBlueprintGeneratedMutableData
// 0x0007 (0x0008 - 0x0001)
struct ABP_Insect::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Insect::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_Insect::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_Insect::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong size on ABP_Insect::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_Insect::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_Insect::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");

}

