#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Velociralien

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Velociralien.ABP_Velociralien_C.AnimBlueprintGeneratedConstantData
// 0x012F (0x0130 - 0x0001)
struct ABP_Velociralien::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_73;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_74;                                // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_75;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_76;                                  // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_77;                               // 0x001C(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_78;                                 // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_79;                                  // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_80;                                 // 0x0054(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_81;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_82;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_83;                                 // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_84;                                 // 0x0061(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_85;                                 // 0x0062(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x1];                                       // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_86;                                 // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_87;                                 // 0x006C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_88;                                  // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_89;                               // 0x0078(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0098(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0118(0x0018)()
};
static_assert(alignof(ABP_Velociralien::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Velociralien::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Velociralien::FAnimBlueprintGeneratedConstantData) == 0x000130, "Wrong size on ABP_Velociralien::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Velociralien::FAnimBlueprintGeneratedConstantData, __NameProperty_73) == 0x000004, "Member 'ABP_Velociralien::FAnimBlueprintGeneratedConstantData::__NameProperty_73' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien::FAnimBlueprintGeneratedConstantData, __FloatProperty_74) == 0x00000C, "Member 'ABP_Velociralien::FAnimBlueprintGeneratedConstantData::__FloatProperty_74' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien::FAnimBlueprintGeneratedConstantData, __NameProperty_75) == 0x000010, "Member 'ABP_Velociralien::FAnimBlueprintGeneratedConstantData::__NameProperty_75' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien::FAnimBlueprintGeneratedConstantData, __IntProperty_76) == 0x000018, "Member 'ABP_Velociralien::FAnimBlueprintGeneratedConstantData::__IntProperty_76' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien::FAnimBlueprintGeneratedConstantData, __StructProperty_77) == 0x00001C, "Member 'ABP_Velociralien::FAnimBlueprintGeneratedConstantData::__StructProperty_77' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien::FAnimBlueprintGeneratedConstantData, __NameProperty_78) == 0x000048, "Member 'ABP_Velociralien::FAnimBlueprintGeneratedConstantData::__NameProperty_78' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien::FAnimBlueprintGeneratedConstantData, __IntProperty_79) == 0x000050, "Member 'ABP_Velociralien::FAnimBlueprintGeneratedConstantData::__IntProperty_79' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien::FAnimBlueprintGeneratedConstantData, __BoolProperty_80) == 0x000054, "Member 'ABP_Velociralien::FAnimBlueprintGeneratedConstantData::__BoolProperty_80' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien::FAnimBlueprintGeneratedConstantData, __FloatProperty_81) == 0x000058, "Member 'ABP_Velociralien::FAnimBlueprintGeneratedConstantData::__FloatProperty_81' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien::FAnimBlueprintGeneratedConstantData, __FloatProperty_82) == 0x00005C, "Member 'ABP_Velociralien::FAnimBlueprintGeneratedConstantData::__FloatProperty_82' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien::FAnimBlueprintGeneratedConstantData, __BoolProperty_83) == 0x000060, "Member 'ABP_Velociralien::FAnimBlueprintGeneratedConstantData::__BoolProperty_83' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien::FAnimBlueprintGeneratedConstantData, __EnumProperty_84) == 0x000061, "Member 'ABP_Velociralien::FAnimBlueprintGeneratedConstantData::__EnumProperty_84' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien::FAnimBlueprintGeneratedConstantData, __ByteProperty_85) == 0x000062, "Member 'ABP_Velociralien::FAnimBlueprintGeneratedConstantData::__ByteProperty_85' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien::FAnimBlueprintGeneratedConstantData, __NameProperty_86) == 0x000064, "Member 'ABP_Velociralien::FAnimBlueprintGeneratedConstantData::__NameProperty_86' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien::FAnimBlueprintGeneratedConstantData, __NameProperty_87) == 0x00006C, "Member 'ABP_Velociralien::FAnimBlueprintGeneratedConstantData::__NameProperty_87' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien::FAnimBlueprintGeneratedConstantData, __IntProperty_88) == 0x000074, "Member 'ABP_Velociralien::FAnimBlueprintGeneratedConstantData::__IntProperty_88' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien::FAnimBlueprintGeneratedConstantData, __StructProperty_89) == 0x000078, "Member 'ABP_Velociralien::FAnimBlueprintGeneratedConstantData::__StructProperty_89' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000098, "Member 'ABP_Velociralien::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000118, "Member 'ABP_Velociralien::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_Velociralien.ABP_Velociralien_C.AnimBlueprintGeneratedMutableData
// 0x0007 (0x0008 - 0x0001)
struct ABP_Velociralien::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Velociralien::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_Velociralien::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_Velociralien::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong size on ABP_Velociralien::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_Velociralien::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_Velociralien::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");

}

