#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Rattler

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ABP_Rattler_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Rattler.ABP_Rattler_C
// 0x0280 (0x05D0 - 0x0350)
class UABP_Rattler_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_Rattler::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                  // 0x0358(0x000C)(HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0368(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0370(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0378(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0398(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x03C0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x03E8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0430(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0450(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x04C0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x04E0(0x00C8)()
	bool                                          IsAttacking;                                       // 0x05A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A9[0x7];                                      // 0x05A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Speed;                                             // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Direction;                                         // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Rattler_C*                          Rattler;                                           // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_Footstep();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ABP_Rattler(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Rattler_C">();
	}
	static class UABP_Rattler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Rattler_C>();
	}
};
static_assert(alignof(UABP_Rattler_C) == 0x000010, "Wrong alignment on UABP_Rattler_C");
static_assert(sizeof(UABP_Rattler_C) == 0x0005D0, "Wrong size on UABP_Rattler_C");
static_assert(offsetof(UABP_Rattler_C, UberGraphFrame) == 0x000350, "Member 'UABP_Rattler_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Rattler_C, __AnimBlueprintMutables) == 0x000358, "Member 'UABP_Rattler_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_Rattler_C, AnimBlueprintExtension_PropertyAccess) == 0x000368, "Member 'UABP_Rattler_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Rattler_C, AnimBlueprintExtension_Base) == 0x000370, "Member 'UABP_Rattler_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_Rattler_C, AnimGraphNode_Root) == 0x000378, "Member 'UABP_Rattler_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Rattler_C, AnimGraphNode_TransitionResult_1) == 0x000398, "Member 'UABP_Rattler_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Rattler_C, AnimGraphNode_TransitionResult) == 0x0003C0, "Member 'UABP_Rattler_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_Rattler_C, AnimGraphNode_SequencePlayer) == 0x0003E8, "Member 'UABP_Rattler_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Rattler_C, AnimGraphNode_StateResult_1) == 0x000430, "Member 'UABP_Rattler_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Rattler_C, AnimGraphNode_BlendSpacePlayer) == 0x000450, "Member 'UABP_Rattler_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Rattler_C, AnimGraphNode_StateResult) == 0x0004C0, "Member 'UABP_Rattler_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_Rattler_C, AnimGraphNode_StateMachine) == 0x0004E0, "Member 'UABP_Rattler_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Rattler_C, IsAttacking) == 0x0005A8, "Member 'UABP_Rattler_C::IsAttacking' has a wrong offset!");
static_assert(offsetof(UABP_Rattler_C, Speed) == 0x0005B0, "Member 'UABP_Rattler_C::Speed' has a wrong offset!");
static_assert(offsetof(UABP_Rattler_C, Direction) == 0x0005B8, "Member 'UABP_Rattler_C::Direction' has a wrong offset!");
static_assert(offsetof(UABP_Rattler_C, Rattler) == 0x0005C0, "Member 'UABP_Rattler_C::Rattler' has a wrong offset!");

}

