#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Shiny

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Shiny.ABP_Shiny_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Shiny_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Shiny_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Shiny_C_AnimGraph");
static_assert(sizeof(ABP_Shiny_C_AnimGraph) == 0x000010, "Wrong size on ABP_Shiny_C_AnimGraph");
static_assert(offsetof(ABP_Shiny_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Shiny_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Shiny.ABP_Shiny_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Shiny_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Shiny_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Shiny_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Shiny_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Shiny_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Shiny_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Shiny_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Shiny.ABP_Shiny_C.ExecuteUbergraph_ABP_Shiny
// 0x00C8 (0x00C8 - 0x0000)
struct ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalculateDirection_ReturnValue;           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue_1;                // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Shiny_C*                            K2Node_DynamicCast_AsBP_Shiny;                     // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_2;     // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_3;     // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_4;     // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_Direction_ImplicitCast;         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1;  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_2;  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_3;  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny) == 0x000008, "Wrong alignment on ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny");
static_assert(sizeof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny) == 0x0000C8, "Wrong size on ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny");
static_assert(offsetof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny, EntryPoint) == 0x000000, "Member 'ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000008, "Member 'ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny, CallFunc_GetVelocity_ReturnValue) == 0x000020, "Member 'ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny, CallFunc_CalculateDirection_ReturnValue) == 0x000038, "Member 'ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny::CallFunc_CalculateDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny, CallFunc_GetVelocity_ReturnValue_1) == 0x000040, "Member 'ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny::CallFunc_GetVelocity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny, CallFunc_VSize_ReturnValue) == 0x000060, "Member 'ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000068, "Member 'ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1) == 0x00006C, "Member 'ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000070, "Member 'ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x000071, "Member 'ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny, K2Node_Event_DeltaTimeX) == 0x000074, "Member 'ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000078, "Member 'ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2) == 0x000080, "Member 'ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny, K2Node_DynamicCast_AsBP_Shiny) == 0x000088, "Member 'ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny::K2Node_DynamicCast_AsBP_Shiny' has a wrong offset!");
static_assert(offsetof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny, CallFunc_LessEqual_DoubleDouble_ReturnValue_2) == 0x000091, "Member 'ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny::CallFunc_LessEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny, CallFunc_IsValid_ReturnValue_1) == 0x000092, "Member 'ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny, CallFunc_LessEqual_DoubleDouble_ReturnValue_3) == 0x000093, "Member 'ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny::CallFunc_LessEqual_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000094, "Member 'ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3) == 0x000098, "Member 'ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny, CallFunc_LessEqual_DoubleDouble_ReturnValue_4) == 0x00009C, "Member 'ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny::CallFunc_LessEqual_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny, K2Node_VariableSet_Direction_ImplicitCast) == 0x0000A0, "Member 'ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny::K2Node_VariableSet_Direction_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x0000A8, "Member 'ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1) == 0x0000B0, "Member 'ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_2) == 0x0000B8, "Member 'ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_3) == 0x0000C0, "Member 'ABP_Shiny_C_ExecuteUbergraph_ABP_Shiny::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");

}

