#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Velociralien

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Velociralien.ABP_Velociralien_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Velociralien_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Velociralien_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Velociralien_C_AnimGraph");
static_assert(sizeof(ABP_Velociralien_C_AnimGraph) == 0x000010, "Wrong size on ABP_Velociralien_C_AnimGraph");
static_assert(offsetof(ABP_Velociralien_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Velociralien_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Velociralien.ABP_Velociralien_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Velociralien_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Velociralien_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Velociralien_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Velociralien_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Velociralien_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Velociralien_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Velociralien_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Velociralien.ABP_Velociralien_C.ExecuteUbergraph_ABP_Velociralien
// 0x0060 (0x0060 - 0x0000)
struct ABP_Velociralien_C_ExecuteUbergraph_ABP_Velociralien final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_1;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Velociralien_C*                     K2Node_DynamicCast_AsBP_Velociralien;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Velociralien_C_ExecuteUbergraph_ABP_Velociralien) == 0x000008, "Wrong alignment on ABP_Velociralien_C_ExecuteUbergraph_ABP_Velociralien");
static_assert(sizeof(ABP_Velociralien_C_ExecuteUbergraph_ABP_Velociralien) == 0x000060, "Wrong size on ABP_Velociralien_C_ExecuteUbergraph_ABP_Velociralien");
static_assert(offsetof(ABP_Velociralien_C_ExecuteUbergraph_ABP_Velociralien, EntryPoint) == 0x000000, "Member 'ABP_Velociralien_C_ExecuteUbergraph_ABP_Velociralien::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C_ExecuteUbergraph_ABP_Velociralien, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000008, "Member 'ABP_Velociralien_C_ExecuteUbergraph_ABP_Velociralien::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C_ExecuteUbergraph_ABP_Velociralien, K2Node_Event_DeltaTimeX) == 0x000010, "Member 'ABP_Velociralien_C_ExecuteUbergraph_ABP_Velociralien::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C_ExecuteUbergraph_ABP_Velociralien, CallFunc_Conv_BoolToDouble_ReturnValue_1) == 0x000018, "Member 'ABP_Velociralien_C_ExecuteUbergraph_ABP_Velociralien::CallFunc_Conv_BoolToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C_ExecuteUbergraph_ABP_Velociralien, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000020, "Member 'ABP_Velociralien_C_ExecuteUbergraph_ABP_Velociralien::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C_ExecuteUbergraph_ABP_Velociralien, K2Node_DynamicCast_AsBP_Velociralien) == 0x000028, "Member 'ABP_Velociralien_C_ExecuteUbergraph_ABP_Velociralien::K2Node_DynamicCast_AsBP_Velociralien' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C_ExecuteUbergraph_ABP_Velociralien, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'ABP_Velociralien_C_ExecuteUbergraph_ABP_Velociralien::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C_ExecuteUbergraph_ABP_Velociralien, CallFunc_GetVelocity_ReturnValue) == 0x000038, "Member 'ABP_Velociralien_C_ExecuteUbergraph_ABP_Velociralien::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C_ExecuteUbergraph_ABP_Velociralien, CallFunc_VSize_ReturnValue) == 0x000050, "Member 'ABP_Velociralien_C_ExecuteUbergraph_ABP_Velociralien::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C_ExecuteUbergraph_ABP_Velociralien, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'ABP_Velociralien_C_ExecuteUbergraph_ABP_Velociralien::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C_ExecuteUbergraph_ABP_Velociralien, CallFunc_IsValid_ReturnValue_1) == 0x000059, "Member 'ABP_Velociralien_C_ExecuteUbergraph_ABP_Velociralien::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

