#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Shamble_Common

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Shamble_Common.ABP_Shamble_Common_C.AnimBlueprintGeneratedConstantData
// 0x0147 (0x0148 - 0x0001)
struct ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_295;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_296;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_297;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_298;                                // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_299;                                // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_300;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_301;                                // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_302;                               // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_303;                              // 0x0030(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_304;                               // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_305;                                // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_306;                                // 0x0061(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_307;                                // 0x0062(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x1];                                       // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_308;                                // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_309;                                // 0x006C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_310;                                 // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_311;                              // 0x0078(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0098(0x0080)()
	struct FAnimSubsystem_BlendSpaceGraph         AnimBlueprintExtension_BlendSpaceGraph;            // 0x0118(0x0018)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0130(0x0018)()
};
static_assert(alignof(ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData) == 0x000148, "Wrong size on ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData, __NameProperty_295) == 0x000004, "Member 'ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData::__NameProperty_295' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData, __NameProperty_296) == 0x00000C, "Member 'ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData::__NameProperty_296' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData, __IntProperty_297) == 0x000014, "Member 'ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData::__IntProperty_297' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData, __EnumProperty_298) == 0x000018, "Member 'ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData::__EnumProperty_298' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData, __NameProperty_299) == 0x00001C, "Member 'ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData::__NameProperty_299' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData, __IntProperty_300) == 0x000024, "Member 'ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData::__IntProperty_300' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData, __BoolProperty_301) == 0x000028, "Member 'ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData::__BoolProperty_301' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData, __FloatProperty_302) == 0x00002C, "Member 'ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData::__FloatProperty_302' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData, __StructProperty_303) == 0x000030, "Member 'ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData::__StructProperty_303' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData, __FloatProperty_304) == 0x00005C, "Member 'ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData::__FloatProperty_304' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData, __BoolProperty_305) == 0x000060, "Member 'ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData::__BoolProperty_305' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData, __EnumProperty_306) == 0x000061, "Member 'ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData::__EnumProperty_306' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData, __ByteProperty_307) == 0x000062, "Member 'ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData::__ByteProperty_307' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData, __NameProperty_308) == 0x000064, "Member 'ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData::__NameProperty_308' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData, __NameProperty_309) == 0x00006C, "Member 'ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData::__NameProperty_309' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData, __IntProperty_310) == 0x000074, "Member 'ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData::__IntProperty_310' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData, __StructProperty_311) == 0x000078, "Member 'ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData::__StructProperty_311' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000098, "Member 'ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_BlendSpaceGraph) == 0x000118, "Member 'ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_BlendSpaceGraph' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000130, "Member 'ABP_Shamble_Common::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

