#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Shamble_Uncommon

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Shamble_Uncommon.ABP_Shamble_Uncommon_C.AnimBlueprintGeneratedConstantData
// 0x014F (0x0150 - 0x0001)
struct ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_258;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_259;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_260;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_261;                               // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_262;                                // 0x001C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_263;                                // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_264;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_265;                                // 0x002C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_266;                               // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_267;                              // 0x0034(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_268;                               // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_269;                                // 0x0064(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_270;                                // 0x0065(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_271;                                // 0x0066(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67[0x1];                                       // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_272;                                // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_273;                                // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_274;                                 // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_275;                              // 0x0080(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00A0(0x0080)()
	struct FAnimSubsystem_BlendSpaceGraph         AnimBlueprintExtension_BlendSpaceGraph;            // 0x0120(0x0018)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0138(0x0018)()
};
static_assert(alignof(ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData) == 0x000150, "Wrong size on ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData, __NameProperty_258) == 0x000004, "Member 'ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData::__NameProperty_258' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData, __NameProperty_259) == 0x00000C, "Member 'ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData::__NameProperty_259' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData, __IntProperty_260) == 0x000014, "Member 'ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData::__IntProperty_260' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData, __FloatProperty_261) == 0x000018, "Member 'ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData::__FloatProperty_261' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData, __EnumProperty_262) == 0x00001C, "Member 'ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData::__EnumProperty_262' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData, __NameProperty_263) == 0x000020, "Member 'ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData::__NameProperty_263' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData, __IntProperty_264) == 0x000028, "Member 'ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData::__IntProperty_264' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData, __BoolProperty_265) == 0x00002C, "Member 'ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData::__BoolProperty_265' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData, __FloatProperty_266) == 0x000030, "Member 'ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData::__FloatProperty_266' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData, __StructProperty_267) == 0x000034, "Member 'ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData::__StructProperty_267' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData, __FloatProperty_268) == 0x000060, "Member 'ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData::__FloatProperty_268' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData, __BoolProperty_269) == 0x000064, "Member 'ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData::__BoolProperty_269' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData, __EnumProperty_270) == 0x000065, "Member 'ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData::__EnumProperty_270' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData, __ByteProperty_271) == 0x000066, "Member 'ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData::__ByteProperty_271' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData, __NameProperty_272) == 0x000068, "Member 'ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData::__NameProperty_272' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData, __NameProperty_273) == 0x000070, "Member 'ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData::__NameProperty_273' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData, __IntProperty_274) == 0x000078, "Member 'ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData::__IntProperty_274' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData, __StructProperty_275) == 0x000080, "Member 'ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData::__StructProperty_275' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000A0, "Member 'ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_BlendSpaceGraph) == 0x000120, "Member 'ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_BlendSpaceGraph' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000138, "Member 'ABP_Shamble_Uncommon::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

