#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_LowPolyAvatar

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "E_InventoryItem_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK::Params
{

// Function ABP_LowPolyAvatar.ABP_LowPolyAvatar_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_LowPolyAvatar_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_LowPolyAvatar_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_LowPolyAvatar_C_AnimGraph");
static_assert(sizeof(ABP_LowPolyAvatar_C_AnimGraph) == 0x000010, "Wrong size on ABP_LowPolyAvatar_C_AnimGraph");
static_assert(offsetof(ABP_LowPolyAvatar_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_LowPolyAvatar_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_LowPolyAvatar.ABP_LowPolyAvatar_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_LowPolyAvatar_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_LowPolyAvatar_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_LowPolyAvatar_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_LowPolyAvatar_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_LowPolyAvatar_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_LowPolyAvatar_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_LowPolyAvatar_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_LowPolyAvatar.ABP_LowPolyAvatar_C.ExecuteUbergraph_ABP_LowPolyAvatar
// 0x03D8 (0x03D8 - 0x0000)
struct ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetItemAnim_HasAnim;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_GetItemAnim_Anim;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerCharacter_C*                K2Node_DynamicCast_AsBP_UPPlayer_Character;        // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CalculateDirection_ReturnValue;           // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Survivor_Exterior_C*                K2Node_DynamicCast_AsBP_Survivor_Exterior;         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Infected_C*                         K2Node_DynamicCast_AsBP_Infected;                  // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Military_C*                         K2Node_DynamicCast_AsBP_Military;                  // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCrouching_ReturnValue;                  // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue_1; // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                K2Node_CustomEvent_Player;                         // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Survivor_Exterior_C*                K2Node_CustomEvent_Survivor;                       // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInSelfieMode_Result;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Survivor_Interior_C*                K2Node_DynamicCast_AsBP_Survivor_Interior;         // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10B[0x5];                                      // 0x010B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0130(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Infected_C*                         K2Node_CustomEvent_Infected;                       // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Military_C*                         K2Node_CustomEvent_Military;                       // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_1;            // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_2;            // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x01E0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              CallFunc_GetSurfaceType_ReturnValue;               // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x02CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Time;                      // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0308(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0320(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0348(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0370(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0388(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             CallFunc_GetFootstepSound_Sound;                   // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x3];                                      // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_3;          // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x03B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_4;          // 0x03B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_5;          // 0x03B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Set_Item_ImplicitCast;              // 0x03C0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar) == 0x000008, "Wrong alignment on ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar");
static_assert(sizeof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar) == 0x0003D8, "Wrong size on ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, EntryPoint) == 0x000000, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue) == 0x000004, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000008, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_GetItemAnim_HasAnim) == 0x000009, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_GetItemAnim_HasAnim' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_GetItemAnim_Anim) == 0x000010, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_GetItemAnim_Anim' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000018, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000021, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_Not_PreBool_ReturnValue_1) == 0x000022, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000023, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_Not_PreBool_ReturnValue_2) == 0x000024, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000025, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_BooleanAND_ReturnValue) == 0x000026, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_BooleanAND_ReturnValue_1) == 0x000027, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_Not_PreBool_ReturnValue_3) == 0x000028, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000030, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_BooleanAND_ReturnValue_2) == 0x000048, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, K2Node_Event_DeltaTimeX) == 0x00004C, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000050, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000058, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_GetVelocity_ReturnValue) == 0x000070, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, K2Node_DynamicCast_AsBP_UPPlayer_Character) == 0x000088, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::K2Node_DynamicCast_AsBP_UPPlayer_Character' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_CalculateDirection_ReturnValue) == 0x000094, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_CalculateDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_VSize_ReturnValue) == 0x000098, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, K2Node_DynamicCast_AsBP_Survivor_Exterior) == 0x0000A0, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::K2Node_DynamicCast_AsBP_Survivor_Exterior' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, K2Node_DynamicCast_AsBP_Infected) == 0x0000B0, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::K2Node_DynamicCast_AsBP_Infected' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, K2Node_DynamicCast_bSuccess_2) == 0x0000B8, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, K2Node_DynamicCast_AsBP_Military) == 0x0000C0, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::K2Node_DynamicCast_AsBP_Military' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, K2Node_DynamicCast_bSuccess_3) == 0x0000C8, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_IsValid_ReturnValue) == 0x0000C9, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_GetMovementComponent_ReturnValue) == 0x0000D0, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_IsFalling_ReturnValue) == 0x0000D8, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_IsCrouching_ReturnValue) == 0x0000D9, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_IsCrouching_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue_1) == 0x0000DC, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x0000E0, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, K2Node_CustomEvent_Player) == 0x0000E8, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::K2Node_CustomEvent_Player' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, K2Node_CustomEvent_Survivor) == 0x0000F0, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::K2Node_CustomEvent_Survivor' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_IsInSelfieMode_Result) == 0x0000F8, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_IsInSelfieMode_Result' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, K2Node_DynamicCast_AsBP_Survivor_Interior) == 0x000100, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::K2Node_DynamicCast_AsBP_Survivor_Interior' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, K2Node_DynamicCast_bSuccess_4) == 0x000108, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_IsValid_ReturnValue_1) == 0x000109, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_IsValid_ReturnValue_2) == 0x00010A, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000110, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_IsValid_ReturnValue_3) == 0x000128, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_Not_PreBool_ReturnValue_4) == 0x000129, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_IsValid_ReturnValue_4) == 0x00012A, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_BooleanOR_ReturnValue) == 0x00012B, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, Temp_object_Variable) == 0x000130, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_Not_PreBool_ReturnValue_5) == 0x000140, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000141, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_BooleanAND_ReturnValue_3) == 0x000142, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000143, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000144, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, K2Node_CustomEvent_Infected) == 0x000148, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::K2Node_CustomEvent_Infected' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000150, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000151, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, K2Node_CustomEvent_Military) == 0x000158, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::K2Node_CustomEvent_Military' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_NotEqual_ByteByte_ReturnValue_2) == 0x000160, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_NotEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_TryGetPawnOwner_ReturnValue_1) == 0x000168, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_TryGetPawnOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000170, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000188, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_TryGetPawnOwner_ReturnValue_2) == 0x000190, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_TryGetPawnOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_BooleanOR_ReturnValue_1) == 0x000198, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001A0, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_BooleanOR_ReturnValue_2) == 0x0001B8, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001C0, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_BooleanOR_ReturnValue_3) == 0x0001D8, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_SphereTraceSingle_OutHit) == 0x0001E0, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_SphereTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_SphereTraceSingle_ReturnValue) == 0x0002C8, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_SphereTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_GetSurfaceType_ReturnValue) == 0x0002C9, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_GetSurfaceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_BreakHitResult_bBlockingHit) == 0x0002CA, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_BreakHitResult_bInitialOverlap) == 0x0002CB, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_BreakHitResult_Time) == 0x0002CC, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_BreakHitResult_Distance) == 0x0002D0, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_BreakHitResult_Location) == 0x0002D8, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_BreakHitResult_ImpactPoint) == 0x0002F0, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_BreakHitResult_Normal) == 0x000308, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_BreakHitResult_ImpactNormal) == 0x000320, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_BreakHitResult_PhysMat) == 0x000338, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_BreakHitResult_HitActor) == 0x000340, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_BreakHitResult_HitComponent) == 0x000348, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_BreakHitResult_HitBoneName) == 0x000350, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_BreakHitResult_BoneName) == 0x000358, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_BreakHitResult_HitItem) == 0x000360, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_BreakHitResult_ElementIndex) == 0x000364, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_BreakHitResult_FaceIndex) == 0x000368, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_BreakHitResult_TraceStart) == 0x000370, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_BreakHitResult_TraceEnd) == 0x000388, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_GetFootstepSound_Sound) == 0x0003A0, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_GetFootstepSound_Sound' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_IsValid_ReturnValue_5) == 0x0003A8, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_GetFloatValue_ReturnValue) == 0x0003AC, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_NotEqual_ByteByte_ReturnValue_3) == 0x0003B0, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_NotEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x0003B1, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_NotEqual_ByteByte_ReturnValue_4) == 0x0003B2, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_NotEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_NotEqual_ByteByte_ReturnValue_5) == 0x0003B3, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_NotEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x0003B8, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_Array_Set_Item_ImplicitCast) == 0x0003C0, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_Array_Set_Item_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_Less_DoubleDouble_A_ImplicitCast_1) == 0x0003C8, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_Less_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x0003D0, "Member 'ABP_LowPolyAvatar_C_ExecuteUbergraph_ABP_LowPolyAvatar::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");

// Function ABP_LowPolyAvatar.ABP_LowPolyAvatar_C.GetFootstepSound
// 0x0020 (0x0020 - 0x0000)
struct ABP_LowPolyAvatar_C_GetFootstepSound final
{
public:
	EPhysicalSurface                              Selection;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Sound_0;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             CallFunc_Map_Find_Value;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_LowPolyAvatar_C_GetFootstepSound) == 0x000008, "Wrong alignment on ABP_LowPolyAvatar_C_GetFootstepSound");
static_assert(sizeof(ABP_LowPolyAvatar_C_GetFootstepSound) == 0x000020, "Wrong size on ABP_LowPolyAvatar_C_GetFootstepSound");
static_assert(offsetof(ABP_LowPolyAvatar_C_GetFootstepSound, Selection) == 0x000000, "Member 'ABP_LowPolyAvatar_C_GetFootstepSound::Selection' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_GetFootstepSound, Sound_0) == 0x000008, "Member 'ABP_LowPolyAvatar_C_GetFootstepSound::Sound_0' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_GetFootstepSound, CallFunc_Map_Find_Value) == 0x000010, "Member 'ABP_LowPolyAvatar_C_GetFootstepSound::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_GetFootstepSound, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'ABP_LowPolyAvatar_C_GetFootstepSound::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function ABP_LowPolyAvatar.ABP_LowPolyAvatar_C.GetItemAnim
// 0x0018 (0x0018 - 0x0000)
struct ABP_LowPolyAvatar_C_GetItemAnim final
{
public:
	bool                                          HasAnim;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Anim;                                              // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_LowPolyAvatar_C_GetItemAnim) == 0x000008, "Wrong alignment on ABP_LowPolyAvatar_C_GetItemAnim");
static_assert(sizeof(ABP_LowPolyAvatar_C_GetItemAnim) == 0x000018, "Wrong size on ABP_LowPolyAvatar_C_GetItemAnim");
static_assert(offsetof(ABP_LowPolyAvatar_C_GetItemAnim, HasAnim) == 0x000000, "Member 'ABP_LowPolyAvatar_C_GetItemAnim::HasAnim' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_GetItemAnim, Anim) == 0x000008, "Member 'ABP_LowPolyAvatar_C_GetItemAnim::Anim' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_GetItemAnim, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'ABP_LowPolyAvatar_C_GetItemAnim::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function ABP_LowPolyAvatar.ABP_LowPolyAvatar_C.IsCameroid
// 0x0003 (0x0003 - 0x0000)
struct ABP_LowPolyAvatar_C_IsCameroid final
{
public:
	E_InventoryItem                               Item;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_LowPolyAvatar_C_IsCameroid) == 0x000001, "Wrong alignment on ABP_LowPolyAvatar_C_IsCameroid");
static_assert(sizeof(ABP_LowPolyAvatar_C_IsCameroid) == 0x000003, "Wrong size on ABP_LowPolyAvatar_C_IsCameroid");
static_assert(offsetof(ABP_LowPolyAvatar_C_IsCameroid, Item) == 0x000000, "Member 'ABP_LowPolyAvatar_C_IsCameroid::Item' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_IsCameroid, Result) == 0x000001, "Member 'ABP_LowPolyAvatar_C_IsCameroid::Result' has a wrong offset!");
static_assert(offsetof(ABP_LowPolyAvatar_C_IsCameroid, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'ABP_LowPolyAvatar_C_IsCameroid::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function ABP_LowPolyAvatar.ABP_LowPolyAvatar_C.UpdateInfected
// 0x0008 (0x0008 - 0x0000)
struct ABP_LowPolyAvatar_C_UpdateInfected final
{
public:
	class ABP_Infected_C*                         Infected;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_LowPolyAvatar_C_UpdateInfected) == 0x000008, "Wrong alignment on ABP_LowPolyAvatar_C_UpdateInfected");
static_assert(sizeof(ABP_LowPolyAvatar_C_UpdateInfected) == 0x000008, "Wrong size on ABP_LowPolyAvatar_C_UpdateInfected");
static_assert(offsetof(ABP_LowPolyAvatar_C_UpdateInfected, Infected) == 0x000000, "Member 'ABP_LowPolyAvatar_C_UpdateInfected::Infected' has a wrong offset!");

// Function ABP_LowPolyAvatar.ABP_LowPolyAvatar_C.UpdateMilitary
// 0x0008 (0x0008 - 0x0000)
struct ABP_LowPolyAvatar_C_UpdateMilitary final
{
public:
	class ABP_Military_C*                         Military;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_LowPolyAvatar_C_UpdateMilitary) == 0x000008, "Wrong alignment on ABP_LowPolyAvatar_C_UpdateMilitary");
static_assert(sizeof(ABP_LowPolyAvatar_C_UpdateMilitary) == 0x000008, "Wrong size on ABP_LowPolyAvatar_C_UpdateMilitary");
static_assert(offsetof(ABP_LowPolyAvatar_C_UpdateMilitary, Military) == 0x000000, "Member 'ABP_LowPolyAvatar_C_UpdateMilitary::Military' has a wrong offset!");

// Function ABP_LowPolyAvatar.ABP_LowPolyAvatar_C.UpdatePlayerAnim
// 0x0008 (0x0008 - 0x0000)
struct ABP_LowPolyAvatar_C_UpdatePlayerAnim final
{
public:
	class ABP_UPPlayerCharacter_C*                Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_LowPolyAvatar_C_UpdatePlayerAnim) == 0x000008, "Wrong alignment on ABP_LowPolyAvatar_C_UpdatePlayerAnim");
static_assert(sizeof(ABP_LowPolyAvatar_C_UpdatePlayerAnim) == 0x000008, "Wrong size on ABP_LowPolyAvatar_C_UpdatePlayerAnim");
static_assert(offsetof(ABP_LowPolyAvatar_C_UpdatePlayerAnim, Player) == 0x000000, "Member 'ABP_LowPolyAvatar_C_UpdatePlayerAnim::Player' has a wrong offset!");

// Function ABP_LowPolyAvatar.ABP_LowPolyAvatar_C.UpdateSurvivorAnim
// 0x0008 (0x0008 - 0x0000)
struct ABP_LowPolyAvatar_C_UpdateSurvivorAnim final
{
public:
	class ABP_Survivor_Exterior_C*                Survivor;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_LowPolyAvatar_C_UpdateSurvivorAnim) == 0x000008, "Wrong alignment on ABP_LowPolyAvatar_C_UpdateSurvivorAnim");
static_assert(sizeof(ABP_LowPolyAvatar_C_UpdateSurvivorAnim) == 0x000008, "Wrong size on ABP_LowPolyAvatar_C_UpdateSurvivorAnim");
static_assert(offsetof(ABP_LowPolyAvatar_C_UpdateSurvivorAnim, Survivor) == 0x000000, "Member 'ABP_LowPolyAvatar_C_UpdateSurvivorAnim::Survivor' has a wrong offset!");

}

