#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Pulpo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Pulpo.ABP_Pulpo_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Pulpo_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Pulpo_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Pulpo_C_AnimGraph");
static_assert(sizeof(ABP_Pulpo_C_AnimGraph) == 0x000010, "Wrong size on ABP_Pulpo_C_AnimGraph");
static_assert(offsetof(ABP_Pulpo_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Pulpo_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Pulpo.ABP_Pulpo_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Pulpo_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Pulpo_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Pulpo_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Pulpo_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Pulpo_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Pulpo_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Pulpo_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Pulpo.ABP_Pulpo_C.ExecuteUbergraph_ABP_Pulpo
// 0x0048 (0x0048 - 0x0000)
struct ABP_Pulpo_C_ExecuteUbergraph_ABP_Pulpo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Pulpo_C*                            K2Node_DynamicCast_AsBP_Pulpo;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Pulpo_C_ExecuteUbergraph_ABP_Pulpo) == 0x000008, "Wrong alignment on ABP_Pulpo_C_ExecuteUbergraph_ABP_Pulpo");
static_assert(sizeof(ABP_Pulpo_C_ExecuteUbergraph_ABP_Pulpo) == 0x000048, "Wrong size on ABP_Pulpo_C_ExecuteUbergraph_ABP_Pulpo");
static_assert(offsetof(ABP_Pulpo_C_ExecuteUbergraph_ABP_Pulpo, EntryPoint) == 0x000000, "Member 'ABP_Pulpo_C_ExecuteUbergraph_ABP_Pulpo::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Pulpo_C_ExecuteUbergraph_ABP_Pulpo, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'ABP_Pulpo_C_ExecuteUbergraph_ABP_Pulpo::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Pulpo_C_ExecuteUbergraph_ABP_Pulpo, K2Node_DynamicCast_AsBP_Pulpo) == 0x000010, "Member 'ABP_Pulpo_C_ExecuteUbergraph_ABP_Pulpo::K2Node_DynamicCast_AsBP_Pulpo' has a wrong offset!");
static_assert(offsetof(ABP_Pulpo_C_ExecuteUbergraph_ABP_Pulpo, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ABP_Pulpo_C_ExecuteUbergraph_ABP_Pulpo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Pulpo_C_ExecuteUbergraph_ABP_Pulpo, K2Node_Event_DeltaTimeX) == 0x00001C, "Member 'ABP_Pulpo_C_ExecuteUbergraph_ABP_Pulpo::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_Pulpo_C_ExecuteUbergraph_ABP_Pulpo, CallFunc_GetVelocity_ReturnValue) == 0x000020, "Member 'ABP_Pulpo_C_ExecuteUbergraph_ABP_Pulpo::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Pulpo_C_ExecuteUbergraph_ABP_Pulpo, CallFunc_VSize_ReturnValue) == 0x000038, "Member 'ABP_Pulpo_C_ExecuteUbergraph_ABP_Pulpo::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Pulpo_C_ExecuteUbergraph_ABP_Pulpo, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'ABP_Pulpo_C_ExecuteUbergraph_ABP_Pulpo::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

