#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Batogon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Batogon.ABP_Batogon_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Batogon_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Batogon_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Batogon_C_AnimGraph");
static_assert(sizeof(ABP_Batogon_C_AnimGraph) == 0x000010, "Wrong size on ABP_Batogon_C_AnimGraph");
static_assert(offsetof(ABP_Batogon_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Batogon_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Batogon.ABP_Batogon_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Batogon_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Batogon_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Batogon_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Batogon_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Batogon_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Batogon_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Batogon_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Batogon.ABP_Batogon_C.ExecuteUbergraph_ABP_Batogon
// 0x00E8 (0x00E8 - 0x0000)
struct ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Batogon_C*                          K2Node_DynamicCast_AsBP_Batogon;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue; // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Vector_Up_ReturnValue;                    // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue_1; // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon) == 0x000008, "Wrong alignment on ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon");
static_assert(sizeof(ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon) == 0x0000E8, "Wrong size on ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon");
static_assert(offsetof(ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon, EntryPoint) == 0x000000, "Member 'ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon, K2Node_DynamicCast_AsBP_Batogon) == 0x000010, "Member 'ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon::K2Node_DynamicCast_AsBP_Batogon' has a wrong offset!");
static_assert(offsetof(ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon, CallFunc_GetActorForwardVector_ReturnValue) == 0x000020, "Member 'ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon, CallFunc_BreakVector_X) == 0x000038, "Member 'ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon, CallFunc_BreakVector_Y) == 0x000040, "Member 'ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon, CallFunc_BreakVector_Z) == 0x000048, "Member 'ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon, CallFunc_MakeVector_ReturnValue) == 0x000050, "Member 'ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon, CallFunc_GetVelocity_ReturnValue) == 0x000068, "Member 'ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon, CallFunc_Normal_ReturnValue) == 0x000080, "Member 'ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon, CallFunc_VSize_ReturnValue) == 0x000098, "Member 'ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon, CallFunc_Dot_VectorVector_ReturnValue) == 0x0000A0, "Member 'ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon, CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue) == 0x0000A8, "Member 'ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon::CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000AC, "Member 'ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon, CallFunc_Vector_Up_ReturnValue) == 0x0000B0, "Member 'ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon::CallFunc_Vector_Up_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon, CallFunc_Dot_VectorVector_ReturnValue_1) == 0x0000C8, "Member 'ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon::CallFunc_Dot_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon, CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue_1) == 0x0000D0, "Member 'ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon::CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x0000D4, "Member 'ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x0000D8, "Member 'ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon, CallFunc_Less_DoubleDouble_A_ImplicitCast_1) == 0x0000E0, "Member 'ABP_Batogon_C_ExecuteUbergraph_ABP_Batogon::CallFunc_Less_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

}

