#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Slender

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Slender.ABP_Slender_C.AnimBlueprintGeneratedConstantData
// 0x012F (0x0130 - 0x0001)
struct ABP_Slender::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_85;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_86;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_87;                                  // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_88;                               // 0x0018(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_89;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_90;                                 // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_91;                                  // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_92;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_93;                                 // 0x0058(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_94;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_95;                                 // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_96;                                 // 0x0061(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_97;                                 // 0x0062(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x1];                                       // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_98;                                 // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_99;                                 // 0x006C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_100;                                 // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_101;                              // 0x0078(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0098(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0118(0x0018)()
};
static_assert(alignof(ABP_Slender::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Slender::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Slender::FAnimBlueprintGeneratedConstantData) == 0x000130, "Wrong size on ABP_Slender::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Slender::FAnimBlueprintGeneratedConstantData, __NameProperty_85) == 0x000004, "Member 'ABP_Slender::FAnimBlueprintGeneratedConstantData::__NameProperty_85' has a wrong offset!");
static_assert(offsetof(ABP_Slender::FAnimBlueprintGeneratedConstantData, __NameProperty_86) == 0x00000C, "Member 'ABP_Slender::FAnimBlueprintGeneratedConstantData::__NameProperty_86' has a wrong offset!");
static_assert(offsetof(ABP_Slender::FAnimBlueprintGeneratedConstantData, __IntProperty_87) == 0x000014, "Member 'ABP_Slender::FAnimBlueprintGeneratedConstantData::__IntProperty_87' has a wrong offset!");
static_assert(offsetof(ABP_Slender::FAnimBlueprintGeneratedConstantData, __StructProperty_88) == 0x000018, "Member 'ABP_Slender::FAnimBlueprintGeneratedConstantData::__StructProperty_88' has a wrong offset!");
static_assert(offsetof(ABP_Slender::FAnimBlueprintGeneratedConstantData, __FloatProperty_89) == 0x000044, "Member 'ABP_Slender::FAnimBlueprintGeneratedConstantData::__FloatProperty_89' has a wrong offset!");
static_assert(offsetof(ABP_Slender::FAnimBlueprintGeneratedConstantData, __NameProperty_90) == 0x000048, "Member 'ABP_Slender::FAnimBlueprintGeneratedConstantData::__NameProperty_90' has a wrong offset!");
static_assert(offsetof(ABP_Slender::FAnimBlueprintGeneratedConstantData, __IntProperty_91) == 0x000050, "Member 'ABP_Slender::FAnimBlueprintGeneratedConstantData::__IntProperty_91' has a wrong offset!");
static_assert(offsetof(ABP_Slender::FAnimBlueprintGeneratedConstantData, __FloatProperty_92) == 0x000054, "Member 'ABP_Slender::FAnimBlueprintGeneratedConstantData::__FloatProperty_92' has a wrong offset!");
static_assert(offsetof(ABP_Slender::FAnimBlueprintGeneratedConstantData, __BoolProperty_93) == 0x000058, "Member 'ABP_Slender::FAnimBlueprintGeneratedConstantData::__BoolProperty_93' has a wrong offset!");
static_assert(offsetof(ABP_Slender::FAnimBlueprintGeneratedConstantData, __FloatProperty_94) == 0x00005C, "Member 'ABP_Slender::FAnimBlueprintGeneratedConstantData::__FloatProperty_94' has a wrong offset!");
static_assert(offsetof(ABP_Slender::FAnimBlueprintGeneratedConstantData, __BoolProperty_95) == 0x000060, "Member 'ABP_Slender::FAnimBlueprintGeneratedConstantData::__BoolProperty_95' has a wrong offset!");
static_assert(offsetof(ABP_Slender::FAnimBlueprintGeneratedConstantData, __EnumProperty_96) == 0x000061, "Member 'ABP_Slender::FAnimBlueprintGeneratedConstantData::__EnumProperty_96' has a wrong offset!");
static_assert(offsetof(ABP_Slender::FAnimBlueprintGeneratedConstantData, __ByteProperty_97) == 0x000062, "Member 'ABP_Slender::FAnimBlueprintGeneratedConstantData::__ByteProperty_97' has a wrong offset!");
static_assert(offsetof(ABP_Slender::FAnimBlueprintGeneratedConstantData, __NameProperty_98) == 0x000064, "Member 'ABP_Slender::FAnimBlueprintGeneratedConstantData::__NameProperty_98' has a wrong offset!");
static_assert(offsetof(ABP_Slender::FAnimBlueprintGeneratedConstantData, __NameProperty_99) == 0x00006C, "Member 'ABP_Slender::FAnimBlueprintGeneratedConstantData::__NameProperty_99' has a wrong offset!");
static_assert(offsetof(ABP_Slender::FAnimBlueprintGeneratedConstantData, __IntProperty_100) == 0x000074, "Member 'ABP_Slender::FAnimBlueprintGeneratedConstantData::__IntProperty_100' has a wrong offset!");
static_assert(offsetof(ABP_Slender::FAnimBlueprintGeneratedConstantData, __StructProperty_101) == 0x000078, "Member 'ABP_Slender::FAnimBlueprintGeneratedConstantData::__StructProperty_101' has a wrong offset!");
static_assert(offsetof(ABP_Slender::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000098, "Member 'ABP_Slender::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Slender::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000118, "Member 'ABP_Slender::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_Slender.ABP_Slender_C.AnimBlueprintGeneratedMutableData
// 0x000B (0x000C - 0x0001)
struct ABP_Slender::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Slender::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_Slender::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_Slender::FAnimBlueprintGeneratedMutableData) == 0x00000C, "Wrong size on ABP_Slender::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_Slender::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_Slender::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(ABP_Slender::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'ABP_Slender::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");

}

