#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Batogon

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Batogon.ABP_Batogon_C.AnimBlueprintGeneratedConstantData
// 0x0167 (0x0168 - 0x0001)
struct ABP_Batogon::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_295;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_296;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_297;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_298;                               // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_299;                                // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_300;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_301;                               // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_302;                                // 0x002C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_303;                                 // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_304;                                // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_305;                                 // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_306;                               // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_307;                                // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_308;                               // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_309;                              // 0x0050(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_310;                               // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_311;                                // 0x0080(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_312;                                // 0x0081(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_313;                                // 0x0082(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x1];                                       // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_314;                                // 0x0084(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_315;                                // 0x008C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_316;                                 // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_317;                              // 0x0098(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B8(0x0080)()
	struct FAnimSubsystem_BlendSpaceGraph         AnimBlueprintExtension_BlendSpaceGraph;            // 0x0138(0x0018)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0150(0x0018)()
};
static_assert(alignof(ABP_Batogon::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Batogon::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Batogon::FAnimBlueprintGeneratedConstantData) == 0x000168, "Wrong size on ABP_Batogon::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Batogon::FAnimBlueprintGeneratedConstantData, __NameProperty_295) == 0x000004, "Member 'ABP_Batogon::FAnimBlueprintGeneratedConstantData::__NameProperty_295' has a wrong offset!");
static_assert(offsetof(ABP_Batogon::FAnimBlueprintGeneratedConstantData, __NameProperty_296) == 0x00000C, "Member 'ABP_Batogon::FAnimBlueprintGeneratedConstantData::__NameProperty_296' has a wrong offset!");
static_assert(offsetof(ABP_Batogon::FAnimBlueprintGeneratedConstantData, __IntProperty_297) == 0x000014, "Member 'ABP_Batogon::FAnimBlueprintGeneratedConstantData::__IntProperty_297' has a wrong offset!");
static_assert(offsetof(ABP_Batogon::FAnimBlueprintGeneratedConstantData, __FloatProperty_298) == 0x000018, "Member 'ABP_Batogon::FAnimBlueprintGeneratedConstantData::__FloatProperty_298' has a wrong offset!");
static_assert(offsetof(ABP_Batogon::FAnimBlueprintGeneratedConstantData, __NameProperty_299) == 0x00001C, "Member 'ABP_Batogon::FAnimBlueprintGeneratedConstantData::__NameProperty_299' has a wrong offset!");
static_assert(offsetof(ABP_Batogon::FAnimBlueprintGeneratedConstantData, __IntProperty_300) == 0x000024, "Member 'ABP_Batogon::FAnimBlueprintGeneratedConstantData::__IntProperty_300' has a wrong offset!");
static_assert(offsetof(ABP_Batogon::FAnimBlueprintGeneratedConstantData, __FloatProperty_301) == 0x000028, "Member 'ABP_Batogon::FAnimBlueprintGeneratedConstantData::__FloatProperty_301' has a wrong offset!");
static_assert(offsetof(ABP_Batogon::FAnimBlueprintGeneratedConstantData, __NameProperty_302) == 0x00002C, "Member 'ABP_Batogon::FAnimBlueprintGeneratedConstantData::__NameProperty_302' has a wrong offset!");
static_assert(offsetof(ABP_Batogon::FAnimBlueprintGeneratedConstantData, __IntProperty_303) == 0x000034, "Member 'ABP_Batogon::FAnimBlueprintGeneratedConstantData::__IntProperty_303' has a wrong offset!");
static_assert(offsetof(ABP_Batogon::FAnimBlueprintGeneratedConstantData, __NameProperty_304) == 0x000038, "Member 'ABP_Batogon::FAnimBlueprintGeneratedConstantData::__NameProperty_304' has a wrong offset!");
static_assert(offsetof(ABP_Batogon::FAnimBlueprintGeneratedConstantData, __IntProperty_305) == 0x000040, "Member 'ABP_Batogon::FAnimBlueprintGeneratedConstantData::__IntProperty_305' has a wrong offset!");
static_assert(offsetof(ABP_Batogon::FAnimBlueprintGeneratedConstantData, __FloatProperty_306) == 0x000044, "Member 'ABP_Batogon::FAnimBlueprintGeneratedConstantData::__FloatProperty_306' has a wrong offset!");
static_assert(offsetof(ABP_Batogon::FAnimBlueprintGeneratedConstantData, __BoolProperty_307) == 0x000048, "Member 'ABP_Batogon::FAnimBlueprintGeneratedConstantData::__BoolProperty_307' has a wrong offset!");
static_assert(offsetof(ABP_Batogon::FAnimBlueprintGeneratedConstantData, __FloatProperty_308) == 0x00004C, "Member 'ABP_Batogon::FAnimBlueprintGeneratedConstantData::__FloatProperty_308' has a wrong offset!");
static_assert(offsetof(ABP_Batogon::FAnimBlueprintGeneratedConstantData, __StructProperty_309) == 0x000050, "Member 'ABP_Batogon::FAnimBlueprintGeneratedConstantData::__StructProperty_309' has a wrong offset!");
static_assert(offsetof(ABP_Batogon::FAnimBlueprintGeneratedConstantData, __FloatProperty_310) == 0x00007C, "Member 'ABP_Batogon::FAnimBlueprintGeneratedConstantData::__FloatProperty_310' has a wrong offset!");
static_assert(offsetof(ABP_Batogon::FAnimBlueprintGeneratedConstantData, __BoolProperty_311) == 0x000080, "Member 'ABP_Batogon::FAnimBlueprintGeneratedConstantData::__BoolProperty_311' has a wrong offset!");
static_assert(offsetof(ABP_Batogon::FAnimBlueprintGeneratedConstantData, __EnumProperty_312) == 0x000081, "Member 'ABP_Batogon::FAnimBlueprintGeneratedConstantData::__EnumProperty_312' has a wrong offset!");
static_assert(offsetof(ABP_Batogon::FAnimBlueprintGeneratedConstantData, __ByteProperty_313) == 0x000082, "Member 'ABP_Batogon::FAnimBlueprintGeneratedConstantData::__ByteProperty_313' has a wrong offset!");
static_assert(offsetof(ABP_Batogon::FAnimBlueprintGeneratedConstantData, __NameProperty_314) == 0x000084, "Member 'ABP_Batogon::FAnimBlueprintGeneratedConstantData::__NameProperty_314' has a wrong offset!");
static_assert(offsetof(ABP_Batogon::FAnimBlueprintGeneratedConstantData, __NameProperty_315) == 0x00008C, "Member 'ABP_Batogon::FAnimBlueprintGeneratedConstantData::__NameProperty_315' has a wrong offset!");
static_assert(offsetof(ABP_Batogon::FAnimBlueprintGeneratedConstantData, __IntProperty_316) == 0x000094, "Member 'ABP_Batogon::FAnimBlueprintGeneratedConstantData::__IntProperty_316' has a wrong offset!");
static_assert(offsetof(ABP_Batogon::FAnimBlueprintGeneratedConstantData, __StructProperty_317) == 0x000098, "Member 'ABP_Batogon::FAnimBlueprintGeneratedConstantData::__StructProperty_317' has a wrong offset!");
static_assert(offsetof(ABP_Batogon::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B8, "Member 'ABP_Batogon::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Batogon::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_BlendSpaceGraph) == 0x000138, "Member 'ABP_Batogon::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_BlendSpaceGraph' has a wrong offset!");
static_assert(offsetof(ABP_Batogon::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000150, "Member 'ABP_Batogon::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

