#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Dogalien

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Dogalien.ABP_Dogalien_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Dogalien_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Dogalien_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Dogalien_C_AnimGraph");
static_assert(sizeof(ABP_Dogalien_C_AnimGraph) == 0x000010, "Wrong size on ABP_Dogalien_C_AnimGraph");
static_assert(offsetof(ABP_Dogalien_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Dogalien_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Dogalien.ABP_Dogalien_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Dogalien_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Dogalien_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Dogalien_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Dogalien_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Dogalien_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Dogalien_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Dogalien_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Dogalien.ABP_Dogalien_C.ExecuteUbergraph_ABP_Dogalien
// 0x0068 (0x0068 - 0x0000)
struct ABP_Dogalien_C_ExecuteUbergraph_ABP_Dogalien final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DogAlien_C*                         K2Node_DynamicCast_AsBP_Dog_Alien;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalculateDirection_ReturnValue;           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Dogalien_C_ExecuteUbergraph_ABP_Dogalien) == 0x000008, "Wrong alignment on ABP_Dogalien_C_ExecuteUbergraph_ABP_Dogalien");
static_assert(sizeof(ABP_Dogalien_C_ExecuteUbergraph_ABP_Dogalien) == 0x000068, "Wrong size on ABP_Dogalien_C_ExecuteUbergraph_ABP_Dogalien");
static_assert(offsetof(ABP_Dogalien_C_ExecuteUbergraph_ABP_Dogalien, EntryPoint) == 0x000000, "Member 'ABP_Dogalien_C_ExecuteUbergraph_ABP_Dogalien::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Dogalien_C_ExecuteUbergraph_ABP_Dogalien, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'ABP_Dogalien_C_ExecuteUbergraph_ABP_Dogalien::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Dogalien_C_ExecuteUbergraph_ABP_Dogalien, K2Node_Event_DeltaTimeX) == 0x000010, "Member 'ABP_Dogalien_C_ExecuteUbergraph_ABP_Dogalien::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_Dogalien_C_ExecuteUbergraph_ABP_Dogalien, K2Node_DynamicCast_AsBP_Dog_Alien) == 0x000018, "Member 'ABP_Dogalien_C_ExecuteUbergraph_ABP_Dogalien::K2Node_DynamicCast_AsBP_Dog_Alien' has a wrong offset!");
static_assert(offsetof(ABP_Dogalien_C_ExecuteUbergraph_ABP_Dogalien, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ABP_Dogalien_C_ExecuteUbergraph_ABP_Dogalien::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Dogalien_C_ExecuteUbergraph_ABP_Dogalien, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'ABP_Dogalien_C_ExecuteUbergraph_ABP_Dogalien::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Dogalien_C_ExecuteUbergraph_ABP_Dogalien, CallFunc_IsValid_ReturnValue_1) == 0x000022, "Member 'ABP_Dogalien_C_ExecuteUbergraph_ABP_Dogalien::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Dogalien_C_ExecuteUbergraph_ABP_Dogalien, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000028, "Member 'ABP_Dogalien_C_ExecuteUbergraph_ABP_Dogalien::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Dogalien_C_ExecuteUbergraph_ABP_Dogalien, CallFunc_GetVelocity_ReturnValue) == 0x000040, "Member 'ABP_Dogalien_C_ExecuteUbergraph_ABP_Dogalien::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Dogalien_C_ExecuteUbergraph_ABP_Dogalien, CallFunc_VSize_ReturnValue) == 0x000058, "Member 'ABP_Dogalien_C_ExecuteUbergraph_ABP_Dogalien::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Dogalien_C_ExecuteUbergraph_ABP_Dogalien, CallFunc_CalculateDirection_ReturnValue) == 0x000060, "Member 'ABP_Dogalien_C_ExecuteUbergraph_ABP_Dogalien::CallFunc_CalculateDirection_ReturnValue' has a wrong offset!");

}

