#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Shamble_Common

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Shamble_Common.ABP_Shamble_Common_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Shamble_Common_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Shamble_Common_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Shamble_Common_C_AnimGraph");
static_assert(sizeof(ABP_Shamble_Common_C_AnimGraph) == 0x000010, "Wrong size on ABP_Shamble_Common_C_AnimGraph");
static_assert(offsetof(ABP_Shamble_Common_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Shamble_Common_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Shamble_Common.ABP_Shamble_Common_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Shamble_Common_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Shamble_Common_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Shamble_Common_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Shamble_Common_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Shamble_Common_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Shamble_Common_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Shamble_Common_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Shamble_Common.ABP_Shamble_Common_C.ExecuteUbergraph_ABP_Shamble_Common
// 0x0040 (0x0040 - 0x0000)
struct ABP_Shamble_Common_C_ExecuteUbergraph_ABP_Shamble_Common final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Shamble_C*                          K2Node_DynamicCast_AsBP_Shamble;                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Shamble_Common_C_ExecuteUbergraph_ABP_Shamble_Common) == 0x000008, "Wrong alignment on ABP_Shamble_Common_C_ExecuteUbergraph_ABP_Shamble_Common");
static_assert(sizeof(ABP_Shamble_Common_C_ExecuteUbergraph_ABP_Shamble_Common) == 0x000040, "Wrong size on ABP_Shamble_Common_C_ExecuteUbergraph_ABP_Shamble_Common");
static_assert(offsetof(ABP_Shamble_Common_C_ExecuteUbergraph_ABP_Shamble_Common, EntryPoint) == 0x000000, "Member 'ABP_Shamble_Common_C_ExecuteUbergraph_ABP_Shamble_Common::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Common_C_ExecuteUbergraph_ABP_Shamble_Common, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'ABP_Shamble_Common_C_ExecuteUbergraph_ABP_Shamble_Common::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Common_C_ExecuteUbergraph_ABP_Shamble_Common, CallFunc_GetVelocity_ReturnValue) == 0x000008, "Member 'ABP_Shamble_Common_C_ExecuteUbergraph_ABP_Shamble_Common::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Common_C_ExecuteUbergraph_ABP_Shamble_Common, CallFunc_VSize_ReturnValue) == 0x000020, "Member 'ABP_Shamble_Common_C_ExecuteUbergraph_ABP_Shamble_Common::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Common_C_ExecuteUbergraph_ABP_Shamble_Common, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000028, "Member 'ABP_Shamble_Common_C_ExecuteUbergraph_ABP_Shamble_Common::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Common_C_ExecuteUbergraph_ABP_Shamble_Common, K2Node_DynamicCast_AsBP_Shamble) == 0x000030, "Member 'ABP_Shamble_Common_C_ExecuteUbergraph_ABP_Shamble_Common::K2Node_DynamicCast_AsBP_Shamble' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Common_C_ExecuteUbergraph_ABP_Shamble_Common, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'ABP_Shamble_Common_C_ExecuteUbergraph_ABP_Shamble_Common::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Common_C_ExecuteUbergraph_ABP_Shamble_Common, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'ABP_Shamble_Common_C_ExecuteUbergraph_ABP_Shamble_Common::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Shamble_Common_C_ExecuteUbergraph_ABP_Shamble_Common, CallFunc_IsValid_ReturnValue_1) == 0x00003A, "Member 'ABP_Shamble_Common_C_ExecuteUbergraph_ABP_Shamble_Common::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

