#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AirStrike

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AirStrike.BP_AirStrike_C
// 0x0060 (0x02F8 - 0x0298)
class ABP_AirStrike_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        AlarmSiren;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        StartPoint;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        EndPoint;                                          // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Strike_Progress_6E31669D4EE3D2168303C18CFC77A335; // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_Strike__Direction_6E31669D4EE3D2168303C18CFC77A335; // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_Strike;                                   // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          AlarmEnabled;                                      // 0x02D0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BombHeight;                                        // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinRandomDelta;                                    // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxRandomDelta;                                    // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FirstRoundDone;                                    // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DropBomb(float Progress);
	void ExecuteUbergraph_BP_AirStrike(int32 EntryPoint);
	void GetDirection(struct FVector* Direction);
	void OnRep_AlarmEnabled();
	void ReceiveBeginPlay();
	void StartStrike();
	void Timeline_Strike__Bomb__EventFunc();
	void Timeline_Strike__FinishedFunc();
	void Timeline_Strike__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AirStrike_C">();
	}
	static class ABP_AirStrike_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AirStrike_C>();
	}
};
static_assert(alignof(ABP_AirStrike_C) == 0x000008, "Wrong alignment on ABP_AirStrike_C");
static_assert(sizeof(ABP_AirStrike_C) == 0x0002F8, "Wrong size on ABP_AirStrike_C");
static_assert(offsetof(ABP_AirStrike_C, UberGraphFrame) == 0x000298, "Member 'ABP_AirStrike_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_AirStrike_C, AlarmSiren) == 0x0002A0, "Member 'ABP_AirStrike_C::AlarmSiren' has a wrong offset!");
static_assert(offsetof(ABP_AirStrike_C, StartPoint) == 0x0002A8, "Member 'ABP_AirStrike_C::StartPoint' has a wrong offset!");
static_assert(offsetof(ABP_AirStrike_C, EndPoint) == 0x0002B0, "Member 'ABP_AirStrike_C::EndPoint' has a wrong offset!");
static_assert(offsetof(ABP_AirStrike_C, DefaultSceneRoot) == 0x0002B8, "Member 'ABP_AirStrike_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_AirStrike_C, Timeline_Strike_Progress_6E31669D4EE3D2168303C18CFC77A335) == 0x0002C0, "Member 'ABP_AirStrike_C::Timeline_Strike_Progress_6E31669D4EE3D2168303C18CFC77A335' has a wrong offset!");
static_assert(offsetof(ABP_AirStrike_C, Timeline_Strike__Direction_6E31669D4EE3D2168303C18CFC77A335) == 0x0002C4, "Member 'ABP_AirStrike_C::Timeline_Strike__Direction_6E31669D4EE3D2168303C18CFC77A335' has a wrong offset!");
static_assert(offsetof(ABP_AirStrike_C, Timeline_Strike) == 0x0002C8, "Member 'ABP_AirStrike_C::Timeline_Strike' has a wrong offset!");
static_assert(offsetof(ABP_AirStrike_C, AlarmEnabled) == 0x0002D0, "Member 'ABP_AirStrike_C::AlarmEnabled' has a wrong offset!");
static_assert(offsetof(ABP_AirStrike_C, BombHeight) == 0x0002D8, "Member 'ABP_AirStrike_C::BombHeight' has a wrong offset!");
static_assert(offsetof(ABP_AirStrike_C, MinRandomDelta) == 0x0002E0, "Member 'ABP_AirStrike_C::MinRandomDelta' has a wrong offset!");
static_assert(offsetof(ABP_AirStrike_C, MaxRandomDelta) == 0x0002E8, "Member 'ABP_AirStrike_C::MaxRandomDelta' has a wrong offset!");
static_assert(offsetof(ABP_AirStrike_C, FirstRoundDone) == 0x0002F0, "Member 'ABP_AirStrike_C::FirstRoundDone' has a wrong offset!");

}

