#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AirStrikeExplosion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_BuildingExplosion_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AirStrikeExplosion.BP_AirStrikeExplosion_C
// 0x0018 (0x0398 - 0x0380)
class ABP_AirStrikeExplosion_C final : public ABP_BuildingExplosion_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AirStrikeExplosion_C;            // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   BigDebris;                                         // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Debris;                                            // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AirStrikeExplosion(int32 EntryPoint);
	void OnRep_Exploded();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AirStrikeExplosion_C">();
	}
	static class ABP_AirStrikeExplosion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AirStrikeExplosion_C>();
	}
};
static_assert(alignof(ABP_AirStrikeExplosion_C) == 0x000008, "Wrong alignment on ABP_AirStrikeExplosion_C");
static_assert(sizeof(ABP_AirStrikeExplosion_C) == 0x000398, "Wrong size on ABP_AirStrikeExplosion_C");
static_assert(offsetof(ABP_AirStrikeExplosion_C, UberGraphFrame_BP_AirStrikeExplosion_C) == 0x000380, "Member 'ABP_AirStrikeExplosion_C::UberGraphFrame_BP_AirStrikeExplosion_C' has a wrong offset!");
static_assert(offsetof(ABP_AirStrikeExplosion_C, BigDebris) == 0x000388, "Member 'ABP_AirStrikeExplosion_C::BigDebris' has a wrong offset!");
static_assert(offsetof(ABP_AirStrikeExplosion_C, Debris) == 0x000390, "Member 'ABP_AirStrikeExplosion_C::Debris' has a wrong offset!");

}

