#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AirStrike

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AirStrike.BP_AirStrike_C.DropBomb
// 0x0004 (0x0004 - 0x0000)
struct BP_AirStrike_C_DropBomb final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AirStrike_C_DropBomb) == 0x000004, "Wrong alignment on BP_AirStrike_C_DropBomb");
static_assert(sizeof(BP_AirStrike_C_DropBomb) == 0x000004, "Wrong size on BP_AirStrike_C_DropBomb");
static_assert(offsetof(BP_AirStrike_C_DropBomb, Progress) == 0x000000, "Member 'BP_AirStrike_C_DropBomb::Progress' has a wrong offset!");

// Function BP_AirStrike.BP_AirStrike_C.ExecuteUbergraph_BP_AirStrike
// 0x0130 (0x0130 - 0x0000)
struct BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_Progress;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_AirStrikeRocket_C*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike) == 0x000010, "Wrong alignment on BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike");
static_assert(sizeof(BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike) == 0x000130, "Wrong size on BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike");
static_assert(offsetof(BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike, EntryPoint) == 0x000000, "Member 'BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000020, "Member 'BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000038, "Member 'BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike, K2Node_CustomEvent_Progress) == 0x000050, "Member 'BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike::K2Node_CustomEvent_Progress' has a wrong offset!");
static_assert(offsetof(BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike, CallFunc_VLerp_ReturnValue) == 0x000058, "Member 'BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike, CallFunc_BreakVector_X) == 0x000070, "Member 'BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike, CallFunc_BreakVector_Y) == 0x000078, "Member 'BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike, CallFunc_BreakVector_Z) == 0x000080, "Member 'BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike, CallFunc_RandomFloatInRange_ReturnValue) == 0x000088, "Member 'BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000090, "Member 'BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000098, "Member 'BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike, CallFunc_MakeVector_ReturnValue) == 0x0000A0, "Member 'BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike, CallFunc_MakeTransform_ReturnValue) == 0x0000C0, "Member 'BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000120, "Member 'BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike, CallFunc_FinishSpawningActor_ReturnValue) == 0x000128, "Member 'BP_AirStrike_C_ExecuteUbergraph_BP_AirStrike::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_AirStrike.BP_AirStrike_C.GetDirection
// 0x0078 (0x0078 - 0x0000)
struct BP_AirStrike_C_GetDirection final
{
public:
	struct FVector                                Direction;                                         // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AirStrike_C_GetDirection) == 0x000008, "Wrong alignment on BP_AirStrike_C_GetDirection");
static_assert(sizeof(BP_AirStrike_C_GetDirection) == 0x000078, "Wrong size on BP_AirStrike_C_GetDirection");
static_assert(offsetof(BP_AirStrike_C_GetDirection, Direction) == 0x000000, "Member 'BP_AirStrike_C_GetDirection::Direction' has a wrong offset!");
static_assert(offsetof(BP_AirStrike_C_GetDirection, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000018, "Member 'BP_AirStrike_C_GetDirection::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AirStrike_C_GetDirection, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000030, "Member 'BP_AirStrike_C_GetDirection::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AirStrike_C_GetDirection, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000048, "Member 'BP_AirStrike_C_GetDirection::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AirStrike_C_GetDirection, CallFunc_Normal_ReturnValue) == 0x000060, "Member 'BP_AirStrike_C_GetDirection::CallFunc_Normal_ReturnValue' has a wrong offset!");

// Function BP_AirStrike.BP_AirStrike_C.UserConstructionScript
// 0x0200 (0x0200 - 0x0000)
struct BP_AirStrike_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_GetDirection_Direction;                   // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0030(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_1;     // 0x0118(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_AirStrike_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_AirStrike_C_UserConstructionScript");
static_assert(sizeof(BP_AirStrike_C_UserConstructionScript) == 0x000200, "Wrong size on BP_AirStrike_C_UserConstructionScript");
static_assert(offsetof(BP_AirStrike_C_UserConstructionScript, CallFunc_GetDirection_Direction) == 0x000000, "Member 'BP_AirStrike_C_UserConstructionScript::CallFunc_GetDirection_Direction' has a wrong offset!");
static_assert(offsetof(BP_AirStrike_C_UserConstructionScript, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000018, "Member 'BP_AirStrike_C_UserConstructionScript::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AirStrike_C_UserConstructionScript, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000030, "Member 'BP_AirStrike_C_UserConstructionScript::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_AirStrike_C_UserConstructionScript, CallFunc_K2_SetWorldRotation_SweepHitResult_1) == 0x000118, "Member 'BP_AirStrike_C_UserConstructionScript::CallFunc_K2_SetWorldRotation_SweepHitResult_1' has a wrong offset!");

}

