#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BearTrap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BearTrap.BP_BearTrap_C
// 0x00A8 (0x0340 - 0x0298)
class ABP_BearTrap_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_ScoringComponent_C*                Scoring;                                           // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BloodEffect;                                       // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_PlayersProximity_C*                Players_Proximity;                                 // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          DetectionBox;                                      // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SecondHalf;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FirstHalf;                                         // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   base;                                              // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Damage;                                            // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class UClass*, bool>                     Affinities;                                        // 0x02E8(0x0050)(Edit, BlueprintVisible)
	class USoundCue*                              CloseSound;                                        // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__StringTrap_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void CloseTrap(class ABP_KillableCharacter_C* Killable);
	void CloseTrap__All_(class ABP_KillableCharacter_C* Killable);
	void ExecuteUbergraph_BP_BearTrap(int32 EntryPoint);
	void HasHarmed__All_(TScriptInterface<class IBPI_Killable_C> HarmedActor);
	void HasHarmed__Server_(TScriptInterface<class IBPI_Killable_C> HarmedActor);
	void HasKilled__All_(TScriptInterface<class IBPI_Killable_C> KilledActor);
	void HasKilled__Server_(TScriptInterface<class IBPI_Killable_C> KilledActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BearTrap_C">();
	}
	static class ABP_BearTrap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BearTrap_C>();
	}
};
static_assert(alignof(ABP_BearTrap_C) == 0x000008, "Wrong alignment on ABP_BearTrap_C");
static_assert(sizeof(ABP_BearTrap_C) == 0x000340, "Wrong size on ABP_BearTrap_C");
static_assert(offsetof(ABP_BearTrap_C, UberGraphFrame) == 0x000298, "Member 'ABP_BearTrap_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BearTrap_C, Scoring) == 0x0002A0, "Member 'ABP_BearTrap_C::Scoring' has a wrong offset!");
static_assert(offsetof(ABP_BearTrap_C, BloodEffect) == 0x0002A8, "Member 'ABP_BearTrap_C::BloodEffect' has a wrong offset!");
static_assert(offsetof(ABP_BearTrap_C, Players_Proximity) == 0x0002B0, "Member 'ABP_BearTrap_C::Players_Proximity' has a wrong offset!");
static_assert(offsetof(ABP_BearTrap_C, DetectionBox) == 0x0002B8, "Member 'ABP_BearTrap_C::DetectionBox' has a wrong offset!");
static_assert(offsetof(ABP_BearTrap_C, SecondHalf) == 0x0002C0, "Member 'ABP_BearTrap_C::SecondHalf' has a wrong offset!");
static_assert(offsetof(ABP_BearTrap_C, FirstHalf) == 0x0002C8, "Member 'ABP_BearTrap_C::FirstHalf' has a wrong offset!");
static_assert(offsetof(ABP_BearTrap_C, base) == 0x0002D0, "Member 'ABP_BearTrap_C::base' has a wrong offset!");
static_assert(offsetof(ABP_BearTrap_C, DefaultSceneRoot) == 0x0002D8, "Member 'ABP_BearTrap_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_BearTrap_C, Damage) == 0x0002E0, "Member 'ABP_BearTrap_C::Damage' has a wrong offset!");
static_assert(offsetof(ABP_BearTrap_C, Duration) == 0x0002E4, "Member 'ABP_BearTrap_C::Duration' has a wrong offset!");
static_assert(offsetof(ABP_BearTrap_C, Affinities) == 0x0002E8, "Member 'ABP_BearTrap_C::Affinities' has a wrong offset!");
static_assert(offsetof(ABP_BearTrap_C, CloseSound) == 0x000338, "Member 'ABP_BearTrap_C::CloseSound' has a wrong offset!");

}

