#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BootsRanger

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BootsRanger.BP_BootsRanger_C.ExecuteUbergraph_BP_BootsRanger
// 0x0020 (0x0020 - 0x0000)
struct BP_BootsRanger_C_ExecuteUbergraph_BP_BootsRanger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldUpdateCurrentHealth_Result;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BootsRanger_C_ExecuteUbergraph_BP_BootsRanger) == 0x000004, "Wrong alignment on BP_BootsRanger_C_ExecuteUbergraph_BP_BootsRanger");
static_assert(sizeof(BP_BootsRanger_C_ExecuteUbergraph_BP_BootsRanger) == 0x000020, "Wrong size on BP_BootsRanger_C_ExecuteUbergraph_BP_BootsRanger");
static_assert(offsetof(BP_BootsRanger_C_ExecuteUbergraph_BP_BootsRanger, EntryPoint) == 0x000000, "Member 'BP_BootsRanger_C_ExecuteUbergraph_BP_BootsRanger::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BootsRanger_C_ExecuteUbergraph_BP_BootsRanger, CallFunc_ShouldUpdateCurrentHealth_Result) == 0x000004, "Member 'BP_BootsRanger_C_ExecuteUbergraph_BP_BootsRanger::CallFunc_ShouldUpdateCurrentHealth_Result' has a wrong offset!");
static_assert(offsetof(BP_BootsRanger_C_ExecuteUbergraph_BP_BootsRanger, K2Node_Event_EndPlayReason) == 0x000005, "Member 'BP_BootsRanger_C_ExecuteUbergraph_BP_BootsRanger::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_BootsRanger_C_ExecuteUbergraph_BP_BootsRanger, CallFunc_HasAuthority_ReturnValue) == 0x000006, "Member 'BP_BootsRanger_C_ExecuteUbergraph_BP_BootsRanger::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BootsRanger_C_ExecuteUbergraph_BP_BootsRanger, CallFunc_IsValid_ReturnValue) == 0x000007, "Member 'BP_BootsRanger_C_ExecuteUbergraph_BP_BootsRanger::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BootsRanger_C_ExecuteUbergraph_BP_BootsRanger, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_BootsRanger_C_ExecuteUbergraph_BP_BootsRanger::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BootsRanger_C_ExecuteUbergraph_BP_BootsRanger, CallFunc_Add_IntInt_ReturnValue_1) == 0x00000C, "Member 'BP_BootsRanger_C_ExecuteUbergraph_BP_BootsRanger::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BootsRanger_C_ExecuteUbergraph_BP_BootsRanger, CallFunc_HasAuthority_ReturnValue_1) == 0x000010, "Member 'BP_BootsRanger_C_ExecuteUbergraph_BP_BootsRanger::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BootsRanger_C_ExecuteUbergraph_BP_BootsRanger, CallFunc_Clamp_ReturnValue) == 0x000014, "Member 'BP_BootsRanger_C_ExecuteUbergraph_BP_BootsRanger::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BootsRanger_C_ExecuteUbergraph_BP_BootsRanger, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'BP_BootsRanger_C_ExecuteUbergraph_BP_BootsRanger::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BootsRanger_C_ExecuteUbergraph_BP_BootsRanger, CallFunc_IsValid_ReturnValue_1) == 0x00001C, "Member 'BP_BootsRanger_C_ExecuteUbergraph_BP_BootsRanger::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_BootsRanger.BP_BootsRanger_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_BootsRanger_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BootsRanger_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_BootsRanger_C_ReceiveEndPlay");
static_assert(sizeof(BP_BootsRanger_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_BootsRanger_C_ReceiveEndPlay");
static_assert(offsetof(BP_BootsRanger_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_BootsRanger_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_BootsRanger.BP_BootsRanger_C.ShouldUpdateCurrentHealth
// 0x0020 (0x0020 - 0x0000)
struct BP_BootsRanger_C_ShouldUpdateCurrentHealth final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInResults_InResults;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BootsRanger_C_ShouldUpdateCurrentHealth) == 0x000008, "Wrong alignment on BP_BootsRanger_C_ShouldUpdateCurrentHealth");
static_assert(sizeof(BP_BootsRanger_C_ShouldUpdateCurrentHealth) == 0x000020, "Wrong size on BP_BootsRanger_C_ShouldUpdateCurrentHealth");
static_assert(offsetof(BP_BootsRanger_C_ShouldUpdateCurrentHealth, Result) == 0x000000, "Member 'BP_BootsRanger_C_ShouldUpdateCurrentHealth::Result' has a wrong offset!");
static_assert(offsetof(BP_BootsRanger_C_ShouldUpdateCurrentHealth, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'BP_BootsRanger_C_ShouldUpdateCurrentHealth::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BootsRanger_C_ShouldUpdateCurrentHealth, K2Node_DynamicCast_AsBP_UPGame_Instance) == 0x000010, "Member 'BP_BootsRanger_C_ShouldUpdateCurrentHealth::K2Node_DynamicCast_AsBP_UPGame_Instance' has a wrong offset!");
static_assert(offsetof(BP_BootsRanger_C_ShouldUpdateCurrentHealth, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_BootsRanger_C_ShouldUpdateCurrentHealth::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BootsRanger_C_ShouldUpdateCurrentHealth, CallFunc_IsInResults_InResults) == 0x000019, "Member 'BP_BootsRanger_C_ShouldUpdateCurrentHealth::CallFunc_IsInResults_InResults' has a wrong offset!");
static_assert(offsetof(BP_BootsRanger_C_ShouldUpdateCurrentHealth, CallFunc_BooleanOR_ReturnValue) == 0x00001A, "Member 'BP_BootsRanger_C_ShouldUpdateCurrentHealth::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

