#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BootsSport

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BootsSport.BP_BootsSport_C.ApplySpeedMultiplier
// 0x0008 (0x0008 - 0x0000)
struct BP_BootsSport_C_ApplySpeedMultiplier final
{
public:
	double                                        Multiplier;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BootsSport_C_ApplySpeedMultiplier) == 0x000008, "Wrong alignment on BP_BootsSport_C_ApplySpeedMultiplier");
static_assert(sizeof(BP_BootsSport_C_ApplySpeedMultiplier) == 0x000008, "Wrong size on BP_BootsSport_C_ApplySpeedMultiplier");
static_assert(offsetof(BP_BootsSport_C_ApplySpeedMultiplier, Multiplier) == 0x000000, "Member 'BP_BootsSport_C_ApplySpeedMultiplier::Multiplier' has a wrong offset!");

// Function BP_BootsSport.BP_BootsSport_C.ApplyStaminaMultiplier
// 0x0008 (0x0008 - 0x0000)
struct BP_BootsSport_C_ApplyStaminaMultiplier final
{
public:
	double                                        Multiplier;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BootsSport_C_ApplyStaminaMultiplier) == 0x000008, "Wrong alignment on BP_BootsSport_C_ApplyStaminaMultiplier");
static_assert(sizeof(BP_BootsSport_C_ApplyStaminaMultiplier) == 0x000008, "Wrong size on BP_BootsSport_C_ApplyStaminaMultiplier");
static_assert(offsetof(BP_BootsSport_C_ApplyStaminaMultiplier, Multiplier) == 0x000000, "Member 'BP_BootsSport_C_ApplyStaminaMultiplier::Multiplier' has a wrong offset!");

// Function BP_BootsSport.BP_BootsSport_C.ExecuteUbergraph_BP_BootsSport
// 0x0060 (0x0060 - 0x0000)
struct BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Multiplier_1;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Multiplier;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport) == 0x000008, "Wrong alignment on BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport");
static_assert(sizeof(BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport) == 0x000060, "Wrong size on BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport");
static_assert(offsetof(BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport, EntryPoint) == 0x000000, "Member 'BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport, CallFunc_HasAuthority_ReturnValue) == 0x000011, "Member 'BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport, CallFunc_IsValid_ReturnValue_1) == 0x000012, "Member 'BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport, K2Node_CustomEvent_Multiplier_1) == 0x000018, "Member 'BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport::K2Node_CustomEvent_Multiplier_1' has a wrong offset!");
static_assert(offsetof(BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000028, "Member 'BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000030, "Member 'BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport, K2Node_Event_EndPlayReason) == 0x000038, "Member 'BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport, CallFunc_HasAuthority_ReturnValue_1) == 0x000039, "Member 'BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport, K2Node_CustomEvent_Multiplier) == 0x000048, "Member 'BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport::K2Node_CustomEvent_Multiplier' has a wrong offset!");
static_assert(offsetof(BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000050, "Member 'BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000058, "Member 'BP_BootsSport_C_ExecuteUbergraph_BP_BootsSport::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");

// Function BP_BootsSport.BP_BootsSport_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_BootsSport_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BootsSport_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_BootsSport_C_ReceiveEndPlay");
static_assert(sizeof(BP_BootsSport_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_BootsSport_C_ReceiveEndPlay");
static_assert(offsetof(BP_BootsSport_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_BootsSport_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

