#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Biomass_AlienTentacles

#include "Basic.hpp"

#include "BP_Biomass_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Biomass_AlienTentacles.BP_Biomass_AlienTentacles_C
// 0x0060 (0x0308 - 0x02A8)
class ABP_Biomass_AlienTentacles_C final : public ABP_Biomass_Parent_C
{
public:
	class UDecalComponent*                        Decal1;                                            // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ScoringComponent_C*                Scoring;                                           // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Victim;                                            // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal;                                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Pouch_SM_Organism_02;                           // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BP_Pouch_DefaultSceneRoot;                         // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Organism_06_StaticMeshComponent0;               // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Feeder_2_SM_Organism_013;                       // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BP_Feeder_2_DefaultSceneRoot;                      // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Feeder_01_SM_Organism_013;                      // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BP_Feeder_01_DefaultSceneRoot;                     // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Biomass_AlienTentacles_C">();
	}
	static class ABP_Biomass_AlienTentacles_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Biomass_AlienTentacles_C>();
	}
};
static_assert(alignof(ABP_Biomass_AlienTentacles_C) == 0x000008, "Wrong alignment on ABP_Biomass_AlienTentacles_C");
static_assert(sizeof(ABP_Biomass_AlienTentacles_C) == 0x000308, "Wrong size on ABP_Biomass_AlienTentacles_C");
static_assert(offsetof(ABP_Biomass_AlienTentacles_C, Decal1) == 0x0002A8, "Member 'ABP_Biomass_AlienTentacles_C::Decal1' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienTentacles_C, Scoring) == 0x0002B0, "Member 'ABP_Biomass_AlienTentacles_C::Scoring' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienTentacles_C, Victim) == 0x0002B8, "Member 'ABP_Biomass_AlienTentacles_C::Victim' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienTentacles_C, Decal) == 0x0002C0, "Member 'ABP_Biomass_AlienTentacles_C::Decal' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienTentacles_C, BP_Pouch_SM_Organism_02) == 0x0002C8, "Member 'ABP_Biomass_AlienTentacles_C::BP_Pouch_SM_Organism_02' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienTentacles_C, BP_Pouch_DefaultSceneRoot) == 0x0002D0, "Member 'ABP_Biomass_AlienTentacles_C::BP_Pouch_DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienTentacles_C, SM_Organism_06_StaticMeshComponent0) == 0x0002D8, "Member 'ABP_Biomass_AlienTentacles_C::SM_Organism_06_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienTentacles_C, BP_Feeder_2_SM_Organism_013) == 0x0002E0, "Member 'ABP_Biomass_AlienTentacles_C::BP_Feeder_2_SM_Organism_013' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienTentacles_C, BP_Feeder_2_DefaultSceneRoot) == 0x0002E8, "Member 'ABP_Biomass_AlienTentacles_C::BP_Feeder_2_DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienTentacles_C, BP_Feeder_01_SM_Organism_013) == 0x0002F0, "Member 'ABP_Biomass_AlienTentacles_C::BP_Feeder_01_SM_Organism_013' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienTentacles_C, BP_Feeder_01_DefaultSceneRoot) == 0x0002F8, "Member 'ABP_Biomass_AlienTentacles_C::BP_Feeder_01_DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienTentacles_C, SharedRoot) == 0x000300, "Member 'ABP_Biomass_AlienTentacles_C::SharedRoot' has a wrong offset!");

}

