#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BodyItem

#include "Basic.hpp"

#include "BP_InventoryItem_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BodyItem.BP_BodyItem_C
// 0x0030 (0x03A0 - 0x0370)
class ABP_BodyItem_C final : public ABP_InventoryItem_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_BodyItem_C;                      // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPhysicsConstraintComponent*            GrabbedBodyPhysicsConstraint;                      // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GrabbedBodyAnchor;                                 // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_KillableCharacter_C*                Body;                                              // 0x0388(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, RepNotify, NoDestructor, HasGetValueTypeHash)
	float                                         ThrowImpulse;                                      // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsThrow;                                           // 0x0394(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_395[0x3];                                      // 0x0395(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundCue*                              TrowSound;                                         // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BodyItem(int32 EntryPoint);
	struct FVector GetThrowImpulseVector();
	struct FVector GetThrowOriginLocation();
	void OnRep_Body();
	void OnRep_IsInUse();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void TeleportMeshToLocation(class USkinnedMeshComponent* Mesh, class FName BoneName, const struct FVector& Location);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BodyItem_C">();
	}
	static class ABP_BodyItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BodyItem_C>();
	}
};
static_assert(alignof(ABP_BodyItem_C) == 0x000008, "Wrong alignment on ABP_BodyItem_C");
static_assert(sizeof(ABP_BodyItem_C) == 0x0003A0, "Wrong size on ABP_BodyItem_C");
static_assert(offsetof(ABP_BodyItem_C, UberGraphFrame_BP_BodyItem_C) == 0x000370, "Member 'ABP_BodyItem_C::UberGraphFrame_BP_BodyItem_C' has a wrong offset!");
static_assert(offsetof(ABP_BodyItem_C, GrabbedBodyPhysicsConstraint) == 0x000378, "Member 'ABP_BodyItem_C::GrabbedBodyPhysicsConstraint' has a wrong offset!");
static_assert(offsetof(ABP_BodyItem_C, GrabbedBodyAnchor) == 0x000380, "Member 'ABP_BodyItem_C::GrabbedBodyAnchor' has a wrong offset!");
static_assert(offsetof(ABP_BodyItem_C, Body) == 0x000388, "Member 'ABP_BodyItem_C::Body' has a wrong offset!");
static_assert(offsetof(ABP_BodyItem_C, ThrowImpulse) == 0x000390, "Member 'ABP_BodyItem_C::ThrowImpulse' has a wrong offset!");
static_assert(offsetof(ABP_BodyItem_C, IsThrow) == 0x000394, "Member 'ABP_BodyItem_C::IsThrow' has a wrong offset!");
static_assert(offsetof(ABP_BodyItem_C, TrowSound) == 0x000398, "Member 'ABP_BodyItem_C::TrowSound' has a wrong offset!");

}

