#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BootsSport

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Boots_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BootsSport.BP_BootsSport_C
// 0x0018 (0x03E0 - 0x03C8)
class ABP_BootsSport_C final : public ABP_Boots_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_BootsSport_C;                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        SpeedMultiplier;                                   // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StaminaMultiplier;                                 // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddBonus();
	void ApplySpeedMultiplier(double Multiplier);
	void ApplyStaminaMultiplier(double Multiplier);
	void ExecuteUbergraph_BP_BootsSport(int32 EntryPoint);
	void OnRep_Player();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void RemoveBonus();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BootsSport_C">();
	}
	static class ABP_BootsSport_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BootsSport_C>();
	}
};
static_assert(alignof(ABP_BootsSport_C) == 0x000008, "Wrong alignment on ABP_BootsSport_C");
static_assert(sizeof(ABP_BootsSport_C) == 0x0003E0, "Wrong size on ABP_BootsSport_C");
static_assert(offsetof(ABP_BootsSport_C, UberGraphFrame_BP_BootsSport_C) == 0x0003C8, "Member 'ABP_BootsSport_C::UberGraphFrame_BP_BootsSport_C' has a wrong offset!");
static_assert(offsetof(ABP_BootsSport_C, SpeedMultiplier) == 0x0003D0, "Member 'ABP_BootsSport_C::SpeedMultiplier' has a wrong offset!");
static_assert(offsetof(ABP_BootsSport_C, StaminaMultiplier) == 0x0003D8, "Member 'ABP_BootsSport_C::StaminaMultiplier' has a wrong offset!");

}

