#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Biomass_AlienNest

#include "Basic.hpp"

#include "BP_Biomass_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Biomass_AlienNest.BP_Biomass_AlienNest_C
// 0x0090 (0x0338 - 0x02A8)
class ABP_Biomass_AlienNest_C final : public ABP_Biomass_Parent_C
{
public:
	class UBPC_ScoringComponent_C*                Scoring;                                           // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_StaticMesh10;                              // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_StaticMesh9;                               // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_StaticMesh8;                               // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_StaticMesh7;                               // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_StaticMesh6;                               // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_SM_Organism_07;                            // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_StaticMesh5;                               // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_StaticMesh4;                               // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_StaticMesh3;                               // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_StaticMesh2;                               // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_StaticMesh1;                               // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_StaticMesh;                                // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_SM_Organism_015;                           // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_SM_Organism_08;                            // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BP_Nest_DefaultSceneRoot;                          // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Organism_06_StaticMeshComponent0;               // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Biomass_AlienNest_C">();
	}
	static class ABP_Biomass_AlienNest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Biomass_AlienNest_C>();
	}
};
static_assert(alignof(ABP_Biomass_AlienNest_C) == 0x000008, "Wrong alignment on ABP_Biomass_AlienNest_C");
static_assert(sizeof(ABP_Biomass_AlienNest_C) == 0x000338, "Wrong size on ABP_Biomass_AlienNest_C");
static_assert(offsetof(ABP_Biomass_AlienNest_C, Scoring) == 0x0002A8, "Member 'ABP_Biomass_AlienNest_C::Scoring' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienNest_C, BP_Nest_StaticMesh10) == 0x0002B0, "Member 'ABP_Biomass_AlienNest_C::BP_Nest_StaticMesh10' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienNest_C, BP_Nest_StaticMesh9) == 0x0002B8, "Member 'ABP_Biomass_AlienNest_C::BP_Nest_StaticMesh9' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienNest_C, BP_Nest_StaticMesh8) == 0x0002C0, "Member 'ABP_Biomass_AlienNest_C::BP_Nest_StaticMesh8' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienNest_C, BP_Nest_StaticMesh7) == 0x0002C8, "Member 'ABP_Biomass_AlienNest_C::BP_Nest_StaticMesh7' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienNest_C, BP_Nest_StaticMesh6) == 0x0002D0, "Member 'ABP_Biomass_AlienNest_C::BP_Nest_StaticMesh6' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienNest_C, BP_Nest_SM_Organism_07) == 0x0002D8, "Member 'ABP_Biomass_AlienNest_C::BP_Nest_SM_Organism_07' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienNest_C, BP_Nest_StaticMesh5) == 0x0002E0, "Member 'ABP_Biomass_AlienNest_C::BP_Nest_StaticMesh5' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienNest_C, BP_Nest_StaticMesh4) == 0x0002E8, "Member 'ABP_Biomass_AlienNest_C::BP_Nest_StaticMesh4' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienNest_C, BP_Nest_StaticMesh3) == 0x0002F0, "Member 'ABP_Biomass_AlienNest_C::BP_Nest_StaticMesh3' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienNest_C, BP_Nest_StaticMesh2) == 0x0002F8, "Member 'ABP_Biomass_AlienNest_C::BP_Nest_StaticMesh2' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienNest_C, BP_Nest_StaticMesh1) == 0x000300, "Member 'ABP_Biomass_AlienNest_C::BP_Nest_StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienNest_C, BP_Nest_StaticMesh) == 0x000308, "Member 'ABP_Biomass_AlienNest_C::BP_Nest_StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienNest_C, BP_Nest_SM_Organism_015) == 0x000310, "Member 'ABP_Biomass_AlienNest_C::BP_Nest_SM_Organism_015' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienNest_C, BP_Nest_SM_Organism_08) == 0x000318, "Member 'ABP_Biomass_AlienNest_C::BP_Nest_SM_Organism_08' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienNest_C, BP_Nest_DefaultSceneRoot) == 0x000320, "Member 'ABP_Biomass_AlienNest_C::BP_Nest_DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienNest_C, SM_Organism_06_StaticMeshComponent0) == 0x000328, "Member 'ABP_Biomass_AlienNest_C::SM_Organism_06_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienNest_C, SharedRoot) == 0x000330, "Member 'ABP_Biomass_AlienNest_C::SharedRoot' has a wrong offset!");

}

