#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BearTrapItem

#include "Basic.hpp"

#include "BP_InventoryItem_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BearTrapItem.BP_BearTrapItem_C
// 0x0018 (0x0388 - 0x0370)
class ABP_BearTrapItem_C final : public ABP_InventoryItem_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_BearTrapItem_C;                  // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SecondHalf;                                        // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FirstHalf;                                         // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BearTrapItem(int32 EntryPoint);
	void OnRep_IsInUse();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BearTrapItem_C">();
	}
	static class ABP_BearTrapItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BearTrapItem_C>();
	}
};
static_assert(alignof(ABP_BearTrapItem_C) == 0x000008, "Wrong alignment on ABP_BearTrapItem_C");
static_assert(sizeof(ABP_BearTrapItem_C) == 0x000388, "Wrong size on ABP_BearTrapItem_C");
static_assert(offsetof(ABP_BearTrapItem_C, UberGraphFrame_BP_BearTrapItem_C) == 0x000370, "Member 'ABP_BearTrapItem_C::UberGraphFrame_BP_BearTrapItem_C' has a wrong offset!");
static_assert(offsetof(ABP_BearTrapItem_C, SecondHalf) == 0x000378, "Member 'ABP_BearTrapItem_C::SecondHalf' has a wrong offset!");
static_assert(offsetof(ABP_BearTrapItem_C, FirstHalf) == 0x000380, "Member 'ABP_BearTrapItem_C::FirstHalf' has a wrong offset!");

}

