#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BatogonLandingExplosion

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BatogonLandingExplosion.BP_BatogonLandingExplosion_C.GetActorsInDanger
// 0x0068 (0x0068 - 0x0000)
struct BP_BatogonLandingExplosion_C_GetActorsInDanger final
{
public:
	TArray<class AActor*>                         ActorsInDanger;                                    // 0x0000(0x0010)(Parm, OutParm)
	TArray<class AActor*>                         _Actors;                                           // 0x0010(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetActorsInDanger_ActorsInDanger;         // 0x0030(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Batogon_C*                          K2Node_DynamicCast_AsBP_Batogon;                   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BatogonLandingExplosion_C_GetActorsInDanger) == 0x000008, "Wrong alignment on BP_BatogonLandingExplosion_C_GetActorsInDanger");
static_assert(sizeof(BP_BatogonLandingExplosion_C_GetActorsInDanger) == 0x000068, "Wrong size on BP_BatogonLandingExplosion_C_GetActorsInDanger");
static_assert(offsetof(BP_BatogonLandingExplosion_C_GetActorsInDanger, ActorsInDanger) == 0x000000, "Member 'BP_BatogonLandingExplosion_C_GetActorsInDanger::ActorsInDanger' has a wrong offset!");
static_assert(offsetof(BP_BatogonLandingExplosion_C_GetActorsInDanger, _Actors) == 0x000010, "Member 'BP_BatogonLandingExplosion_C_GetActorsInDanger::_Actors' has a wrong offset!");
static_assert(offsetof(BP_BatogonLandingExplosion_C_GetActorsInDanger, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_BatogonLandingExplosion_C_GetActorsInDanger::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BatogonLandingExplosion_C_GetActorsInDanger, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BP_BatogonLandingExplosion_C_GetActorsInDanger::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BatogonLandingExplosion_C_GetActorsInDanger, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_BatogonLandingExplosion_C_GetActorsInDanger::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BatogonLandingExplosion_C_GetActorsInDanger, CallFunc_GetActorsInDanger_ActorsInDanger) == 0x000030, "Member 'BP_BatogonLandingExplosion_C_GetActorsInDanger::CallFunc_GetActorsInDanger_ActorsInDanger' has a wrong offset!");
static_assert(offsetof(BP_BatogonLandingExplosion_C_GetActorsInDanger, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_BatogonLandingExplosion_C_GetActorsInDanger::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BatogonLandingExplosion_C_GetActorsInDanger, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_BatogonLandingExplosion_C_GetActorsInDanger::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BatogonLandingExplosion_C_GetActorsInDanger, CallFunc_Array_Add_ReturnValue) == 0x00004C, "Member 'BP_BatogonLandingExplosion_C_GetActorsInDanger::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BatogonLandingExplosion_C_GetActorsInDanger, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_BatogonLandingExplosion_C_GetActorsInDanger::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BatogonLandingExplosion_C_GetActorsInDanger, K2Node_DynamicCast_AsBP_Batogon) == 0x000058, "Member 'BP_BatogonLandingExplosion_C_GetActorsInDanger::K2Node_DynamicCast_AsBP_Batogon' has a wrong offset!");
static_assert(offsetof(BP_BatogonLandingExplosion_C_GetActorsInDanger, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_BatogonLandingExplosion_C_GetActorsInDanger::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

