#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BearTrap

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BearTrap.BP_BearTrap_C.BndEvt__StringTrap_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_BearTrap_C_BndEvt__StringTrap_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_BearTrap_C_BndEvt__StringTrap_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_BearTrap_C_BndEvt__StringTrap_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_BearTrap_C_BndEvt__StringTrap_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_BearTrap_C_BndEvt__StringTrap_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_BearTrap_C_BndEvt__StringTrap_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_BearTrap_C_BndEvt__StringTrap_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_BndEvt__StringTrap_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_BearTrap_C_BndEvt__StringTrap_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_BndEvt__StringTrap_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_BearTrap_C_BndEvt__StringTrap_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_BndEvt__StringTrap_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_BearTrap_C_BndEvt__StringTrap_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_BndEvt__StringTrap_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_BearTrap_C_BndEvt__StringTrap_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_BndEvt__StringTrap_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_BearTrap_C_BndEvt__StringTrap_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_BearTrap.BP_BearTrap_C.CloseTrap
// 0x0008 (0x0008 - 0x0000)
struct BP_BearTrap_C_CloseTrap final
{
public:
	class ABP_KillableCharacter_C*                Killable;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BearTrap_C_CloseTrap) == 0x000008, "Wrong alignment on BP_BearTrap_C_CloseTrap");
static_assert(sizeof(BP_BearTrap_C_CloseTrap) == 0x000008, "Wrong size on BP_BearTrap_C_CloseTrap");
static_assert(offsetof(BP_BearTrap_C_CloseTrap, Killable) == 0x000000, "Member 'BP_BearTrap_C_CloseTrap::Killable' has a wrong offset!");

// Function BP_BearTrap.BP_BearTrap_C.CloseTrap (All)
// 0x0008 (0x0008 - 0x0000)
struct BP_BearTrap_C_CloseTrap__All_ final
{
public:
	class ABP_KillableCharacter_C*                Killable;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BearTrap_C_CloseTrap__All_) == 0x000008, "Wrong alignment on BP_BearTrap_C_CloseTrap__All_");
static_assert(sizeof(BP_BearTrap_C_CloseTrap__All_) == 0x000008, "Wrong size on BP_BearTrap_C_CloseTrap__All_");
static_assert(offsetof(BP_BearTrap_C_CloseTrap__All_, Killable) == 0x000000, "Member 'BP_BearTrap_C_CloseTrap__All_::Killable' has a wrong offset!");

// Function BP_BearTrap.BP_BearTrap_C.ExecuteUbergraph_BP_BearTrap
// 0x0380 (0x0380 - 0x0000)
struct BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Killable_C>       K2Node_Event_HarmedActor;                          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0038(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ABP_KillableCharacter_C*                K2Node_DynamicCast_AsBP_Killable_Character;        // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCloseToPlayers_CloseToPlayers;          // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAffinity_Affinity;                     // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Killable_C>       K2Node_Event_HarmedActor_1;                        // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Killable_C>       K2Node_Event_KilledActor;                          // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_KillableCharacter_C*                K2Node_CustomEvent_Killable_1;                     // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Killable_C>       K2Node_Event_KilledActor_1;                        // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_KillableCharacter_C*                K2Node_CustomEvent_Killable;                       // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0170(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x0260(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNoBloodModeEnabled_NoBloodModeEnabled;  // 0x0362(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_363[0x5];                                      // 0x0363(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0368(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap) == 0x000008, "Wrong alignment on BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap");
static_assert(sizeof(BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap) == 0x000380, "Wrong size on BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap");
static_assert(offsetof(BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap, EntryPoint) == 0x000000, "Member 'BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap, K2Node_Event_HarmedActor) == 0x000008, "Member 'BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap::K2Node_Event_HarmedActor' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000018, "Member 'BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap, K2Node_ComponentBoundEvent_OtherActor) == 0x000020, "Member 'BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap, K2Node_ComponentBoundEvent_OtherComp) == 0x000028, "Member 'BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000030, "Member 'BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap, K2Node_ComponentBoundEvent_bFromSweep) == 0x000034, "Member 'BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap, K2Node_ComponentBoundEvent_SweepResult) == 0x000038, "Member 'BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap, K2Node_DynamicCast_AsBP_Killable_Character) == 0x000120, "Member 'BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap::K2Node_DynamicCast_AsBP_Killable_Character' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap, K2Node_DynamicCast_bSuccess) == 0x000128, "Member 'BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap, CallFunc_IsCloseToPlayers_CloseToPlayers) == 0x000129, "Member 'BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap::CallFunc_IsCloseToPlayers_CloseToPlayers' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap, CallFunc_GetAffinity_Affinity) == 0x00012A, "Member 'BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap::CallFunc_GetAffinity_Affinity' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap, K2Node_Event_HarmedActor_1) == 0x000130, "Member 'BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap::K2Node_Event_HarmedActor_1' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap, K2Node_Event_KilledActor) == 0x000140, "Member 'BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap::K2Node_Event_KilledActor' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap, K2Node_CustomEvent_Killable_1) == 0x000150, "Member 'BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap::K2Node_CustomEvent_Killable_1' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap, K2Node_Event_KilledActor_1) == 0x000158, "Member 'BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap::K2Node_Event_KilledActor_1' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap, K2Node_CustomEvent_Killable) == 0x000168, "Member 'BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap::K2Node_CustomEvent_Killable' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000170, "Member 'BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap, CallFunc_HasAuthority_ReturnValue) == 0x000258, "Member 'BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x000260, "Member 'BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000348, "Member 'BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap, Temp_bool_IsClosed_Variable) == 0x000360, "Member 'BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap, Temp_bool_Has_Been_Initd_Variable) == 0x000361, "Member 'BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap, CallFunc_IsNoBloodModeEnabled_NoBloodModeEnabled) == 0x000362, "Member 'BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap::CallFunc_IsNoBloodModeEnabled_NoBloodModeEnabled' has a wrong offset!");
static_assert(offsetof(BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000368, "Member 'BP_BearTrap_C_ExecuteUbergraph_BP_BearTrap::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");

// Function BP_BearTrap.BP_BearTrap_C.HasHarmed (All)
// 0x0010 (0x0010 - 0x0000)
struct BP_BearTrap_C_HasHarmed__All_ final
{
public:
	TScriptInterface<class IBPI_Killable_C>       HarmedActor;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BearTrap_C_HasHarmed__All_) == 0x000008, "Wrong alignment on BP_BearTrap_C_HasHarmed__All_");
static_assert(sizeof(BP_BearTrap_C_HasHarmed__All_) == 0x000010, "Wrong size on BP_BearTrap_C_HasHarmed__All_");
static_assert(offsetof(BP_BearTrap_C_HasHarmed__All_, HarmedActor) == 0x000000, "Member 'BP_BearTrap_C_HasHarmed__All_::HarmedActor' has a wrong offset!");

// Function BP_BearTrap.BP_BearTrap_C.HasHarmed (Server)
// 0x0010 (0x0010 - 0x0000)
struct BP_BearTrap_C_HasHarmed__Server_ final
{
public:
	TScriptInterface<class IBPI_Killable_C>       HarmedActor;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BearTrap_C_HasHarmed__Server_) == 0x000008, "Wrong alignment on BP_BearTrap_C_HasHarmed__Server_");
static_assert(sizeof(BP_BearTrap_C_HasHarmed__Server_) == 0x000010, "Wrong size on BP_BearTrap_C_HasHarmed__Server_");
static_assert(offsetof(BP_BearTrap_C_HasHarmed__Server_, HarmedActor) == 0x000000, "Member 'BP_BearTrap_C_HasHarmed__Server_::HarmedActor' has a wrong offset!");

// Function BP_BearTrap.BP_BearTrap_C.HasKilled (All)
// 0x0010 (0x0010 - 0x0000)
struct BP_BearTrap_C_HasKilled__All_ final
{
public:
	TScriptInterface<class IBPI_Killable_C>       KilledActor;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BearTrap_C_HasKilled__All_) == 0x000008, "Wrong alignment on BP_BearTrap_C_HasKilled__All_");
static_assert(sizeof(BP_BearTrap_C_HasKilled__All_) == 0x000010, "Wrong size on BP_BearTrap_C_HasKilled__All_");
static_assert(offsetof(BP_BearTrap_C_HasKilled__All_, KilledActor) == 0x000000, "Member 'BP_BearTrap_C_HasKilled__All_::KilledActor' has a wrong offset!");

// Function BP_BearTrap.BP_BearTrap_C.HasKilled (Server)
// 0x0010 (0x0010 - 0x0000)
struct BP_BearTrap_C_HasKilled__Server_ final
{
public:
	TScriptInterface<class IBPI_Killable_C>       KilledActor;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BearTrap_C_HasKilled__Server_) == 0x000008, "Wrong alignment on BP_BearTrap_C_HasKilled__Server_");
static_assert(sizeof(BP_BearTrap_C_HasKilled__Server_) == 0x000010, "Wrong size on BP_BearTrap_C_HasKilled__Server_");
static_assert(offsetof(BP_BearTrap_C_HasKilled__Server_, KilledActor) == 0x000000, "Member 'BP_BearTrap_C_HasKilled__Server_::KilledActor' has a wrong offset!");

}

