#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Backpack

#include "Basic.hpp"

#include "BP_InventoryItem_classes.hpp"
#include "Engine_structs.hpp"
#include "S_AvatarBag_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Backpack.BP_Backpack_C
// 0x0060 (0x03D0 - 0x0370)
class ABP_Backpack_C : public ABP_InventoryItem_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Backpack_C;                      // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FS_AvatarBag                           AvatarBag;                                         // 0x0378(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         AdditionalInventorySlots;                          // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnRep_Player();
	void UpdateBagOnAvatar(bool ForceRemove);
	void OnRep_IsEquipped();
	void AddInventorySlots();
	void RemoveInventorySlots();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ExecuteUbergraph_BP_Backpack(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Backpack_C">();
	}
	static class ABP_Backpack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Backpack_C>();
	}
};
static_assert(alignof(ABP_Backpack_C) == 0x000008, "Wrong alignment on ABP_Backpack_C");
static_assert(sizeof(ABP_Backpack_C) == 0x0003D0, "Wrong size on ABP_Backpack_C");
static_assert(offsetof(ABP_Backpack_C, UberGraphFrame_BP_Backpack_C) == 0x000370, "Member 'ABP_Backpack_C::UberGraphFrame_BP_Backpack_C' has a wrong offset!");
static_assert(offsetof(ABP_Backpack_C, AvatarBag) == 0x000378, "Member 'ABP_Backpack_C::AvatarBag' has a wrong offset!");
static_assert(offsetof(ABP_Backpack_C, AdditionalInventorySlots) == 0x0003C8, "Member 'ABP_Backpack_C::AdditionalInventorySlots' has a wrong offset!");

}

