#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Biomass_AlienStalagmites

#include "Basic.hpp"

#include "BP_Biomass_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Biomass_AlienStalagmites.BP_Biomass_AlienStalagmites_C
// 0x0048 (0x02F0 - 0x02A8)
class ABP_Biomass_AlienStalagmites_C final : public ABP_Biomass_Parent_C
{
public:
	class UBPC_ScoringComponent_C*                Scoring;                                           // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal;                                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Organism_011_StaticMeshComponent0;              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Organism_09_StaticMeshComponent0;               // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_EggProcess_SM_Organism_05;                      // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BP_EggProcess_DefaultSceneRoot;                    // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Biomass_AlienStalagmites_C">();
	}
	static class ABP_Biomass_AlienStalagmites_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Biomass_AlienStalagmites_C>();
	}
};
static_assert(alignof(ABP_Biomass_AlienStalagmites_C) == 0x000008, "Wrong alignment on ABP_Biomass_AlienStalagmites_C");
static_assert(sizeof(ABP_Biomass_AlienStalagmites_C) == 0x0002F0, "Wrong size on ABP_Biomass_AlienStalagmites_C");
static_assert(offsetof(ABP_Biomass_AlienStalagmites_C, Scoring) == 0x0002A8, "Member 'ABP_Biomass_AlienStalagmites_C::Scoring' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienStalagmites_C, Billboard) == 0x0002B0, "Member 'ABP_Biomass_AlienStalagmites_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienStalagmites_C, Arrow) == 0x0002B8, "Member 'ABP_Biomass_AlienStalagmites_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienStalagmites_C, Decal) == 0x0002C0, "Member 'ABP_Biomass_AlienStalagmites_C::Decal' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienStalagmites_C, SM_Organism_011_StaticMeshComponent0) == 0x0002C8, "Member 'ABP_Biomass_AlienStalagmites_C::SM_Organism_011_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienStalagmites_C, SM_Organism_09_StaticMeshComponent0) == 0x0002D0, "Member 'ABP_Biomass_AlienStalagmites_C::SM_Organism_09_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienStalagmites_C, BP_EggProcess_SM_Organism_05) == 0x0002D8, "Member 'ABP_Biomass_AlienStalagmites_C::BP_EggProcess_SM_Organism_05' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienStalagmites_C, BP_EggProcess_DefaultSceneRoot) == 0x0002E0, "Member 'ABP_Biomass_AlienStalagmites_C::BP_EggProcess_DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienStalagmites_C, SharedRoot) == 0x0002E8, "Member 'ABP_Biomass_AlienStalagmites_C::SharedRoot' has a wrong offset!");

}

