#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BackgroundSFX

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_BackgroundSFX.BP_BackgroundSFX_C.ExecuteUbergraph_BP_BackgroundSFX
// 0x0060 (0x0060 - 0x0000)
struct BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundCue*                              CallFunc_GetNextSound_Sound;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundCue*                              K2Node_CustomEvent_SoundCue;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetInitDelay_Delay;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWaitDelay_Delay;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_InteriorVolume_C*                   CallFunc_FindInterior_InteriorVolume;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_1;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX) == 0x000008, "Wrong alignment on BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX");
static_assert(sizeof(BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX) == 0x000060, "Wrong size on BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX");
static_assert(offsetof(BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX, EntryPoint) == 0x000000, "Member 'BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX, CallFunc_GetNextSound_Sound) == 0x000008, "Member 'BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX::CallFunc_GetNextSound_Sound' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX, CallFunc_HasAuthority_ReturnValue) == 0x000010, "Member 'BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX, CallFunc_IsValid_ReturnValue_1) == 0x000012, "Member 'BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX, K2Node_CustomEvent_SoundCue) == 0x000018, "Member 'BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX::K2Node_CustomEvent_SoundCue' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX, CallFunc_GetInitDelay_Delay) == 0x000038, "Member 'BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX::CallFunc_GetInitDelay_Delay' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000040, "Member 'BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX, CallFunc_GetWaitDelay_Delay) == 0x000048, "Member 'BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX::CallFunc_GetWaitDelay_Delay' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX, CallFunc_FindInterior_InteriorVolume) == 0x000050, "Member 'BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX::CallFunc_FindInterior_InteriorVolume' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX, CallFunc_Delay_Duration_ImplicitCast) == 0x000058, "Member 'BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX, CallFunc_Delay_Duration_ImplicitCast_1) == 0x00005C, "Member 'BP_BackgroundSFX_C_ExecuteUbergraph_BP_BackgroundSFX::CallFunc_Delay_Duration_ImplicitCast_1' has a wrong offset!");

// Function BP_BackgroundSFX.BP_BackgroundSFX_C.FindInterior
// 0x0058 (0x0058 - 0x0000)
struct BP_BackgroundSFX_C_FindInterior final
{
public:
	class ABP_InteriorVolume_C*                   InteriorVolume_0;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_InteriorVolume_C*>           CallFunc_GetAllActorsOfClass_OutActors;            // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_InteriorVolume_C*                   CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInVolume_Result;                        // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BackgroundSFX_C_FindInterior) == 0x000008, "Wrong alignment on BP_BackgroundSFX_C_FindInterior");
static_assert(sizeof(BP_BackgroundSFX_C_FindInterior) == 0x000058, "Wrong size on BP_BackgroundSFX_C_FindInterior");
static_assert(offsetof(BP_BackgroundSFX_C_FindInterior, InteriorVolume_0) == 0x000000, "Member 'BP_BackgroundSFX_C_FindInterior::InteriorVolume_0' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_FindInterior, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_BackgroundSFX_C_FindInterior::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_FindInterior, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_BackgroundSFX_C_FindInterior::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_FindInterior, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_BackgroundSFX_C_FindInterior::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_FindInterior, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_BackgroundSFX_C_FindInterior::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_FindInterior, CallFunc_GetAllActorsOfClass_OutActors) == 0x000030, "Member 'BP_BackgroundSFX_C_FindInterior::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_FindInterior, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_BackgroundSFX_C_FindInterior::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_FindInterior, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_BackgroundSFX_C_FindInterior::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_FindInterior, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_BackgroundSFX_C_FindInterior::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_FindInterior, CallFunc_IsInVolume_Result) == 0x000051, "Member 'BP_BackgroundSFX_C_FindInterior::CallFunc_IsInVolume_Result' has a wrong offset!");

// Function BP_BackgroundSFX.BP_BackgroundSFX_C.GetInitDelay
// 0x0020 (0x0020 - 0x0000)
struct BP_BackgroundSFX_C_GetInitDelay final
{
public:
	double                                        Delay;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWaitDelay_Delay;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BackgroundSFX_C_GetInitDelay) == 0x000008, "Wrong alignment on BP_BackgroundSFX_C_GetInitDelay");
static_assert(sizeof(BP_BackgroundSFX_C_GetInitDelay) == 0x000020, "Wrong size on BP_BackgroundSFX_C_GetInitDelay");
static_assert(offsetof(BP_BackgroundSFX_C_GetInitDelay, Delay) == 0x000000, "Member 'BP_BackgroundSFX_C_GetInitDelay::Delay' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_GetInitDelay, CallFunc_GetWaitDelay_Delay) == 0x000008, "Member 'BP_BackgroundSFX_C_GetInitDelay::CallFunc_GetWaitDelay_Delay' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_GetInitDelay, CallFunc_RandomFloatInRange_ReturnValue) == 0x000010, "Member 'BP_BackgroundSFX_C_GetInitDelay::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_GetInitDelay, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_BackgroundSFX_C_GetInitDelay::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_GetInitDelay, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000019, "Member 'BP_BackgroundSFX_C_GetInitDelay::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_GetInitDelay, CallFunc_BooleanAND_ReturnValue) == 0x00001A, "Member 'BP_BackgroundSFX_C_GetInitDelay::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_BackgroundSFX.BP_BackgroundSFX_C.GetNextSound
// 0x0020 (0x0020 - 0x0000)
struct BP_BackgroundSFX_C_GetNextSound final
{
public:
	class USoundCue*                              Sound;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              _Sound;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundCue*                              CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BackgroundSFX_C_GetNextSound) == 0x000008, "Wrong alignment on BP_BackgroundSFX_C_GetNextSound");
static_assert(sizeof(BP_BackgroundSFX_C_GetNextSound) == 0x000020, "Wrong size on BP_BackgroundSFX_C_GetNextSound");
static_assert(offsetof(BP_BackgroundSFX_C_GetNextSound, Sound) == 0x000000, "Member 'BP_BackgroundSFX_C_GetNextSound::Sound' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_GetNextSound, _Sound) == 0x000008, "Member 'BP_BackgroundSFX_C_GetNextSound::_Sound' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_GetNextSound, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_BackgroundSFX_C_GetNextSound::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_GetNextSound, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000014, "Member 'BP_BackgroundSFX_C_GetNextSound::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_GetNextSound, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_BackgroundSFX_C_GetNextSound::CallFunc_Array_Get_Item' has a wrong offset!");

// Function BP_BackgroundSFX.BP_BackgroundSFX_C.GetWaitDelay
// 0x0010 (0x0010 - 0x0000)
struct BP_BackgroundSFX_C_GetWaitDelay final
{
public:
	double                                        Delay;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BackgroundSFX_C_GetWaitDelay) == 0x000008, "Wrong alignment on BP_BackgroundSFX_C_GetWaitDelay");
static_assert(sizeof(BP_BackgroundSFX_C_GetWaitDelay) == 0x000010, "Wrong size on BP_BackgroundSFX_C_GetWaitDelay");
static_assert(offsetof(BP_BackgroundSFX_C_GetWaitDelay, Delay) == 0x000000, "Member 'BP_BackgroundSFX_C_GetWaitDelay::Delay' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_GetWaitDelay, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'BP_BackgroundSFX_C_GetWaitDelay::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");

// Function BP_BackgroundSFX.BP_BackgroundSFX_C.PlaySoundReplicated
// 0x0008 (0x0008 - 0x0000)
struct BP_BackgroundSFX_C_PlaySoundReplicated final
{
public:
	class USoundCue*                              SoundCue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BackgroundSFX_C_PlaySoundReplicated) == 0x000008, "Wrong alignment on BP_BackgroundSFX_C_PlaySoundReplicated");
static_assert(sizeof(BP_BackgroundSFX_C_PlaySoundReplicated) == 0x000008, "Wrong size on BP_BackgroundSFX_C_PlaySoundReplicated");
static_assert(offsetof(BP_BackgroundSFX_C_PlaySoundReplicated, SoundCue) == 0x000000, "Member 'BP_BackgroundSFX_C_PlaySoundReplicated::SoundCue' has a wrong offset!");

// Function BP_BackgroundSFX.BP_BackgroundSFX_C.ShuffleSounds
// 0x0008 (0x0008 - 0x0000)
struct BP_BackgroundSFX_C_ShuffleSounds final
{
public:
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BackgroundSFX_C_ShuffleSounds) == 0x000004, "Wrong alignment on BP_BackgroundSFX_C_ShuffleSounds");
static_assert(sizeof(BP_BackgroundSFX_C_ShuffleSounds) == 0x000008, "Wrong size on BP_BackgroundSFX_C_ShuffleSounds");
static_assert(offsetof(BP_BackgroundSFX_C_ShuffleSounds, CallFunc_Array_Length_ReturnValue) == 0x000000, "Member 'BP_BackgroundSFX_C_ShuffleSounds::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BackgroundSFX_C_ShuffleSounds, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'BP_BackgroundSFX_C_ShuffleSounds::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

