#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BearTrapItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_BearTrapItem.BP_BearTrapItem_C.ExecuteUbergraph_BP_BearTrapItem
// 0x02E0 (0x02E0 - 0x0000)
struct BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0050(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x00A8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_193[0x1];                                      // 0x0193(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0270(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_BearTrap_C*                         CallFunc_FinishSpawningActor_ReturnValue;          // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem) == 0x000010, "Wrong alignment on BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem");
static_assert(sizeof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem) == 0x0002E0, "Wrong size on BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, EntryPoint) == 0x000000, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_GetActorForwardVector_ReturnValue) == 0x000020, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000038, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, Temp_object_Variable) == 0x000050, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000060, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_Add_VectorVector_ReturnValue) == 0x000078, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000090, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_LineTraceSingle_OutHit) == 0x0000A8, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_LineTraceSingle_ReturnValue) == 0x000190, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_BreakHitResult_bBlockingHit) == 0x000191, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_BreakHitResult_bInitialOverlap) == 0x000192, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_BreakHitResult_Time) == 0x000194, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_BreakHitResult_Distance) == 0x000198, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_BreakHitResult_Location) == 0x0001A0, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_BreakHitResult_ImpactPoint) == 0x0001B8, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_BreakHitResult_Normal) == 0x0001D0, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_BreakHitResult_ImpactNormal) == 0x0001E8, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_BreakHitResult_PhysMat) == 0x000200, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_BreakHitResult_HitActor) == 0x000208, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_BreakHitResult_HitComponent) == 0x000210, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_BreakHitResult_HitBoneName) == 0x000218, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_BreakHitResult_BoneName) == 0x000220, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_BreakHitResult_HitItem) == 0x000228, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_BreakHitResult_ElementIndex) == 0x00022C, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_BreakHitResult_FaceIndex) == 0x000230, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_BreakHitResult_TraceStart) == 0x000238, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_BreakHitResult_TraceEnd) == 0x000250, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_MakeTransform_ReturnValue) == 0x000270, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0002D0, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem, CallFunc_FinishSpawningActor_ReturnValue) == 0x0002D8, "Member 'BP_BearTrapItem_C_ExecuteUbergraph_BP_BearTrapItem::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

