#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Biomass_AlienHollow

#include "Basic.hpp"

#include "BP_Biomass_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Biomass_AlienHollow.BP_Biomass_AlienHollow_C
// 0x0068 (0x0310 - 0x02A8)
class ABP_Biomass_AlienHollow_C final : public ABP_Biomass_Parent_C
{
public:
	class UBPC_ScoringComponent_C*                Scoring;                                           // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        MI_Moss_Patch_tjxpndh_2K_NewDecalComponent;        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        MI_Moss_Patch_tjxpndh_2K2_NewDecalComponent;       // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Biomass_002_SM_Biomass_002;                     // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BP_Biomass_002_DefaultSceneRoot;                   // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Biomass_005_StaticMesh3;                        // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Biomass_005_StaticMesh2;                        // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Biomass_005_StaticMesh1;                        // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Biomass_005_StaticMesh;                         // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Biomass_005_SM_Biomass_010;                     // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Biomass_005_SM_Biomass_005;                     // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BP_Biomass_005_DefaultSceneRoot;                   // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Biomass_AlienHollow_C">();
	}
	static class ABP_Biomass_AlienHollow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Biomass_AlienHollow_C>();
	}
};
static_assert(alignof(ABP_Biomass_AlienHollow_C) == 0x000008, "Wrong alignment on ABP_Biomass_AlienHollow_C");
static_assert(sizeof(ABP_Biomass_AlienHollow_C) == 0x000310, "Wrong size on ABP_Biomass_AlienHollow_C");
static_assert(offsetof(ABP_Biomass_AlienHollow_C, Scoring) == 0x0002A8, "Member 'ABP_Biomass_AlienHollow_C::Scoring' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienHollow_C, MI_Moss_Patch_tjxpndh_2K_NewDecalComponent) == 0x0002B0, "Member 'ABP_Biomass_AlienHollow_C::MI_Moss_Patch_tjxpndh_2K_NewDecalComponent' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienHollow_C, MI_Moss_Patch_tjxpndh_2K2_NewDecalComponent) == 0x0002B8, "Member 'ABP_Biomass_AlienHollow_C::MI_Moss_Patch_tjxpndh_2K2_NewDecalComponent' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienHollow_C, BP_Biomass_002_SM_Biomass_002) == 0x0002C0, "Member 'ABP_Biomass_AlienHollow_C::BP_Biomass_002_SM_Biomass_002' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienHollow_C, BP_Biomass_002_DefaultSceneRoot) == 0x0002C8, "Member 'ABP_Biomass_AlienHollow_C::BP_Biomass_002_DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienHollow_C, BP_Biomass_005_StaticMesh3) == 0x0002D0, "Member 'ABP_Biomass_AlienHollow_C::BP_Biomass_005_StaticMesh3' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienHollow_C, BP_Biomass_005_StaticMesh2) == 0x0002D8, "Member 'ABP_Biomass_AlienHollow_C::BP_Biomass_005_StaticMesh2' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienHollow_C, BP_Biomass_005_StaticMesh1) == 0x0002E0, "Member 'ABP_Biomass_AlienHollow_C::BP_Biomass_005_StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienHollow_C, BP_Biomass_005_StaticMesh) == 0x0002E8, "Member 'ABP_Biomass_AlienHollow_C::BP_Biomass_005_StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienHollow_C, BP_Biomass_005_SM_Biomass_010) == 0x0002F0, "Member 'ABP_Biomass_AlienHollow_C::BP_Biomass_005_SM_Biomass_010' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienHollow_C, BP_Biomass_005_SM_Biomass_005) == 0x0002F8, "Member 'ABP_Biomass_AlienHollow_C::BP_Biomass_005_SM_Biomass_005' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienHollow_C, BP_Biomass_005_DefaultSceneRoot) == 0x000300, "Member 'ABP_Biomass_AlienHollow_C::BP_Biomass_005_DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienHollow_C, SharedRoot) == 0x000308, "Member 'ABP_Biomass_AlienHollow_C::SharedRoot' has a wrong offset!");

}

