#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BuildingExplosion

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_BuildingExplosion.BP_BuildingExplosion_C.ExecuteUbergraph_BP_BuildingExplosion
// 0x0150 (0x0150 - 0x0000)
struct BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Random_OutItem;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RandomRotator_ReturnValue;                // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue;     // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion) == 0x000010, "Wrong alignment on BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion");
static_assert(sizeof(BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion) == 0x000150, "Wrong size on BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion");
static_assert(offsetof(BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion, EntryPoint) == 0x000000, "Member 'BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion, Temp_int_Variable) == 0x000004, "Member 'BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000010, "Member 'BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion, CallFunc_Array_Random_OutItem) == 0x000028, "Member 'BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion, CallFunc_Array_Random_OutIndex) == 0x000030, "Member 'BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion, CallFunc_RandomRotator_ReturnValue) == 0x000038, "Member 'BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion::CallFunc_RandomRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion, CallFunc_RandomFloatInRange_ReturnValue) == 0x000050, "Member 'BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000058, "Member 'BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion, CallFunc_GetComponentBounds_Origin) == 0x000070, "Member 'BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion, CallFunc_GetComponentBounds_BoxExtent) == 0x000088, "Member 'BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion, CallFunc_GetComponentBounds_SphereRadius) == 0x0000A0, "Member 'BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion, CallFunc_Divide_VectorVector_ReturnValue) == 0x0000A8, "Member 'BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion, CallFunc_RandomPointInBoundingBox_ReturnValue) == 0x0000C0, "Member 'BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion::CallFunc_RandomPointInBoundingBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion, CallFunc_MakeTransform_ReturnValue) == 0x0000E0, "Member 'BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000140, "Member 'BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion, CallFunc_FinishSpawningActor_ReturnValue) == 0x000148, "Member 'BP_BuildingExplosion_C_ExecuteUbergraph_BP_BuildingExplosion::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

