#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Biomass_AlienCorridor

#include "Basic.hpp"

#include "BP_Biomass_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Biomass_AlienCorridor.BP_Biomass_AlienCorridor_C
// 0x0230 (0x04D8 - 0x02A8)
class ABP_Biomass_AlienCorridor_C final : public ABP_Biomass_Parent_C
{
public:
	class UBPC_ScoringComponent_C*                Scoring6;                                          // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ScoringComponent_C*                Scoring5;                                          // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ScoringComponent_C*                Scoring4;                                          // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ScoringComponent_C*                Scoring3;                                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ScoringComponent_C*                Scoring2;                                          // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ScoringComponent_C*                Scoring1;                                          // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ScoringComponent_C*                Scoring;                                           // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Organism_01_StaticMeshComponent0;               // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Organism_2_StaticMeshComponent0;                // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Organism_08_StaticMeshComponent0;               // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Organism_7_StaticMeshComponent0;                // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Organism_6_StaticMeshComponent0;                // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Organism_09_StaticMeshComponent0;               // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Organism_10_StaticMeshComponent0;               // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Organism_011_StaticMeshComponent0;              // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Organism_04_StaticMeshComponent0;               // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Organism_06_StaticMeshComponent0;               // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Organism_05_StaticMeshComponent0;               // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_EggProcess_SM_Organism_05;                      // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BP_EggProcess_DefaultSceneRoot;                    // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Biomass_007_SM_Biomass_007;                     // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BP_Biomass_007_DefaultSceneRoot;                   // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_EggProcess4_SM_Organism_05;                     // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BP_EggProcess4_DefaultSceneRoot;                   // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_EggProcess3_SM_Organism_05;                     // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BP_EggProcess3_DefaultSceneRoot;                   // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_StaticMesh10;                              // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_StaticMesh9;                               // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_StaticMesh8;                               // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_StaticMesh7;                               // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_StaticMesh6;                               // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_SM_Organism_07;                            // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_StaticMesh5;                               // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_StaticMesh4;                               // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_StaticMesh3;                               // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_StaticMesh2;                               // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_StaticMesh1;                               // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_StaticMesh;                                // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_SM_Organism_015;                           // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Nest_SM_Organism_08;                            // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BP_Nest_DefaultSceneRoot;                          // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Egg_002_SM_Organism_07;                         // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Egg_002_SM_Organism_015;                        // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BP_Egg_002_DefaultSceneRoot;                       // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_EggProcess5_SM_Organism_05;                     // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BP_EggProcess5_DefaultSceneRoot;                   // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_EggProcess2_SM_Organism_05;                     // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BP_EggProcess2_DefaultSceneRoot;                   // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Feeder_01_SM_Organism_013;                      // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BP_Feeder_01_DefaultSceneRoot;                     // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Organism_03_StaticMeshComponent0;               // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Biomass_005_StaticMesh3;                        // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Biomass_005_StaticMesh2;                        // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Biomass_005_StaticMesh1;                        // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Biomass_005_StaticMesh;                         // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Biomass_005_SM_Biomass_010;                     // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Biomass_005_SM_Biomass_005;                     // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BP_Biomass_005_DefaultSceneRoot;                   // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BP_Biomass_008_SM_Biomass_008;                     // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BP_Biomass_008_DefaultSceneRoot;                   // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        MI_Moss_Patch_tjxpndh_2K8_NewDecalComponent;       // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        MI_Moss_Patch_tjxpndh_2K7_NewDecalComponent;       // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        MI_Moss_Patch_tjxpndh_2K6_NewDecalComponent;       // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        MI_Moss_Patch_tjxpndh_2K5_NewDecalComponent;       // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        MI_Moss_Patch_tjxpndh_2K4_NewDecalComponent;       // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        MI_Moss_Patch_tjxpndh_2K3_NewDecalComponent;       // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        MI_Moss_Patch_tjxpndh_2K2_NewDecalComponent;       // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        MI_Moss_Patch_tjxpndh_2K_NewDecalComponent;        // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        MI_Moss_Patch_tjxpndh_2K9_NewDecalComponent;       // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Biomass_AlienCorridor_C">();
	}
	static class ABP_Biomass_AlienCorridor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Biomass_AlienCorridor_C>();
	}
};
static_assert(alignof(ABP_Biomass_AlienCorridor_C) == 0x000008, "Wrong alignment on ABP_Biomass_AlienCorridor_C");
static_assert(sizeof(ABP_Biomass_AlienCorridor_C) == 0x0004D8, "Wrong size on ABP_Biomass_AlienCorridor_C");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, Scoring6) == 0x0002A8, "Member 'ABP_Biomass_AlienCorridor_C::Scoring6' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, Scoring5) == 0x0002B0, "Member 'ABP_Biomass_AlienCorridor_C::Scoring5' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, Scoring4) == 0x0002B8, "Member 'ABP_Biomass_AlienCorridor_C::Scoring4' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, Scoring3) == 0x0002C0, "Member 'ABP_Biomass_AlienCorridor_C::Scoring3' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, Scoring2) == 0x0002C8, "Member 'ABP_Biomass_AlienCorridor_C::Scoring2' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, Scoring1) == 0x0002D0, "Member 'ABP_Biomass_AlienCorridor_C::Scoring1' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, Scoring) == 0x0002D8, "Member 'ABP_Biomass_AlienCorridor_C::Scoring' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, SM_Organism_01_StaticMeshComponent0) == 0x0002E0, "Member 'ABP_Biomass_AlienCorridor_C::SM_Organism_01_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, SM_Organism_2_StaticMeshComponent0) == 0x0002E8, "Member 'ABP_Biomass_AlienCorridor_C::SM_Organism_2_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, SM_Organism_08_StaticMeshComponent0) == 0x0002F0, "Member 'ABP_Biomass_AlienCorridor_C::SM_Organism_08_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, SM_Organism_7_StaticMeshComponent0) == 0x0002F8, "Member 'ABP_Biomass_AlienCorridor_C::SM_Organism_7_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, SM_Organism_6_StaticMeshComponent0) == 0x000300, "Member 'ABP_Biomass_AlienCorridor_C::SM_Organism_6_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, SM_Organism_09_StaticMeshComponent0) == 0x000308, "Member 'ABP_Biomass_AlienCorridor_C::SM_Organism_09_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, SM_Organism_10_StaticMeshComponent0) == 0x000310, "Member 'ABP_Biomass_AlienCorridor_C::SM_Organism_10_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, SM_Organism_011_StaticMeshComponent0) == 0x000318, "Member 'ABP_Biomass_AlienCorridor_C::SM_Organism_011_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, SM_Organism_04_StaticMeshComponent0) == 0x000320, "Member 'ABP_Biomass_AlienCorridor_C::SM_Organism_04_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, SM_Organism_06_StaticMeshComponent0) == 0x000328, "Member 'ABP_Biomass_AlienCorridor_C::SM_Organism_06_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, SM_Organism_05_StaticMeshComponent0) == 0x000330, "Member 'ABP_Biomass_AlienCorridor_C::SM_Organism_05_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_EggProcess_SM_Organism_05) == 0x000338, "Member 'ABP_Biomass_AlienCorridor_C::BP_EggProcess_SM_Organism_05' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_EggProcess_DefaultSceneRoot) == 0x000340, "Member 'ABP_Biomass_AlienCorridor_C::BP_EggProcess_DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Biomass_007_SM_Biomass_007) == 0x000348, "Member 'ABP_Biomass_AlienCorridor_C::BP_Biomass_007_SM_Biomass_007' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Biomass_007_DefaultSceneRoot) == 0x000350, "Member 'ABP_Biomass_AlienCorridor_C::BP_Biomass_007_DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_EggProcess4_SM_Organism_05) == 0x000358, "Member 'ABP_Biomass_AlienCorridor_C::BP_EggProcess4_SM_Organism_05' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_EggProcess4_DefaultSceneRoot) == 0x000360, "Member 'ABP_Biomass_AlienCorridor_C::BP_EggProcess4_DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_EggProcess3_SM_Organism_05) == 0x000368, "Member 'ABP_Biomass_AlienCorridor_C::BP_EggProcess3_SM_Organism_05' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_EggProcess3_DefaultSceneRoot) == 0x000370, "Member 'ABP_Biomass_AlienCorridor_C::BP_EggProcess3_DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Nest_StaticMesh10) == 0x000378, "Member 'ABP_Biomass_AlienCorridor_C::BP_Nest_StaticMesh10' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Nest_StaticMesh9) == 0x000380, "Member 'ABP_Biomass_AlienCorridor_C::BP_Nest_StaticMesh9' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Nest_StaticMesh8) == 0x000388, "Member 'ABP_Biomass_AlienCorridor_C::BP_Nest_StaticMesh8' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Nest_StaticMesh7) == 0x000390, "Member 'ABP_Biomass_AlienCorridor_C::BP_Nest_StaticMesh7' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Nest_StaticMesh6) == 0x000398, "Member 'ABP_Biomass_AlienCorridor_C::BP_Nest_StaticMesh6' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Nest_SM_Organism_07) == 0x0003A0, "Member 'ABP_Biomass_AlienCorridor_C::BP_Nest_SM_Organism_07' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Nest_StaticMesh5) == 0x0003A8, "Member 'ABP_Biomass_AlienCorridor_C::BP_Nest_StaticMesh5' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Nest_StaticMesh4) == 0x0003B0, "Member 'ABP_Biomass_AlienCorridor_C::BP_Nest_StaticMesh4' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Nest_StaticMesh3) == 0x0003B8, "Member 'ABP_Biomass_AlienCorridor_C::BP_Nest_StaticMesh3' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Nest_StaticMesh2) == 0x0003C0, "Member 'ABP_Biomass_AlienCorridor_C::BP_Nest_StaticMesh2' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Nest_StaticMesh1) == 0x0003C8, "Member 'ABP_Biomass_AlienCorridor_C::BP_Nest_StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Nest_StaticMesh) == 0x0003D0, "Member 'ABP_Biomass_AlienCorridor_C::BP_Nest_StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Nest_SM_Organism_015) == 0x0003D8, "Member 'ABP_Biomass_AlienCorridor_C::BP_Nest_SM_Organism_015' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Nest_SM_Organism_08) == 0x0003E0, "Member 'ABP_Biomass_AlienCorridor_C::BP_Nest_SM_Organism_08' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Nest_DefaultSceneRoot) == 0x0003E8, "Member 'ABP_Biomass_AlienCorridor_C::BP_Nest_DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Egg_002_SM_Organism_07) == 0x0003F0, "Member 'ABP_Biomass_AlienCorridor_C::BP_Egg_002_SM_Organism_07' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Egg_002_SM_Organism_015) == 0x0003F8, "Member 'ABP_Biomass_AlienCorridor_C::BP_Egg_002_SM_Organism_015' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Egg_002_DefaultSceneRoot) == 0x000400, "Member 'ABP_Biomass_AlienCorridor_C::BP_Egg_002_DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_EggProcess5_SM_Organism_05) == 0x000408, "Member 'ABP_Biomass_AlienCorridor_C::BP_EggProcess5_SM_Organism_05' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_EggProcess5_DefaultSceneRoot) == 0x000410, "Member 'ABP_Biomass_AlienCorridor_C::BP_EggProcess5_DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_EggProcess2_SM_Organism_05) == 0x000418, "Member 'ABP_Biomass_AlienCorridor_C::BP_EggProcess2_SM_Organism_05' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_EggProcess2_DefaultSceneRoot) == 0x000420, "Member 'ABP_Biomass_AlienCorridor_C::BP_EggProcess2_DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Feeder_01_SM_Organism_013) == 0x000428, "Member 'ABP_Biomass_AlienCorridor_C::BP_Feeder_01_SM_Organism_013' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Feeder_01_DefaultSceneRoot) == 0x000430, "Member 'ABP_Biomass_AlienCorridor_C::BP_Feeder_01_DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, SM_Organism_03_StaticMeshComponent0) == 0x000438, "Member 'ABP_Biomass_AlienCorridor_C::SM_Organism_03_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Biomass_005_StaticMesh3) == 0x000440, "Member 'ABP_Biomass_AlienCorridor_C::BP_Biomass_005_StaticMesh3' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Biomass_005_StaticMesh2) == 0x000448, "Member 'ABP_Biomass_AlienCorridor_C::BP_Biomass_005_StaticMesh2' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Biomass_005_StaticMesh1) == 0x000450, "Member 'ABP_Biomass_AlienCorridor_C::BP_Biomass_005_StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Biomass_005_StaticMesh) == 0x000458, "Member 'ABP_Biomass_AlienCorridor_C::BP_Biomass_005_StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Biomass_005_SM_Biomass_010) == 0x000460, "Member 'ABP_Biomass_AlienCorridor_C::BP_Biomass_005_SM_Biomass_010' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Biomass_005_SM_Biomass_005) == 0x000468, "Member 'ABP_Biomass_AlienCorridor_C::BP_Biomass_005_SM_Biomass_005' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Biomass_005_DefaultSceneRoot) == 0x000470, "Member 'ABP_Biomass_AlienCorridor_C::BP_Biomass_005_DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Biomass_008_SM_Biomass_008) == 0x000478, "Member 'ABP_Biomass_AlienCorridor_C::BP_Biomass_008_SM_Biomass_008' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, BP_Biomass_008_DefaultSceneRoot) == 0x000480, "Member 'ABP_Biomass_AlienCorridor_C::BP_Biomass_008_DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, MI_Moss_Patch_tjxpndh_2K8_NewDecalComponent) == 0x000488, "Member 'ABP_Biomass_AlienCorridor_C::MI_Moss_Patch_tjxpndh_2K8_NewDecalComponent' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, MI_Moss_Patch_tjxpndh_2K7_NewDecalComponent) == 0x000490, "Member 'ABP_Biomass_AlienCorridor_C::MI_Moss_Patch_tjxpndh_2K7_NewDecalComponent' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, MI_Moss_Patch_tjxpndh_2K6_NewDecalComponent) == 0x000498, "Member 'ABP_Biomass_AlienCorridor_C::MI_Moss_Patch_tjxpndh_2K6_NewDecalComponent' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, MI_Moss_Patch_tjxpndh_2K5_NewDecalComponent) == 0x0004A0, "Member 'ABP_Biomass_AlienCorridor_C::MI_Moss_Patch_tjxpndh_2K5_NewDecalComponent' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, MI_Moss_Patch_tjxpndh_2K4_NewDecalComponent) == 0x0004A8, "Member 'ABP_Biomass_AlienCorridor_C::MI_Moss_Patch_tjxpndh_2K4_NewDecalComponent' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, MI_Moss_Patch_tjxpndh_2K3_NewDecalComponent) == 0x0004B0, "Member 'ABP_Biomass_AlienCorridor_C::MI_Moss_Patch_tjxpndh_2K3_NewDecalComponent' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, MI_Moss_Patch_tjxpndh_2K2_NewDecalComponent) == 0x0004B8, "Member 'ABP_Biomass_AlienCorridor_C::MI_Moss_Patch_tjxpndh_2K2_NewDecalComponent' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, MI_Moss_Patch_tjxpndh_2K_NewDecalComponent) == 0x0004C0, "Member 'ABP_Biomass_AlienCorridor_C::MI_Moss_Patch_tjxpndh_2K_NewDecalComponent' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, MI_Moss_Patch_tjxpndh_2K9_NewDecalComponent) == 0x0004C8, "Member 'ABP_Biomass_AlienCorridor_C::MI_Moss_Patch_tjxpndh_2K9_NewDecalComponent' has a wrong offset!");
static_assert(offsetof(ABP_Biomass_AlienCorridor_C, SharedRoot) == 0x0004D0, "Member 'ABP_Biomass_AlienCorridor_C::SharedRoot' has a wrong offset!");

}

