#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomGameConfig

#include "Basic.hpp"

#include "E_SpawnTimeModifier_structs.hpp"
#include "E_Spawnable_structs.hpp"
#include "E_SpawnAmountModifier_structs.hpp"


namespace SDK::Params
{

// Function BP_CustomGameConfig.BP_CustomGameConfig_C.GetAmountModifier
// 0x0060 (0x0060 - 0x0000)
struct BP_CustomGameConfig_C_GetAmountModifier final
{
public:
	TArray<E_Spawnable>                           Spawnables;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	double                                        MinMultiplier;                                     // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxMultiplier;                                     // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Spawnable                                   Temp_byte_Variable;                                // 0x0020(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Spawnable                                   Temp_byte_Variable_1;                              // 0x0021(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Spawnable                                   Temp_byte_Variable_2;                              // 0x0024(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Spawnable                                   Temp_byte_Variable_3;                              // 0x0025(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_2;             // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_3;             // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Spawnable                                   Temp_byte_Variable_4;                              // 0x002A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Spawnable                                   Temp_byte_Variable_5;                              // 0x002B(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_4;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_5;             // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetAmountMultiplier_MinMultiplier;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetAmountMultiplier_MaxMultiplier;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetAmountMultiplier_MinMultiplier_1;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetAmountMultiplier_MaxMultiplier_1;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetAmountMultiplier_MinMultiplier_2;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetAmountMultiplier_MaxMultiplier_2;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomGameConfig_C_GetAmountModifier) == 0x000008, "Wrong alignment on BP_CustomGameConfig_C_GetAmountModifier");
static_assert(sizeof(BP_CustomGameConfig_C_GetAmountModifier) == 0x000060, "Wrong size on BP_CustomGameConfig_C_GetAmountModifier");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountModifier, Spawnables) == 0x000000, "Member 'BP_CustomGameConfig_C_GetAmountModifier::Spawnables' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountModifier, MinMultiplier) == 0x000010, "Member 'BP_CustomGameConfig_C_GetAmountModifier::MinMultiplier' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountModifier, MaxMultiplier) == 0x000018, "Member 'BP_CustomGameConfig_C_GetAmountModifier::MaxMultiplier' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountModifier, Temp_byte_Variable) == 0x000020, "Member 'BP_CustomGameConfig_C_GetAmountModifier::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountModifier, Temp_byte_Variable_1) == 0x000021, "Member 'BP_CustomGameConfig_C_GetAmountModifier::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountModifier, CallFunc_Array_Contains_ReturnValue) == 0x000022, "Member 'BP_CustomGameConfig_C_GetAmountModifier::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountModifier, CallFunc_Array_Contains_ReturnValue_1) == 0x000023, "Member 'BP_CustomGameConfig_C_GetAmountModifier::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountModifier, Temp_byte_Variable_2) == 0x000024, "Member 'BP_CustomGameConfig_C_GetAmountModifier::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountModifier, Temp_byte_Variable_3) == 0x000025, "Member 'BP_CustomGameConfig_C_GetAmountModifier::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountModifier, CallFunc_Array_Contains_ReturnValue_2) == 0x000026, "Member 'BP_CustomGameConfig_C_GetAmountModifier::CallFunc_Array_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountModifier, CallFunc_Array_Contains_ReturnValue_3) == 0x000027, "Member 'BP_CustomGameConfig_C_GetAmountModifier::CallFunc_Array_Contains_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountModifier, CallFunc_BooleanOR_ReturnValue) == 0x000028, "Member 'BP_CustomGameConfig_C_GetAmountModifier::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountModifier, CallFunc_BooleanOR_ReturnValue_1) == 0x000029, "Member 'BP_CustomGameConfig_C_GetAmountModifier::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountModifier, Temp_byte_Variable_4) == 0x00002A, "Member 'BP_CustomGameConfig_C_GetAmountModifier::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountModifier, Temp_byte_Variable_5) == 0x00002B, "Member 'BP_CustomGameConfig_C_GetAmountModifier::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountModifier, CallFunc_Array_Contains_ReturnValue_4) == 0x00002C, "Member 'BP_CustomGameConfig_C_GetAmountModifier::CallFunc_Array_Contains_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountModifier, CallFunc_Array_Contains_ReturnValue_5) == 0x00002D, "Member 'BP_CustomGameConfig_C_GetAmountModifier::CallFunc_Array_Contains_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountModifier, CallFunc_BooleanOR_ReturnValue_2) == 0x00002E, "Member 'BP_CustomGameConfig_C_GetAmountModifier::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountModifier, CallFunc_GetAmountMultiplier_MinMultiplier) == 0x000030, "Member 'BP_CustomGameConfig_C_GetAmountModifier::CallFunc_GetAmountMultiplier_MinMultiplier' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountModifier, CallFunc_GetAmountMultiplier_MaxMultiplier) == 0x000038, "Member 'BP_CustomGameConfig_C_GetAmountModifier::CallFunc_GetAmountMultiplier_MaxMultiplier' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountModifier, CallFunc_GetAmountMultiplier_MinMultiplier_1) == 0x000040, "Member 'BP_CustomGameConfig_C_GetAmountModifier::CallFunc_GetAmountMultiplier_MinMultiplier_1' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountModifier, CallFunc_GetAmountMultiplier_MaxMultiplier_1) == 0x000048, "Member 'BP_CustomGameConfig_C_GetAmountModifier::CallFunc_GetAmountMultiplier_MaxMultiplier_1' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountModifier, CallFunc_GetAmountMultiplier_MinMultiplier_2) == 0x000050, "Member 'BP_CustomGameConfig_C_GetAmountModifier::CallFunc_GetAmountMultiplier_MinMultiplier_2' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountModifier, CallFunc_GetAmountMultiplier_MaxMultiplier_2) == 0x000058, "Member 'BP_CustomGameConfig_C_GetAmountModifier::CallFunc_GetAmountMultiplier_MaxMultiplier_2' has a wrong offset!");

// Function BP_CustomGameConfig.BP_CustomGameConfig_C.GetAmountMultiplier
// 0x0020 (0x0020 - 0x0000)
struct BP_CustomGameConfig_C_GetAmountMultiplier final
{
public:
	E_SpawnAmountModifier                         Modifier;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MinMultiplier;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxMultiplier;                                     // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomGameConfig_C_GetAmountMultiplier) == 0x000008, "Wrong alignment on BP_CustomGameConfig_C_GetAmountMultiplier");
static_assert(sizeof(BP_CustomGameConfig_C_GetAmountMultiplier) == 0x000020, "Wrong size on BP_CustomGameConfig_C_GetAmountMultiplier");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountMultiplier, Modifier) == 0x000000, "Member 'BP_CustomGameConfig_C_GetAmountMultiplier::Modifier' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountMultiplier, MinMultiplier) == 0x000008, "Member 'BP_CustomGameConfig_C_GetAmountMultiplier::MinMultiplier' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountMultiplier, MaxMultiplier) == 0x000010, "Member 'BP_CustomGameConfig_C_GetAmountMultiplier::MaxMultiplier' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetAmountMultiplier, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'BP_CustomGameConfig_C_GetAmountMultiplier::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_CustomGameConfig.BP_CustomGameConfig_C.GetTimeModifier
// 0x0028 (0x0028 - 0x0000)
struct BP_CustomGameConfig_C_GetTimeModifier final
{
public:
	E_Spawnable                                   Spawnable;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Multiplier;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTimeMultiplier_Multiplier;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomGameConfig_C_GetTimeModifier) == 0x000008, "Wrong alignment on BP_CustomGameConfig_C_GetTimeModifier");
static_assert(sizeof(BP_CustomGameConfig_C_GetTimeModifier) == 0x000028, "Wrong size on BP_CustomGameConfig_C_GetTimeModifier");
static_assert(offsetof(BP_CustomGameConfig_C_GetTimeModifier, Spawnable) == 0x000000, "Member 'BP_CustomGameConfig_C_GetTimeModifier::Spawnable' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetTimeModifier, Multiplier) == 0x000008, "Member 'BP_CustomGameConfig_C_GetTimeModifier::Multiplier' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetTimeModifier, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'BP_CustomGameConfig_C_GetTimeModifier::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetTimeModifier, CallFunc_GetTimeMultiplier_Multiplier) == 0x000018, "Member 'BP_CustomGameConfig_C_GetTimeModifier::CallFunc_GetTimeMultiplier_Multiplier' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetTimeModifier, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000020, "Member 'BP_CustomGameConfig_C_GetTimeModifier::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetTimeModifier, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000021, "Member 'BP_CustomGameConfig_C_GetTimeModifier::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetTimeModifier, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000022, "Member 'BP_CustomGameConfig_C_GetTimeModifier::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetTimeModifier, CallFunc_BooleanOR_ReturnValue) == 0x000023, "Member 'BP_CustomGameConfig_C_GetTimeModifier::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetTimeModifier, CallFunc_BooleanOR_ReturnValue_1) == 0x000024, "Member 'BP_CustomGameConfig_C_GetTimeModifier::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetTimeModifier, CallFunc_BooleanOR_ReturnValue_2) == 0x000025, "Member 'BP_CustomGameConfig_C_GetTimeModifier::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");

// Function BP_CustomGameConfig.BP_CustomGameConfig_C.GetTimeMultiplier
// 0x0018 (0x0018 - 0x0000)
struct BP_CustomGameConfig_C_GetTimeMultiplier final
{
public:
	E_SpawnTimeModifier                           Modifier;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Multiplier;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CustomGameConfig_C_GetTimeMultiplier) == 0x000008, "Wrong alignment on BP_CustomGameConfig_C_GetTimeMultiplier");
static_assert(sizeof(BP_CustomGameConfig_C_GetTimeMultiplier) == 0x000018, "Wrong size on BP_CustomGameConfig_C_GetTimeMultiplier");
static_assert(offsetof(BP_CustomGameConfig_C_GetTimeMultiplier, Modifier) == 0x000000, "Member 'BP_CustomGameConfig_C_GetTimeMultiplier::Modifier' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetTimeMultiplier, Multiplier) == 0x000008, "Member 'BP_CustomGameConfig_C_GetTimeMultiplier::Multiplier' has a wrong offset!");
static_assert(offsetof(BP_CustomGameConfig_C_GetTimeMultiplier, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'BP_CustomGameConfig_C_GetTimeMultiplier::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

