#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CaptureRequest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CaptureRequest.BP_CaptureRequest_C
// 0x0018 (0x02B0 - 0x0298)
class ABP_CaptureRequest_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         CaptureId;                                         // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CaptureRequest(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CaptureRequest_C">();
	}
	static class ABP_CaptureRequest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CaptureRequest_C>();
	}
};
static_assert(alignof(ABP_CaptureRequest_C) == 0x000008, "Wrong alignment on ABP_CaptureRequest_C");
static_assert(sizeof(ABP_CaptureRequest_C) == 0x0002B0, "Wrong size on ABP_CaptureRequest_C");
static_assert(offsetof(ABP_CaptureRequest_C, UberGraphFrame) == 0x000298, "Member 'ABP_CaptureRequest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CaptureRequest_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_CaptureRequest_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_CaptureRequest_C, CaptureId) == 0x0002A8, "Member 'ABP_CaptureRequest_C::CaptureId' has a wrong offset!");

}

