#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Cameroid

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "S_CameroidCapture_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "S_ScoringComboItem_structs.hpp"
#include "UE5Coro_structs.hpp"
#include "S_ScoringCombo_structs.hpp"


namespace SDK::Params
{

// Function BP_Cameroid.BP_Cameroid_C.GetCurrentCameraView
// 0x0F80 (0x0F80 - 0x0000)
struct BP_Cameroid_C_GetCurrentCameraView final
{
public:
	struct FMinimalViewInfo                       View;                                              // 0x0000(0x07C0)(Parm, OutParm)
	struct FMinimalViewInfo                       CallFunc_GetCameraView_DesiredView;                // 0x07C0(0x07C0)()
};
static_assert(alignof(BP_Cameroid_C_GetCurrentCameraView) == 0x000010, "Wrong alignment on BP_Cameroid_C_GetCurrentCameraView");
static_assert(sizeof(BP_Cameroid_C_GetCurrentCameraView) == 0x000F80, "Wrong size on BP_Cameroid_C_GetCurrentCameraView");
static_assert(offsetof(BP_Cameroid_C_GetCurrentCameraView, View) == 0x000000, "Member 'BP_Cameroid_C_GetCurrentCameraView::View' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_GetCurrentCameraView, CallFunc_GetCameraView_DesiredView) == 0x0007C0, "Member 'BP_Cameroid_C_GetCurrentCameraView::CallFunc_GetCameraView_DesiredView' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.GetCaptureRatio
// 0x0020 (0x0020 - 0x0000)
struct BP_Cameroid_C_GetCaptureRatio final
{
public:
	double                                        Ratio;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_GetCaptureRatio) == 0x000008, "Wrong alignment on BP_Cameroid_C_GetCaptureRatio");
static_assert(sizeof(BP_Cameroid_C_GetCaptureRatio) == 0x000020, "Wrong size on BP_Cameroid_C_GetCaptureRatio");
static_assert(offsetof(BP_Cameroid_C_GetCaptureRatio, Ratio) == 0x000000, "Member 'BP_Cameroid_C_GetCaptureRatio::Ratio' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_GetCaptureRatio, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'BP_Cameroid_C_GetCaptureRatio::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_GetCaptureRatio, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000010, "Member 'BP_Cameroid_C_GetCaptureRatio::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_GetCaptureRatio, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_Cameroid_C_GetCaptureRatio::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.SetPostProcessBloom
// 0x0028 (0x0028 - 0x0000)
struct BP_Cameroid_C_SetPostProcessBloom final
{
public:
	double                                        BloomIntensity;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_SetFieldsInStruct_BloomIntensity_ImplicitCast; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_SetPostProcessBloom) == 0x000008, "Wrong alignment on BP_Cameroid_C_SetPostProcessBloom");
static_assert(sizeof(BP_Cameroid_C_SetPostProcessBloom) == 0x000028, "Wrong size on BP_Cameroid_C_SetPostProcessBloom");
static_assert(offsetof(BP_Cameroid_C_SetPostProcessBloom, BloomIntensity) == 0x000000, "Member 'BP_Cameroid_C_SetPostProcessBloom::BloomIntensity' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_SetPostProcessBloom, CallFunc_BreakVector2D_X) == 0x000008, "Member 'BP_Cameroid_C_SetPostProcessBloom::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_SetPostProcessBloom, CallFunc_BreakVector2D_Y) == 0x000010, "Member 'BP_Cameroid_C_SetPostProcessBloom::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_SetPostProcessBloom, CallFunc_Lerp_ReturnValue) == 0x000018, "Member 'BP_Cameroid_C_SetPostProcessBloom::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_SetPostProcessBloom, K2Node_SetFieldsInStruct_BloomIntensity_ImplicitCast) == 0x000020, "Member 'BP_Cameroid_C_SetPostProcessBloom::K2Node_SetFieldsInStruct_BloomIntensity_ImplicitCast' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.SetPostProcessBlur
// 0x0018 (0x0018 - 0x0000)
struct BP_Cameroid_C_SetPostProcessBlur final
{
public:
	double                                        BlurRadius;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_SetPostProcessBlur) == 0x000008, "Wrong alignment on BP_Cameroid_C_SetPostProcessBlur");
static_assert(sizeof(BP_Cameroid_C_SetPostProcessBlur) == 0x000018, "Wrong size on BP_Cameroid_C_SetPostProcessBlur");
static_assert(offsetof(BP_Cameroid_C_SetPostProcessBlur, BlurRadius) == 0x000000, "Member 'BP_Cameroid_C_SetPostProcessBlur::BlurRadius' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_SetPostProcessBlur, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'BP_Cameroid_C_SetPostProcessBlur::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_SetPostProcessBlur, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000010, "Member 'BP_Cameroid_C_SetPostProcessBlur::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.SetPostProcessMaterials
// 0x0020 (0x0020 - 0x0000)
struct BP_Cameroid_C_SetPostProcessMaterials final
{
public:
	TArray<struct FWeightedBlendable>             Materials;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FWeightedBlendables                    K2Node_MakeStruct_WeightedBlendables;              // 0x0010(0x0010)()
};
static_assert(alignof(BP_Cameroid_C_SetPostProcessMaterials) == 0x000008, "Wrong alignment on BP_Cameroid_C_SetPostProcessMaterials");
static_assert(sizeof(BP_Cameroid_C_SetPostProcessMaterials) == 0x000020, "Wrong size on BP_Cameroid_C_SetPostProcessMaterials");
static_assert(offsetof(BP_Cameroid_C_SetPostProcessMaterials, Materials) == 0x000000, "Member 'BP_Cameroid_C_SetPostProcessMaterials::Materials' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_SetPostProcessMaterials, K2Node_MakeStruct_WeightedBlendables) == 0x000010, "Member 'BP_Cameroid_C_SetPostProcessMaterials::K2Node_MakeStruct_WeightedBlendables' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.InitPostProcessMaterials
// 0x0028 (0x0028 - 0x0000)
struct BP_Cameroid_C_InitPostProcessMaterials final
{
public:
	struct FWeightedBlendable                     K2Node_MakeStruct_WeightedBlendable;               // 0x0000(0x0010)(NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FWeightedBlendable>             K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_Cameroid_C_InitPostProcessMaterials) == 0x000008, "Wrong alignment on BP_Cameroid_C_InitPostProcessMaterials");
static_assert(sizeof(BP_Cameroid_C_InitPostProcessMaterials) == 0x000028, "Wrong size on BP_Cameroid_C_InitPostProcessMaterials");
static_assert(offsetof(BP_Cameroid_C_InitPostProcessMaterials, K2Node_MakeStruct_WeightedBlendable) == 0x000000, "Member 'BP_Cameroid_C_InitPostProcessMaterials::K2Node_MakeStruct_WeightedBlendable' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_InitPostProcessMaterials, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'BP_Cameroid_C_InitPostProcessMaterials::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_InitPostProcessMaterials, K2Node_MakeArray_Array) == 0x000018, "Member 'BP_Cameroid_C_InitPostProcessMaterials::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.ComputeMotionValue
// 0x0038 (0x0038 - 0x0000)
struct BP_Cameroid_C_ComputeMotionValue final
{
public:
	double                                        TargetValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DeltaSeconds;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_ComputeMotionValue) == 0x000008, "Wrong alignment on BP_Cameroid_C_ComputeMotionValue");
static_assert(sizeof(BP_Cameroid_C_ComputeMotionValue) == 0x000038, "Wrong size on BP_Cameroid_C_ComputeMotionValue");
static_assert(offsetof(BP_Cameroid_C_ComputeMotionValue, TargetValue) == 0x000000, "Member 'BP_Cameroid_C_ComputeMotionValue::TargetValue' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_ComputeMotionValue, DeltaSeconds) == 0x000008, "Member 'BP_Cameroid_C_ComputeMotionValue::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_ComputeMotionValue, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_Cameroid_C_ComputeMotionValue::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_ComputeMotionValue, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_Cameroid_C_ComputeMotionValue::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_ComputeMotionValue, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_Cameroid_C_ComputeMotionValue::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_ComputeMotionValue, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_Cameroid_C_ComputeMotionValue::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_ComputeMotionValue, CallFunc_FClamp_ReturnValue) == 0x000030, "Member 'BP_Cameroid_C_ComputeMotionValue::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.GetCameraAngularSpeed
// 0x00B0 (0x00B0 - 0x0000)
struct BP_Cameroid_C_GetCameraAngularSpeed final
{
public:
	double                                        DeltaSeconds;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AngularSpeed;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               _DeltaRotator;                                     // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               _CurrentCameraRotation;                            // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue_1;                        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Abs_A_ImplicitCast;                       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_A_ImplicitCast_1;                     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_GetCameraAngularSpeed) == 0x000008, "Wrong alignment on BP_Cameroid_C_GetCameraAngularSpeed");
static_assert(sizeof(BP_Cameroid_C_GetCameraAngularSpeed) == 0x0000B0, "Wrong size on BP_Cameroid_C_GetCameraAngularSpeed");
static_assert(offsetof(BP_Cameroid_C_GetCameraAngularSpeed, DeltaSeconds) == 0x000000, "Member 'BP_Cameroid_C_GetCameraAngularSpeed::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_GetCameraAngularSpeed, AngularSpeed) == 0x000008, "Member 'BP_Cameroid_C_GetCameraAngularSpeed::AngularSpeed' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_GetCameraAngularSpeed, _DeltaRotator) == 0x000010, "Member 'BP_Cameroid_C_GetCameraAngularSpeed::_DeltaRotator' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_GetCameraAngularSpeed, _CurrentCameraRotation) == 0x000028, "Member 'BP_Cameroid_C_GetCameraAngularSpeed::_CurrentCameraRotation' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_GetCameraAngularSpeed, CallFunc_BreakRotator_Roll) == 0x000040, "Member 'BP_Cameroid_C_GetCameraAngularSpeed::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_GetCameraAngularSpeed, CallFunc_BreakRotator_Pitch) == 0x000044, "Member 'BP_Cameroid_C_GetCameraAngularSpeed::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_GetCameraAngularSpeed, CallFunc_BreakRotator_Yaw) == 0x000048, "Member 'BP_Cameroid_C_GetCameraAngularSpeed::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_GetCameraAngularSpeed, CallFunc_Abs_ReturnValue) == 0x000050, "Member 'BP_Cameroid_C_GetCameraAngularSpeed::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_GetCameraAngularSpeed, CallFunc_Abs_ReturnValue_1) == 0x000058, "Member 'BP_Cameroid_C_GetCameraAngularSpeed::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_GetCameraAngularSpeed, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000060, "Member 'BP_Cameroid_C_GetCameraAngularSpeed::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_GetCameraAngularSpeed, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000068, "Member 'BP_Cameroid_C_GetCameraAngularSpeed::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_GetCameraAngularSpeed, CallFunc_NormalizedDeltaRotator_ReturnValue) == 0x000070, "Member 'BP_Cameroid_C_GetCameraAngularSpeed::CallFunc_NormalizedDeltaRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_GetCameraAngularSpeed, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000088, "Member 'BP_Cameroid_C_GetCameraAngularSpeed::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_GetCameraAngularSpeed, CallFunc_Abs_A_ImplicitCast) == 0x0000A0, "Member 'BP_Cameroid_C_GetCameraAngularSpeed::CallFunc_Abs_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_GetCameraAngularSpeed, CallFunc_Abs_A_ImplicitCast_1) == 0x0000A8, "Member 'BP_Cameroid_C_GetCameraAngularSpeed::CallFunc_Abs_A_ImplicitCast_1' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.SetFocusDistance
// 0x0004 (0x0004 - 0x0000)
struct BP_Cameroid_C_SetFocusDistance final
{
public:
	float                                         DepthOfFieldFocalDistance;                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_SetFocusDistance) == 0x000004, "Wrong alignment on BP_Cameroid_C_SetFocusDistance");
static_assert(sizeof(BP_Cameroid_C_SetFocusDistance) == 0x000004, "Wrong size on BP_Cameroid_C_SetFocusDistance");
static_assert(offsetof(BP_Cameroid_C_SetFocusDistance, DepthOfFieldFocalDistance) == 0x000000, "Member 'BP_Cameroid_C_SetFocusDistance::DepthOfFieldFocalDistance' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.CreateSaveObject
// 0x0010 (0x0010 - 0x0000)
struct BP_Cameroid_C_CreateSaveObject final
{
public:
	class USaveGame*                              Save;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              CallFunc_CreateSave_Save;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_CreateSaveObject) == 0x000008, "Wrong alignment on BP_Cameroid_C_CreateSaveObject");
static_assert(sizeof(BP_Cameroid_C_CreateSaveObject) == 0x000010, "Wrong size on BP_Cameroid_C_CreateSaveObject");
static_assert(offsetof(BP_Cameroid_C_CreateSaveObject, Save) == 0x000000, "Member 'BP_Cameroid_C_CreateSaveObject::Save' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_CreateSaveObject, CallFunc_CreateSave_Save) == 0x000008, "Member 'BP_Cameroid_C_CreateSaveObject::CallFunc_CreateSave_Save' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.GetDataIO
// 0x0018 (0x0018 - 0x0000)
struct BP_Cameroid_C_GetDataIO final
{
public:
	class ABP_DataIO_C*                           DataIO_0;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_DataIO_C*                           CallFunc_GetActorOfClass_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_GetDataIO) == 0x000008, "Wrong alignment on BP_Cameroid_C_GetDataIO");
static_assert(sizeof(BP_Cameroid_C_GetDataIO) == 0x000018, "Wrong size on BP_Cameroid_C_GetDataIO");
static_assert(offsetof(BP_Cameroid_C_GetDataIO, DataIO_0) == 0x000000, "Member 'BP_Cameroid_C_GetDataIO::DataIO_0' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_GetDataIO, CallFunc_GetActorOfClass_ReturnValue) == 0x000008, "Member 'BP_Cameroid_C_GetDataIO::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_GetDataIO, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_Cameroid_C_GetDataIO::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.GetScoring
// 0x0018 (0x0018 - 0x0000)
struct BP_Cameroid_C_GetScoring final
{
public:
	class ABP_Scoring_C*                          Scoring_0;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Scoring_C*                          CallFunc_GetActorOfClass_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_GetScoring) == 0x000008, "Wrong alignment on BP_Cameroid_C_GetScoring");
static_assert(sizeof(BP_Cameroid_C_GetScoring) == 0x000018, "Wrong size on BP_Cameroid_C_GetScoring");
static_assert(offsetof(BP_Cameroid_C_GetScoring, Scoring_0) == 0x000000, "Member 'BP_Cameroid_C_GetScoring::Scoring_0' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_GetScoring, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_Cameroid_C_GetScoring::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_GetScoring, CallFunc_GetActorOfClass_ReturnValue) == 0x000010, "Member 'BP_Cameroid_C_GetScoring::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.InpActEvt_IA_CameroidZoomIn_K2Node_EnhancedInputActionEvent_3
// 0x0030 (0x0030 - 0x0000)
struct BP_Cameroid_C_InpActEvt_IA_CameroidZoomIn_K2Node_EnhancedInputActionEvent_3 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_InpActEvt_IA_CameroidZoomIn_K2Node_EnhancedInputActionEvent_3) == 0x000008, "Wrong alignment on BP_Cameroid_C_InpActEvt_IA_CameroidZoomIn_K2Node_EnhancedInputActionEvent_3");
static_assert(sizeof(BP_Cameroid_C_InpActEvt_IA_CameroidZoomIn_K2Node_EnhancedInputActionEvent_3) == 0x000030, "Wrong size on BP_Cameroid_C_InpActEvt_IA_CameroidZoomIn_K2Node_EnhancedInputActionEvent_3");
static_assert(offsetof(BP_Cameroid_C_InpActEvt_IA_CameroidZoomIn_K2Node_EnhancedInputActionEvent_3, ActionValue) == 0x000000, "Member 'BP_Cameroid_C_InpActEvt_IA_CameroidZoomIn_K2Node_EnhancedInputActionEvent_3::ActionValue' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_InpActEvt_IA_CameroidZoomIn_K2Node_EnhancedInputActionEvent_3, ElapsedTime) == 0x000020, "Member 'BP_Cameroid_C_InpActEvt_IA_CameroidZoomIn_K2Node_EnhancedInputActionEvent_3::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_InpActEvt_IA_CameroidZoomIn_K2Node_EnhancedInputActionEvent_3, TriggeredTime) == 0x000024, "Member 'BP_Cameroid_C_InpActEvt_IA_CameroidZoomIn_K2Node_EnhancedInputActionEvent_3::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_InpActEvt_IA_CameroidZoomIn_K2Node_EnhancedInputActionEvent_3, SourceAction) == 0x000028, "Member 'BP_Cameroid_C_InpActEvt_IA_CameroidZoomIn_K2Node_EnhancedInputActionEvent_3::SourceAction' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.InpActEvt_IA_CameroidZoomOut_K2Node_EnhancedInputActionEvent_2
// 0x0030 (0x0030 - 0x0000)
struct BP_Cameroid_C_InpActEvt_IA_CameroidZoomOut_K2Node_EnhancedInputActionEvent_2 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_InpActEvt_IA_CameroidZoomOut_K2Node_EnhancedInputActionEvent_2) == 0x000008, "Wrong alignment on BP_Cameroid_C_InpActEvt_IA_CameroidZoomOut_K2Node_EnhancedInputActionEvent_2");
static_assert(sizeof(BP_Cameroid_C_InpActEvt_IA_CameroidZoomOut_K2Node_EnhancedInputActionEvent_2) == 0x000030, "Wrong size on BP_Cameroid_C_InpActEvt_IA_CameroidZoomOut_K2Node_EnhancedInputActionEvent_2");
static_assert(offsetof(BP_Cameroid_C_InpActEvt_IA_CameroidZoomOut_K2Node_EnhancedInputActionEvent_2, ActionValue) == 0x000000, "Member 'BP_Cameroid_C_InpActEvt_IA_CameroidZoomOut_K2Node_EnhancedInputActionEvent_2::ActionValue' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_InpActEvt_IA_CameroidZoomOut_K2Node_EnhancedInputActionEvent_2, ElapsedTime) == 0x000020, "Member 'BP_Cameroid_C_InpActEvt_IA_CameroidZoomOut_K2Node_EnhancedInputActionEvent_2::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_InpActEvt_IA_CameroidZoomOut_K2Node_EnhancedInputActionEvent_2, TriggeredTime) == 0x000024, "Member 'BP_Cameroid_C_InpActEvt_IA_CameroidZoomOut_K2Node_EnhancedInputActionEvent_2::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_InpActEvt_IA_CameroidZoomOut_K2Node_EnhancedInputActionEvent_2, SourceAction) == 0x000028, "Member 'BP_Cameroid_C_InpActEvt_IA_CameroidZoomOut_K2Node_EnhancedInputActionEvent_2::SourceAction' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.InpActEvt_IA_CameroidCapture_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct BP_Cameroid_C_InpActEvt_IA_CameroidCapture_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_InpActEvt_IA_CameroidCapture_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on BP_Cameroid_C_InpActEvt_IA_CameroidCapture_K2Node_EnhancedInputActionEvent_1");
static_assert(sizeof(BP_Cameroid_C_InpActEvt_IA_CameroidCapture_K2Node_EnhancedInputActionEvent_1) == 0x000030, "Wrong size on BP_Cameroid_C_InpActEvt_IA_CameroidCapture_K2Node_EnhancedInputActionEvent_1");
static_assert(offsetof(BP_Cameroid_C_InpActEvt_IA_CameroidCapture_K2Node_EnhancedInputActionEvent_1, ActionValue) == 0x000000, "Member 'BP_Cameroid_C_InpActEvt_IA_CameroidCapture_K2Node_EnhancedInputActionEvent_1::ActionValue' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_InpActEvt_IA_CameroidCapture_K2Node_EnhancedInputActionEvent_1, ElapsedTime) == 0x000020, "Member 'BP_Cameroid_C_InpActEvt_IA_CameroidCapture_K2Node_EnhancedInputActionEvent_1::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_InpActEvt_IA_CameroidCapture_K2Node_EnhancedInputActionEvent_1, TriggeredTime) == 0x000024, "Member 'BP_Cameroid_C_InpActEvt_IA_CameroidCapture_K2Node_EnhancedInputActionEvent_1::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_InpActEvt_IA_CameroidCapture_K2Node_EnhancedInputActionEvent_1, SourceAction) == 0x000028, "Member 'BP_Cameroid_C_InpActEvt_IA_CameroidCapture_K2Node_EnhancedInputActionEvent_1::SourceAction' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.InpActEvt_IA_CameroidSelfie_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct BP_Cameroid_C_InpActEvt_IA_CameroidSelfie_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_InpActEvt_IA_CameroidSelfie_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on BP_Cameroid_C_InpActEvt_IA_CameroidSelfie_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(BP_Cameroid_C_InpActEvt_IA_CameroidSelfie_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on BP_Cameroid_C_InpActEvt_IA_CameroidSelfie_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(BP_Cameroid_C_InpActEvt_IA_CameroidSelfie_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'BP_Cameroid_C_InpActEvt_IA_CameroidSelfie_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_InpActEvt_IA_CameroidSelfie_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'BP_Cameroid_C_InpActEvt_IA_CameroidSelfie_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_InpActEvt_IA_CameroidSelfie_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'BP_Cameroid_C_InpActEvt_IA_CameroidSelfie_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_InpActEvt_IA_CameroidSelfie_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'BP_Cameroid_C_InpActEvt_IA_CameroidSelfie_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.CheckCaptureAchievements
// 0x0040 (0x0040 - 0x0000)
struct BP_Cameroid_C_CheckCaptureAchievements final
{
public:
	struct FS_CameroidCapture                     Capture;                                           // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_CheckCaptureAchievements) == 0x000008, "Wrong alignment on BP_Cameroid_C_CheckCaptureAchievements");
static_assert(sizeof(BP_Cameroid_C_CheckCaptureAchievements) == 0x000040, "Wrong size on BP_Cameroid_C_CheckCaptureAchievements");
static_assert(offsetof(BP_Cameroid_C_CheckCaptureAchievements, Capture) == 0x000000, "Member 'BP_Cameroid_C_CheckCaptureAchievements::Capture' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.CheckPointsAchievements
// 0x0040 (0x0040 - 0x0000)
struct BP_Cameroid_C_CheckPointsAchievements final
{
public:
	struct FS_CameroidCapture                     Capture;                                           // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_CheckPointsAchievements) == 0x000008, "Wrong alignment on BP_Cameroid_C_CheckPointsAchievements");
static_assert(sizeof(BP_Cameroid_C_CheckPointsAchievements) == 0x000040, "Wrong size on BP_Cameroid_C_CheckPointsAchievements");
static_assert(offsetof(BP_Cameroid_C_CheckPointsAchievements, Capture) == 0x000000, "Member 'BP_Cameroid_C_CheckPointsAchievements::Capture' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.CheckCloseEncountersAchievement
// 0x0040 (0x0040 - 0x0000)
struct BP_Cameroid_C_CheckCloseEncountersAchievement final
{
public:
	struct FS_CameroidCapture                     Capture;                                           // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_CheckCloseEncountersAchievement) == 0x000008, "Wrong alignment on BP_Cameroid_C_CheckCloseEncountersAchievement");
static_assert(sizeof(BP_Cameroid_C_CheckCloseEncountersAchievement) == 0x000040, "Wrong size on BP_Cameroid_C_CheckCloseEncountersAchievement");
static_assert(offsetof(BP_Cameroid_C_CheckCloseEncountersAchievement, Capture) == 0x000000, "Member 'BP_Cameroid_C_CheckCloseEncountersAchievement::Capture' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.CheckWorthyTragedyAchievement
// 0x0040 (0x0040 - 0x0000)
struct BP_Cameroid_C_CheckWorthyTragedyAchievement final
{
public:
	struct FS_CameroidCapture                     Capture;                                           // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_CheckWorthyTragedyAchievement) == 0x000008, "Wrong alignment on BP_Cameroid_C_CheckWorthyTragedyAchievement");
static_assert(sizeof(BP_Cameroid_C_CheckWorthyTragedyAchievement) == 0x000040, "Wrong size on BP_Cameroid_C_CheckWorthyTragedyAchievement");
static_assert(offsetof(BP_Cameroid_C_CheckWorthyTragedyAchievement, Capture) == 0x000000, "Member 'BP_Cameroid_C_CheckWorthyTragedyAchievement::Capture' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.CheckWarCorrespondentAchievement
// 0x0040 (0x0040 - 0x0000)
struct BP_Cameroid_C_CheckWarCorrespondentAchievement final
{
public:
	struct FS_CameroidCapture                     Capture;                                           // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_CheckWarCorrespondentAchievement) == 0x000008, "Wrong alignment on BP_Cameroid_C_CheckWarCorrespondentAchievement");
static_assert(sizeof(BP_Cameroid_C_CheckWarCorrespondentAchievement) == 0x000040, "Wrong size on BP_Cameroid_C_CheckWarCorrespondentAchievement");
static_assert(offsetof(BP_Cameroid_C_CheckWarCorrespondentAchievement, Capture) == 0x000000, "Member 'BP_Cameroid_C_CheckWarCorrespondentAchievement::Capture' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.CheckDavidVsGoliathAchievement
// 0x0040 (0x0040 - 0x0000)
struct BP_Cameroid_C_CheckDavidVsGoliathAchievement final
{
public:
	struct FS_CameroidCapture                     Capture;                                           // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_CheckDavidVsGoliathAchievement) == 0x000008, "Wrong alignment on BP_Cameroid_C_CheckDavidVsGoliathAchievement");
static_assert(sizeof(BP_Cameroid_C_CheckDavidVsGoliathAchievement) == 0x000040, "Wrong size on BP_Cameroid_C_CheckDavidVsGoliathAchievement");
static_assert(offsetof(BP_Cameroid_C_CheckDavidVsGoliathAchievement, Capture) == 0x000000, "Member 'BP_Cameroid_C_CheckDavidVsGoliathAchievement::Capture' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.CaptureTaken
// 0x0040 (0x0040 - 0x0000)
struct BP_Cameroid_C_CaptureTaken final
{
public:
	struct FS_CameroidCapture                     Capture;                                           // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_CaptureTaken) == 0x000008, "Wrong alignment on BP_Cameroid_C_CaptureTaken");
static_assert(sizeof(BP_Cameroid_C_CaptureTaken) == 0x000040, "Wrong size on BP_Cameroid_C_CaptureTaken");
static_assert(offsetof(BP_Cameroid_C_CaptureTaken, Capture) == 0x000000, "Member 'BP_Cameroid_C_CaptureTaken::Capture' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Cameroid_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Cameroid_C_ReceiveTick");
static_assert(sizeof(BP_Cameroid_C_ReceiveTick) == 0x000004, "Wrong size on BP_Cameroid_C_ReceiveTick");
static_assert(offsetof(BP_Cameroid_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Cameroid_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.LoadSaveData
// 0x0008 (0x0008 - 0x0000)
struct BP_Cameroid_C_LoadSaveData final
{
public:
	class USaveGame*                              Save;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_LoadSaveData) == 0x000008, "Wrong alignment on BP_Cameroid_C_LoadSaveData");
static_assert(sizeof(BP_Cameroid_C_LoadSaveData) == 0x000008, "Wrong size on BP_Cameroid_C_LoadSaveData");
static_assert(offsetof(BP_Cameroid_C_LoadSaveData, Save) == 0x000000, "Member 'BP_Cameroid_C_LoadSaveData::Save' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.UpdatePostProcess
// 0x0008 (0x0008 - 0x0000)
struct BP_Cameroid_C_UpdatePostProcess final
{
public:
	double                                        DeltaSeconds;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_UpdatePostProcess) == 0x000008, "Wrong alignment on BP_Cameroid_C_UpdatePostProcess");
static_assert(sizeof(BP_Cameroid_C_UpdatePostProcess) == 0x000008, "Wrong size on BP_Cameroid_C_UpdatePostProcess");
static_assert(offsetof(BP_Cameroid_C_UpdatePostProcess, DeltaSeconds) == 0x000000, "Member 'BP_Cameroid_C_UpdatePostProcess::DeltaSeconds' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.UpdateInputMapping
// 0x0001 (0x0001 - 0x0000)
struct BP_Cameroid_C_UpdateInputMapping final
{
public:
	bool                                          ForceDisable;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_UpdateInputMapping) == 0x000001, "Wrong alignment on BP_Cameroid_C_UpdateInputMapping");
static_assert(sizeof(BP_Cameroid_C_UpdateInputMapping) == 0x000001, "Wrong size on BP_Cameroid_C_UpdateInputMapping");
static_assert(offsetof(BP_Cameroid_C_UpdateInputMapping, ForceDisable) == 0x000000, "Member 'BP_Cameroid_C_UpdateInputMapping::ForceDisable' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Cameroid_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_Cameroid_C_ReceiveEndPlay");
static_assert(sizeof(BP_Cameroid_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_Cameroid_C_ReceiveEndPlay");
static_assert(offsetof(BP_Cameroid_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_Cameroid_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.UpdateZoomFov
// 0x0008 (0x0008 - 0x0000)
struct BP_Cameroid_C_UpdateZoomFov final
{
public:
	double                                        FOV;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_UpdateZoomFov) == 0x000008, "Wrong alignment on BP_Cameroid_C_UpdateZoomFov");
static_assert(sizeof(BP_Cameroid_C_UpdateZoomFov) == 0x000008, "Wrong size on BP_Cameroid_C_UpdateZoomFov");
static_assert(offsetof(BP_Cameroid_C_UpdateZoomFov, FOV) == 0x000000, "Member 'BP_Cameroid_C_UpdateZoomFov::FOV' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.StartCaptureVFX
// 0x0008 (0x0008 - 0x0000)
struct BP_Cameroid_C_StartCaptureVFX final
{
public:
	class ABP_Cameroid_C*                         Cameroid;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_StartCaptureVFX) == 0x000008, "Wrong alignment on BP_Cameroid_C_StartCaptureVFX");
static_assert(sizeof(BP_Cameroid_C_StartCaptureVFX) == 0x000008, "Wrong size on BP_Cameroid_C_StartCaptureVFX");
static_assert(offsetof(BP_Cameroid_C_StartCaptureVFX, Cameroid) == 0x000000, "Member 'BP_Cameroid_C_StartCaptureVFX::Cameroid' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.OverridePlayerFov
// 0x0008 (0x0008 - 0x0000)
struct BP_Cameroid_C_OverridePlayerFov final
{
public:
	double                                        FOV;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_OverridePlayerFov) == 0x000008, "Wrong alignment on BP_Cameroid_C_OverridePlayerFov");
static_assert(sizeof(BP_Cameroid_C_OverridePlayerFov) == 0x000008, "Wrong size on BP_Cameroid_C_OverridePlayerFov");
static_assert(offsetof(BP_Cameroid_C_OverridePlayerFov, FOV) == 0x000000, "Member 'BP_Cameroid_C_OverridePlayerFov::FOV' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.UpdateSelfieCameraRotationLimits
// 0x0001 (0x0001 - 0x0000)
struct BP_Cameroid_C_UpdateSelfieCameraRotationLimits final
{
public:
	bool                                          LimitsEnabled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_UpdateSelfieCameraRotationLimits) == 0x000001, "Wrong alignment on BP_Cameroid_C_UpdateSelfieCameraRotationLimits");
static_assert(sizeof(BP_Cameroid_C_UpdateSelfieCameraRotationLimits) == 0x000001, "Wrong size on BP_Cameroid_C_UpdateSelfieCameraRotationLimits");
static_assert(offsetof(BP_Cameroid_C_UpdateSelfieCameraRotationLimits, LimitsEnabled) == 0x000000, "Member 'BP_Cameroid_C_UpdateSelfieCameraRotationLimits::LimitsEnabled' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.CameroidCapture (Client)
// 0x0004 (0x0004 - 0x0000)
struct BP_Cameroid_C_CameroidCapture__Client_ final
{
public:
	int32                                         CaptureId;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_CameroidCapture__Client_) == 0x000004, "Wrong alignment on BP_Cameroid_C_CameroidCapture__Client_");
static_assert(sizeof(BP_Cameroid_C_CameroidCapture__Client_) == 0x000004, "Wrong size on BP_Cameroid_C_CameroidCapture__Client_");
static_assert(offsetof(BP_Cameroid_C_CameroidCapture__Client_, CaptureId) == 0x000000, "Member 'BP_Cameroid_C_CameroidCapture__Client_::CaptureId' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.RegisterCapture (Server)
// 0x0048 (0x0048 - 0x0000)
struct BP_Cameroid_C_RegisterCapture__Server_ final
{
public:
	struct FS_CameroidCapture                     Capture;                                           // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	int32                                         DataLength;                                        // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cameroid_C_RegisterCapture__Server_) == 0x000008, "Wrong alignment on BP_Cameroid_C_RegisterCapture__Server_");
static_assert(sizeof(BP_Cameroid_C_RegisterCapture__Server_) == 0x000048, "Wrong size on BP_Cameroid_C_RegisterCapture__Server_");
static_assert(offsetof(BP_Cameroid_C_RegisterCapture__Server_, Capture) == 0x000000, "Member 'BP_Cameroid_C_RegisterCapture__Server_::Capture' has a wrong offset!");
static_assert(offsetof(BP_Cameroid_C_RegisterCapture__Server_, DataLength) == 0x000040, "Member 'BP_Cameroid_C_RegisterCapture__Server_::DataLength' has a wrong offset!");

// Function BP_Cameroid.BP_Cameroid_C.ExecuteUbergraph_BP_Cameroid
// 0x1380 (0x1380 - 0x0000)
struct BP_Cameroid_C_ExecuteUbergraph_BP_Cameroid final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_CameroidCapture                     K2Node_CustomEvent_Capture_6;                      // 0x0008(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_3;        // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_4;        // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_5;        // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_CameroidCapture                     K2Node_CustomEvent_Capture_7;                      // 0x0050(0x0040)(HasGetValueTypeHash)
	TDelegate<void(const struct FS_CameroidCapture& Capture)> K2Node_CreateDelegate_OutputDelegate;  // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_CameroidCapture                     K2Node_CustomEvent_Capture_5;                      // 0x00A0(0x0040)(HasGetValueTypeHash)
	class ABP_Scoring_C*                          CallFunc_GetScoring_Scoring;                       // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_ScoringComboItem                    K2Node_MakeStruct_S_ScoringComboItem;              // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_ScoringComboItem>            K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm)
	struct FS_ScoringCombo                        K2Node_MakeStruct_S_ScoringCombo;                  // 0x0100(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_ContainsCombo_Result;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_CameroidCapture                     K2Node_CustomEvent_Capture_4;                      // 0x0118(0x0040)(HasGetValueTypeHash)
	class ABP_Scoring_C*                          CallFunc_GetScoring_Scoring_1;                     // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_ScoringComboItem                    K2Node_MakeStruct_S_ScoringComboItem_1;            // 0x0161(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_ScoringComboItem>            K2Node_MakeArray_Array_1;                          // 0x0168(0x0010)(ReferenceParm)
	struct FS_ScoringCombo                        K2Node_MakeStruct_S_ScoringCombo_1;                // 0x0178(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_ContainsCombo_Result_1;                   // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_CameroidCapture                     K2Node_CustomEvent_Capture_3;                      // 0x0190(0x0040)(HasGetValueTypeHash)
	class ABP_Scoring_C*                          CallFunc_GetScoring_Scoring_2;                     // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_ScoringComboItem                    K2Node_MakeStruct_S_ScoringComboItem_2;            // 0x01DA(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DE[0x2];                                      // 0x01DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_ScoringComboItem>            K2Node_MakeArray_Array_2;                          // 0x01E0(0x0010)(ReferenceParm)
	struct FS_CameroidCapture                     K2Node_CustomEvent_Capture_2;                      // 0x01F0(0x0040)(HasGetValueTypeHash)
	struct FS_ScoringCombo                        K2Node_MakeStruct_S_ScoringCombo_2;                // 0x0230(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_ContainsCombo_Result_2;                   // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Scoring_C*                          CallFunc_GetScoring_Scoring_3;                     // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_ScoringComboItem                    K2Node_MakeStruct_S_ScoringComboItem_3;            // 0x0251(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_ScoringComboItem>            K2Node_MakeArray_Array_3;                          // 0x0258(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_ScoringCombo                        K2Node_MakeStruct_S_ScoringCombo_3;                // 0x0270(0x0010)(HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsCombo_Result_3;                   // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_CameroidCapture                     K2Node_CustomEvent_Capture_1;                      // 0x0290(0x0040)(ConstParm, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance;           // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DataIO_C*                           CallFunc_GetDataIO_DataIO;                         // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              K2Node_Event_Save;                                 // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
