#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DelayedSpawn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_Spawnable_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DelayedSpawn.BP_DelayedSpawn_C
// 0x0028 (0x02C0 - 0x0298)
class ABP_DelayedSpawn_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_UPGameSession_C*                    GameSession;                                       // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	E_Spawnable                                   Spawnable;                                         // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Delay;                                             // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_DelayedSpawn(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DelayedSpawn_C">();
	}
	static class ABP_DelayedSpawn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DelayedSpawn_C>();
	}
};
static_assert(alignof(ABP_DelayedSpawn_C) == 0x000008, "Wrong alignment on ABP_DelayedSpawn_C");
static_assert(sizeof(ABP_DelayedSpawn_C) == 0x0002C0, "Wrong size on ABP_DelayedSpawn_C");
static_assert(offsetof(ABP_DelayedSpawn_C, UberGraphFrame) == 0x000298, "Member 'ABP_DelayedSpawn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DelayedSpawn_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_DelayedSpawn_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_DelayedSpawn_C, GameSession) == 0x0002A8, "Member 'ABP_DelayedSpawn_C::GameSession' has a wrong offset!");
static_assert(offsetof(ABP_DelayedSpawn_C, Spawnable) == 0x0002B0, "Member 'ABP_DelayedSpawn_C::Spawnable' has a wrong offset!");
static_assert(offsetof(ABP_DelayedSpawn_C, Delay) == 0x0002B8, "Member 'ABP_DelayedSpawn_C::Delay' has a wrong offset!");

}

