#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DogAlien

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_Parent_Enemy_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DogAlien.BP_DogAlien_C
// 0x0050 (0x0AE0 - 0x0A90)
class ABP_DogAlien_C : public ABP_Parent_Enemy_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_DogAlien_C;                      // 0x0A88(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        CorpseArrow;                                       // 0x0A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEating;                                          // 0x0A98(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          IsChasing;                                         // 0x0A99(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9A[0x6];                                      // 0x0A9A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        EatingAudio;                                       // 0x0AA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                VictimLocation;                                    // 0x0AA8(0x0018)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              RunningSound;                                      // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              EatingSound;                                       // 0x0AC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        RunningAudio;                                      // 0x0AD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void OnRep_IsEating();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ReceiveTick(float DeltaSeconds);
	void UpdateEatingAudio();
	void StopEatingAudio(class ABP_KillableCharacter_C* KilledCharacter, class AActor* Killer);
	void ExecuteUbergraph_BP_DogAlien(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DogAlien_C">();
	}
	static class ABP_DogAlien_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DogAlien_C>();
	}
};
static_assert(alignof(ABP_DogAlien_C) == 0x000010, "Wrong alignment on ABP_DogAlien_C");
static_assert(sizeof(ABP_DogAlien_C) == 0x000AE0, "Wrong size on ABP_DogAlien_C");
static_assert(offsetof(ABP_DogAlien_C, UberGraphFrame_BP_DogAlien_C) == 0x000A88, "Member 'ABP_DogAlien_C::UberGraphFrame_BP_DogAlien_C' has a wrong offset!");
static_assert(offsetof(ABP_DogAlien_C, CorpseArrow) == 0x000A90, "Member 'ABP_DogAlien_C::CorpseArrow' has a wrong offset!");
static_assert(offsetof(ABP_DogAlien_C, IsEating) == 0x000A98, "Member 'ABP_DogAlien_C::IsEating' has a wrong offset!");
static_assert(offsetof(ABP_DogAlien_C, IsChasing) == 0x000A99, "Member 'ABP_DogAlien_C::IsChasing' has a wrong offset!");
static_assert(offsetof(ABP_DogAlien_C, EatingAudio) == 0x000AA0, "Member 'ABP_DogAlien_C::EatingAudio' has a wrong offset!");
static_assert(offsetof(ABP_DogAlien_C, VictimLocation) == 0x000AA8, "Member 'ABP_DogAlien_C::VictimLocation' has a wrong offset!");
static_assert(offsetof(ABP_DogAlien_C, RunningSound) == 0x000AC0, "Member 'ABP_DogAlien_C::RunningSound' has a wrong offset!");
static_assert(offsetof(ABP_DogAlien_C, EatingSound) == 0x000AC8, "Member 'ABP_DogAlien_C::EatingSound' has a wrong offset!");
static_assert(offsetof(ABP_DogAlien_C, RunningAudio) == 0x000AD0, "Member 'ABP_DogAlien_C::RunningAudio' has a wrong offset!");

}

