#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeskLamp_01a

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DeskLamp_01a.BP_DeskLamp_01a_C
// 0x0020 (0x02B8 - 0x0298)
class ABP_DeskLamp_01a_C final : public AActor
{
public:
	class URectLightComponent*                    RectLight;                                         // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_DeskLamp_01a;                                   // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DeskLamp_01a_C">();
	}
	static class ABP_DeskLamp_01a_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DeskLamp_01a_C>();
	}
};
static_assert(alignof(ABP_DeskLamp_01a_C) == 0x000008, "Wrong alignment on ABP_DeskLamp_01a_C");
static_assert(sizeof(ABP_DeskLamp_01a_C) == 0x0002B8, "Wrong size on ABP_DeskLamp_01a_C");
static_assert(offsetof(ABP_DeskLamp_01a_C, RectLight) == 0x000298, "Member 'ABP_DeskLamp_01a_C::RectLight' has a wrong offset!");
static_assert(offsetof(ABP_DeskLamp_01a_C, SM_DeskLamp_01a) == 0x0002A0, "Member 'ABP_DeskLamp_01a_C::SM_DeskLamp_01a' has a wrong offset!");
static_assert(offsetof(ABP_DeskLamp_01a_C, SpotLight) == 0x0002A8, "Member 'ABP_DeskLamp_01a_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ABP_DeskLamp_01a_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_DeskLamp_01a_C::DefaultSceneRoot' has a wrong offset!");

}

