#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Explosion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Explosion.BP_Explosion_C.GetActorsInDanger
// 0x0020 (0x0020 - 0x0000)
struct BP_Explosion_C_GetActorsInDanger final
{
public:
	TArray<class AActor*>                         ActorsInDanger;                                    // 0x0000(0x0010)(Parm, OutParm)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0010(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_Explosion_C_GetActorsInDanger) == 0x000008, "Wrong alignment on BP_Explosion_C_GetActorsInDanger");
static_assert(sizeof(BP_Explosion_C_GetActorsInDanger) == 0x000020, "Wrong size on BP_Explosion_C_GetActorsInDanger");
static_assert(offsetof(BP_Explosion_C_GetActorsInDanger, ActorsInDanger) == 0x000000, "Member 'BP_Explosion_C_GetActorsInDanger::ActorsInDanger' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_GetActorsInDanger, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000010, "Member 'BP_Explosion_C_GetActorsInDanger::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");

// Function BP_Explosion.BP_Explosion_C.ExecuteUbergraph_BP_Explosion
// 0x0170 (0x0170 - 0x0000)
struct BP_Explosion_C_ExecuteUbergraph_BP_Explosion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetActorsInDanger_ActorsInDanger;         // 0x0048(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ConstParm, ReferenceParm)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_KillableCharacter_C*                K2Node_DynamicCast_AsBP_Killable_Character;        // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x00D0(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x00E0(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                K2Node_DynamicCast_AsBP_UPPlayer_Character;        // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerController_C*               CallFunc_GetPlayerController_PlayerController;     // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_StartCameraShake__Server__CameraShakeIndex; // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SphereOverlapActors_SphereRadius_ImplicitCast; // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_StartCameraShake__Server__Scale_ImplicitCast; // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion) == 0x000008, "Wrong alignment on BP_Explosion_C_ExecuteUbergraph_BP_Explosion");
static_assert(sizeof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion) == 0x000170, "Wrong size on BP_Explosion_C_ExecuteUbergraph_BP_Explosion");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, EntryPoint) == 0x000000, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_HasAuthority_ReturnValue) == 0x000028, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_BooleanAND_ReturnValue) == 0x000029, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000030, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_GetActorsInDanger_ActorsInDanger) == 0x000048, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_GetActorsInDanger_ActorsInDanger' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000060, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, K2Node_MakeArray_Array) == 0x000078, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000088, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, Temp_int_Loop_Counter_Variable_1) == 0x000090, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, Temp_int_Array_Index_Variable_1) == 0x000094, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, K2Node_DynamicCast_AsBP_Killable_Character) == 0x0000A8, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::K2Node_DynamicCast_AsBP_Killable_Character' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000B4, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0000B8, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, Temp_object_Variable) == 0x0000D0, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_SphereOverlapActors_OutActors) == 0x0000E0, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_SphereOverlapActors_ReturnValue) == 0x0000F0, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_Array_Length_ReturnValue_1) == 0x0000F4, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_Array_Get_Item_1) == 0x0000F8, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_Less_IntInt_ReturnValue_1) == 0x000100, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, K2Node_DynamicCast_AsBP_UPPlayer_Character) == 0x000108, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::K2Node_DynamicCast_AsBP_UPPlayer_Character' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, K2Node_DynamicCast_bSuccess_1) == 0x000110, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000118, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_GetPlayerController_PlayerController) == 0x000130, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_GetPlayerController_PlayerController' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_Vector_Distance_ReturnValue) == 0x000138, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_IsValid_ReturnValue) == 0x000140, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000148, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000150, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_StartCameraShake__Server__CameraShakeIndex) == 0x000158, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_StartCameraShake__Server__CameraShakeIndex' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000160, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_SphereOverlapActors_SphereRadius_ImplicitCast) == 0x000168, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_SphereOverlapActors_SphereRadius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Explosion_C_ExecuteUbergraph_BP_Explosion, CallFunc_StartCameraShake__Server__Scale_ImplicitCast) == 0x00016C, "Member 'BP_Explosion_C_ExecuteUbergraph_BP_Explosion::CallFunc_StartCameraShake__Server__Scale_ImplicitCast' has a wrong offset!");

}

