#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Episodes

#include "Basic.hpp"

#include "S_EpisodeDefinition_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Episodes.BP_Episodes_C.ArePlayerStatesReady
// 0x0028 (0x0028 - 0x0000)
struct BP_Episodes_C_ArePlayerStatesReady final
{
public:
	bool                                          Ready;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerState_C*                    CallFunc_GetPlayerStateById_PlayerState;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Episodes_C_ArePlayerStatesReady) == 0x000008, "Wrong alignment on BP_Episodes_C_ArePlayerStatesReady");
static_assert(sizeof(BP_Episodes_C_ArePlayerStatesReady) == 0x000028, "Wrong size on BP_Episodes_C_ArePlayerStatesReady");
static_assert(offsetof(BP_Episodes_C_ArePlayerStatesReady, Ready) == 0x000000, "Member 'BP_Episodes_C_ArePlayerStatesReady::Ready' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ArePlayerStatesReady, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_Episodes_C_ArePlayerStatesReady::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ArePlayerStatesReady, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_Episodes_C_ArePlayerStatesReady::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ArePlayerStatesReady, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Episodes_C_ArePlayerStatesReady::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ArePlayerStatesReady, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_Episodes_C_ArePlayerStatesReady::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ArePlayerStatesReady, CallFunc_GetPlayerStateById_PlayerState) == 0x000018, "Member 'BP_Episodes_C_ArePlayerStatesReady::CallFunc_GetPlayerStateById_PlayerState' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ArePlayerStatesReady, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_Episodes_C_ArePlayerStatesReady::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ArePlayerStatesReady, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'BP_Episodes_C_ArePlayerStatesReady::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ArePlayerStatesReady, CallFunc_Less_IntInt_ReturnValue) == 0x000025, "Member 'BP_Episodes_C_ArePlayerStatesReady::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Episodes.BP_Episodes_C.CreateSave
// 0x0010 (0x0010 - 0x0000)
struct BP_Episodes_C_CreateSave final
{
public:
	class UBP_EpisodesSave_C*                     OutputPin;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_EpisodesSave_C*                     CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Episodes_C_CreateSave) == 0x000008, "Wrong alignment on BP_Episodes_C_CreateSave");
static_assert(sizeof(BP_Episodes_C_CreateSave) == 0x000010, "Wrong size on BP_Episodes_C_CreateSave");
static_assert(offsetof(BP_Episodes_C_CreateSave, OutputPin) == 0x000000, "Member 'BP_Episodes_C_CreateSave::OutputPin' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_CreateSave, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000008, "Member 'BP_Episodes_C_CreateSave::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");

// Function BP_Episodes.BP_Episodes_C.DayEnded
// 0x0004 (0x0004 - 0x0000)
struct BP_Episodes_C_DayEnded final
{
public:
	int32                                         SessionPoints;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Episodes_C_DayEnded) == 0x000004, "Wrong alignment on BP_Episodes_C_DayEnded");
static_assert(sizeof(BP_Episodes_C_DayEnded) == 0x000004, "Wrong size on BP_Episodes_C_DayEnded");
static_assert(offsetof(BP_Episodes_C_DayEnded, SessionPoints) == 0x000000, "Member 'BP_Episodes_C_DayEnded::SessionPoints' has a wrong offset!");

// Function BP_Episodes.BP_Episodes_C.EndEpisode
// 0x0001 (0x0001 - 0x0000)
struct BP_Episodes_C_EndEpisode final
{
public:
	bool                                          Failure;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Episodes_C_EndEpisode) == 0x000001, "Wrong alignment on BP_Episodes_C_EndEpisode");
static_assert(sizeof(BP_Episodes_C_EndEpisode) == 0x000001, "Wrong size on BP_Episodes_C_EndEpisode");
static_assert(offsetof(BP_Episodes_C_EndEpisode, Failure) == 0x000000, "Member 'BP_Episodes_C_EndEpisode::Failure' has a wrong offset!");

// Function BP_Episodes.BP_Episodes_C.ExecuteUbergraph_BP_Episodes
// 0x00E8 (0x00E8 - 0x0000)
struct BP_Episodes_C_ExecuteUbergraph_BP_Episodes final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Failure_1;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Failure;                        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInResults_InResults;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Difficulty;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_EpisodeDefinition                   CallFunc_GetEpisodeDefinition_EpisodeDefinition;   // 0x0038(0x0020)(HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Reward;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_SessionPoints;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPGameState_C*                      K2Node_DynamicCast_AsBP_UPGame_State;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInResults_InResults_1;                  // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasInSession_Result;                      // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSessionHost_IsHost;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerCharacter_C*                CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerController_C*               K2Node_DynamicCast_AsBP_UPPlayer_Controller;       // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_AddHudWidget_Widget;                      // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_Episodes_C*                          K2Node_DynamicCast_AsW_Episodes;                   // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x00DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_3;        // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_6;          // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes) == 0x000008, "Wrong alignment on BP_Episodes_C_ExecuteUbergraph_BP_Episodes");
static_assert(sizeof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes) == 0x0000E8, "Wrong size on BP_Episodes_C_ExecuteUbergraph_BP_Episodes");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, EntryPoint) == 0x000000, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, Temp_int_Variable) == 0x000004, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, K2Node_CustomEvent_Failure_1) == 0x00000C, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::K2Node_CustomEvent_Failure_1' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, K2Node_CustomEvent_Failure) == 0x000014, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::K2Node_CustomEvent_Failure' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, K2Node_Event_EndPlayReason) == 0x000015, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, K2Node_DynamicCast_AsBP_UPGame_Instance) == 0x000020, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::K2Node_DynamicCast_AsBP_UPGame_Instance' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_IsInResults_InResults) == 0x000029, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_IsInResults_InResults' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_Add_IntInt_ReturnValue_2) == 0x00002C, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, K2Node_CustomEvent_Difficulty) == 0x000030, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::K2Node_CustomEvent_Difficulty' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_GetEpisodeDefinition_EpisodeDefinition) == 0x000038, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_GetEpisodeDefinition_EpisodeDefinition' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, K2Node_CustomEvent_Reward) == 0x000058, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::K2Node_CustomEvent_Reward' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, Temp_int_Variable_1) == 0x00005C, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000060, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, K2Node_CustomEvent_SessionPoints) == 0x000064, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::K2Node_CustomEvent_SessionPoints' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_GetGameState_ReturnValue) == 0x000070, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, K2Node_DynamicCast_AsBP_UPGame_State) == 0x000078, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::K2Node_DynamicCast_AsBP_UPGame_State' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_HasAuthority_ReturnValue) == 0x000081, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_IsInResults_InResults_1) == 0x000082, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_IsInResults_InResults_1' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_WasInSession_Result) == 0x000083, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_WasInSession_Result' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_Add_IntInt_ReturnValue_3) == 0x000084, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_IsSessionHost_IsHost) == 0x000088, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_IsSessionHost_IsHost' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000089, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_Not_PreBool_ReturnValue) == 0x00008A, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_BooleanOR_ReturnValue) == 0x00008B, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, Temp_int_Array_Index_Variable) == 0x00008C, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_Array_Get_Item) == 0x000090, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_GetPlayerController_ReturnValue) == 0x000098, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, K2Node_DynamicCast_AsBP_UPPlayer_Controller) == 0x0000A0, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::K2Node_DynamicCast_AsBP_UPPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, K2Node_DynamicCast_bSuccess_2) == 0x0000A8, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_AddHudWidget_Widget) == 0x0000B0, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_AddHudWidget_Widget' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, K2Node_DynamicCast_AsW_Episodes) == 0x0000B8, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::K2Node_DynamicCast_AsW_Episodes' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, K2Node_DynamicCast_bSuccess_3) == 0x0000C0, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_Greater_IntInt_ReturnValue) == 0x0000C1, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, Temp_int_Loop_Counter_Variable) == 0x0000C4, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_Array_Length_ReturnValue_1) == 0x0000C8, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000CC, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x0000CD, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x0000CE, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_Less_IntInt_ReturnValue) == 0x0000CF, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_Add_IntInt_ReturnValue_4) == 0x0000D0, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x0000D4, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_Array_Length_ReturnValue_2) == 0x0000D8, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_EqualEqual_IntInt_ReturnValue_5) == 0x0000DC, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_EqualEqual_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000DD, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x0000DE, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_GreaterEqual_IntInt_ReturnValue_2) == 0x0000DF, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_GreaterEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_GreaterEqual_IntInt_ReturnValue_3) == 0x0000E0, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_GreaterEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000E1, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_EqualEqual_IntInt_ReturnValue_6) == 0x0000E2, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_EqualEqual_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_ExecuteUbergraph_BP_Episodes, CallFunc_BooleanAND_ReturnValue) == 0x0000E3, "Member 'BP_Episodes_C_ExecuteUbergraph_BP_Episodes::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_Episodes.BP_Episodes_C.GetDeadPlayerNames
// 0x0050 (0x0050 - 0x0000)
struct BP_Episodes_C_GetDeadPlayerNames final
{
public:
	TArray<class FString>                         PlayerNames;                                       // 0x0000(0x0010)(Parm, OutParm)
	TArray<class FString>                         _PlayerNames;                                      // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerState_C*                    CallFunc_GetPlayerStateById_PlayerState;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Episodes_C_GetDeadPlayerNames) == 0x000008, "Wrong alignment on BP_Episodes_C_GetDeadPlayerNames");
static_assert(sizeof(BP_Episodes_C_GetDeadPlayerNames) == 0x000050, "Wrong size on BP_Episodes_C_GetDeadPlayerNames");
static_assert(offsetof(BP_Episodes_C_GetDeadPlayerNames, PlayerNames) == 0x000000, "Member 'BP_Episodes_C_GetDeadPlayerNames::PlayerNames' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetDeadPlayerNames, _PlayerNames) == 0x000010, "Member 'BP_Episodes_C_GetDeadPlayerNames::_PlayerNames' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetDeadPlayerNames, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_Episodes_C_GetDeadPlayerNames::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetDeadPlayerNames, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BP_Episodes_C_GetDeadPlayerNames::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetDeadPlayerNames, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_Episodes_C_GetDeadPlayerNames::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetDeadPlayerNames, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'BP_Episodes_C_GetDeadPlayerNames::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetDeadPlayerNames, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_Episodes_C_GetDeadPlayerNames::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetDeadPlayerNames, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_Episodes_C_GetDeadPlayerNames::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetDeadPlayerNames, CallFunc_GetPlayerStateById_PlayerState) == 0x000040, "Member 'BP_Episodes_C_GetDeadPlayerNames::CallFunc_GetPlayerStateById_PlayerState' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetDeadPlayerNames, CallFunc_Array_Add_ReturnValue) == 0x000048, "Member 'BP_Episodes_C_GetDeadPlayerNames::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_Episodes.BP_Episodes_C.GetEpisodeDefinition
// 0x00A0 (0x00A0 - 0x0000)
struct BP_Episodes_C_GetEpisodeDefinition final
{
public:
	int32                                         Difficulty;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_EpisodeDefinition                   EpisodeDefinition_0;                               // 0x0008(0x0020)(Parm, OutParm, HasGetValueTypeHash)
	TArray<class FString>                         _Maps;                                             // 0x0028(0x0010)(Edit, BlueprintVisible)
	int32                                         _Difficulty;                                       // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_EpisodeDefinition                   CallFunc_Array_Get_Item;                           // 0x0048(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_EpisodeDefinition                   K2Node_SetFieldsInStruct_StructOut;                // 0x0070(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMaxDifficulty_MaxDifficulty;           // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Episodes_C_GetEpisodeDefinition) == 0x000008, "Wrong alignment on BP_Episodes_C_GetEpisodeDefinition");
static_assert(sizeof(BP_Episodes_C_GetEpisodeDefinition) == 0x0000A0, "Wrong size on BP_Episodes_C_GetEpisodeDefinition");
static_assert(offsetof(BP_Episodes_C_GetEpisodeDefinition, Difficulty) == 0x000000, "Member 'BP_Episodes_C_GetEpisodeDefinition::Difficulty' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetEpisodeDefinition, EpisodeDefinition_0) == 0x000008, "Member 'BP_Episodes_C_GetEpisodeDefinition::EpisodeDefinition_0' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetEpisodeDefinition, _Maps) == 0x000028, "Member 'BP_Episodes_C_GetEpisodeDefinition::_Maps' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetEpisodeDefinition, _Difficulty) == 0x000038, "Member 'BP_Episodes_C_GetEpisodeDefinition::_Difficulty' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetEpisodeDefinition, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'BP_Episodes_C_GetEpisodeDefinition::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetEpisodeDefinition, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'BP_Episodes_C_GetEpisodeDefinition::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetEpisodeDefinition, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BP_Episodes_C_GetEpisodeDefinition::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetEpisodeDefinition, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_Episodes_C_GetEpisodeDefinition::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetEpisodeDefinition, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'BP_Episodes_C_GetEpisodeDefinition::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetEpisodeDefinition, K2Node_SetFieldsInStruct_StructOut) == 0x000070, "Member 'BP_Episodes_C_GetEpisodeDefinition::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetEpisodeDefinition, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'BP_Episodes_C_GetEpisodeDefinition::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetEpisodeDefinition, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000091, "Member 'BP_Episodes_C_GetEpisodeDefinition::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetEpisodeDefinition, CallFunc_GetMaxDifficulty_MaxDifficulty) == 0x000094, "Member 'BP_Episodes_C_GetEpisodeDefinition::CallFunc_GetMaxDifficulty_MaxDifficulty' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetEpisodeDefinition, CallFunc_Min_ReturnValue) == 0x000098, "Member 'BP_Episodes_C_GetEpisodeDefinition::CallFunc_Min_ReturnValue' has a wrong offset!");

// Function BP_Episodes.BP_Episodes_C.GetMaxDifficulty
// 0x0040 (0x0040 - 0x0000)
struct BP_Episodes_C_GetMaxDifficulty final
{
public:
	int32                                         MaxDifficulty;                                     // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _MaxDifficulty;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_EpisodeDefinition                   CallFunc_Array_Get_Item;                           // 0x0018(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Episodes_C_GetMaxDifficulty) == 0x000008, "Wrong alignment on BP_Episodes_C_GetMaxDifficulty");
static_assert(sizeof(BP_Episodes_C_GetMaxDifficulty) == 0x000040, "Wrong size on BP_Episodes_C_GetMaxDifficulty");
static_assert(offsetof(BP_Episodes_C_GetMaxDifficulty, MaxDifficulty) == 0x000000, "Member 'BP_Episodes_C_GetMaxDifficulty::MaxDifficulty' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetMaxDifficulty, _MaxDifficulty) == 0x000004, "Member 'BP_Episodes_C_GetMaxDifficulty::_MaxDifficulty' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetMaxDifficulty, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_Episodes_C_GetMaxDifficulty::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetMaxDifficulty, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_Episodes_C_GetMaxDifficulty::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetMaxDifficulty, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_Episodes_C_GetMaxDifficulty::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetMaxDifficulty, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_Episodes_C_GetMaxDifficulty::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetMaxDifficulty, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_Episodes_C_GetMaxDifficulty::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetMaxDifficulty, CallFunc_Greater_IntInt_ReturnValue) == 0x00003C, "Member 'BP_Episodes_C_GetMaxDifficulty::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetMaxDifficulty, CallFunc_Less_IntInt_ReturnValue) == 0x00003D, "Member 'BP_Episodes_C_GetMaxDifficulty::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Episodes.BP_Episodes_C.GetNextSessionMap
// 0x0040 (0x0040 - 0x0000)
struct BP_Episodes_C_GetNextSessionMap final
{
public:
	class FString                                 MapName;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 _MapName;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Episodes_C_GetNextSessionMap) == 0x000008, "Wrong alignment on BP_Episodes_C_GetNextSessionMap");
static_assert(sizeof(BP_Episodes_C_GetNextSessionMap) == 0x000040, "Wrong size on BP_Episodes_C_GetNextSessionMap");
static_assert(offsetof(BP_Episodes_C_GetNextSessionMap, MapName) == 0x000000, "Member 'BP_Episodes_C_GetNextSessionMap::MapName' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetNextSessionMap, _MapName) == 0x000010, "Member 'BP_Episodes_C_GetNextSessionMap::_MapName' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetNextSessionMap, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_Episodes_C_GetNextSessionMap::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetNextSessionMap, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_Episodes_C_GetNextSessionMap::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetNextSessionMap, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_Episodes_C_GetNextSessionMap::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetNextSessionMap, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_Episodes_C_GetNextSessionMap::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Episodes.BP_Episodes_C.GetRemainingDays
// 0x0008 (0x0008 - 0x0000)
struct BP_Episodes_C_GetRemainingDays final
{
public:
	int32                                         RemainingDays;                                     // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Episodes_C_GetRemainingDays) == 0x000004, "Wrong alignment on BP_Episodes_C_GetRemainingDays");
static_assert(sizeof(BP_Episodes_C_GetRemainingDays) == 0x000008, "Wrong size on BP_Episodes_C_GetRemainingDays");
static_assert(offsetof(BP_Episodes_C_GetRemainingDays, RemainingDays) == 0x000000, "Member 'BP_Episodes_C_GetRemainingDays::RemainingDays' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_GetRemainingDays, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'BP_Episodes_C_GetRemainingDays::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Episodes.BP_Episodes_C.GiveReward
// 0x0004 (0x0004 - 0x0000)
struct BP_Episodes_C_GiveReward final
{
public:
	int32                                         Reward;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Episodes_C_GiveReward) == 0x000004, "Wrong alignment on BP_Episodes_C_GiveReward");
static_assert(sizeof(BP_Episodes_C_GiveReward) == 0x000004, "Wrong size on BP_Episodes_C_GiveReward");
static_assert(offsetof(BP_Episodes_C_GiveReward, Reward) == 0x000000, "Member 'BP_Episodes_C_GiveReward::Reward' has a wrong offset!");

// Function BP_Episodes.BP_Episodes_C.LoadEpisodes
// 0x0008 (0x0008 - 0x0000)
struct BP_Episodes_C_LoadEpisodes final
{
public:
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Episodes_C_LoadEpisodes) == 0x000008, "Wrong alignment on BP_Episodes_C_LoadEpisodes");
static_assert(sizeof(BP_Episodes_C_LoadEpisodes) == 0x000008, "Wrong size on BP_Episodes_C_LoadEpisodes");
static_assert(offsetof(BP_Episodes_C_LoadEpisodes, CallFunc_LoadGameFromSlot_ReturnValue) == 0x000000, "Member 'BP_Episodes_C_LoadEpisodes::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");

// Function BP_Episodes.BP_Episodes_C.LoadSave
// 0x0018 (0x0018 - 0x0000)
struct BP_Episodes_C_LoadSave final
{
public:
	class USaveGame*                              SaveObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_EpisodesSave_C*                     K2Node_DynamicCast_AsBP_Episodes_Save;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Episodes_C_LoadSave) == 0x000008, "Wrong alignment on BP_Episodes_C_LoadSave");
static_assert(sizeof(BP_Episodes_C_LoadSave) == 0x000018, "Wrong size on BP_Episodes_C_LoadSave");
static_assert(offsetof(BP_Episodes_C_LoadSave, SaveObject) == 0x000000, "Member 'BP_Episodes_C_LoadSave::SaveObject' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_LoadSave, K2Node_DynamicCast_AsBP_Episodes_Save) == 0x000008, "Member 'BP_Episodes_C_LoadSave::K2Node_DynamicCast_AsBP_Episodes_Save' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_LoadSave, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_Episodes_C_LoadSave::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_LoadSave, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_Episodes_C_LoadSave::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Episodes.BP_Episodes_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Episodes_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Episodes_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_Episodes_C_ReceiveEndPlay");
static_assert(sizeof(BP_Episodes_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_Episodes_C_ReceiveEndPlay");
static_assert(offsetof(BP_Episodes_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_Episodes_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_Episodes.BP_Episodes_C.RestartFromZero
// 0x0001 (0x0001 - 0x0000)
struct BP_Episodes_C_RestartFromZero final
{
public:
	bool                                          Failure;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Episodes_C_RestartFromZero) == 0x000001, "Wrong alignment on BP_Episodes_C_RestartFromZero");
static_assert(sizeof(BP_Episodes_C_RestartFromZero) == 0x000001, "Wrong size on BP_Episodes_C_RestartFromZero");
static_assert(offsetof(BP_Episodes_C_RestartFromZero, Failure) == 0x000000, "Member 'BP_Episodes_C_RestartFromZero::Failure' has a wrong offset!");

// Function BP_Episodes.BP_Episodes_C.SaveEpisodes
// 0x0010 (0x0010 - 0x0000)
struct BP_Episodes_C_SaveEpisodes final
{
public:
	class UBP_EpisodesSave_C*                     CallFunc_CreateSave_OutputPin;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Episodes_C_SaveEpisodes) == 0x000008, "Wrong alignment on BP_Episodes_C_SaveEpisodes");
static_assert(sizeof(BP_Episodes_C_SaveEpisodes) == 0x000010, "Wrong size on BP_Episodes_C_SaveEpisodes");
static_assert(offsetof(BP_Episodes_C_SaveEpisodes, CallFunc_CreateSave_OutputPin) == 0x000000, "Member 'BP_Episodes_C_SaveEpisodes::CallFunc_CreateSave_OutputPin' has a wrong offset!");
static_assert(offsetof(BP_Episodes_C_SaveEpisodes, CallFunc_SaveGameToSlot_ReturnValue) == 0x000008, "Member 'BP_Episodes_C_SaveEpisodes::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");

// Function BP_Episodes.BP_Episodes_C.StartNewEpisode
// 0x0004 (0x0004 - 0x0000)
struct BP_Episodes_C_StartNewEpisode final
{
public:
	int32                                         Difficulty;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Episodes_C_StartNewEpisode) == 0x000004, "Wrong alignment on BP_Episodes_C_StartNewEpisode");
static_assert(sizeof(BP_Episodes_C_StartNewEpisode) == 0x000004, "Wrong size on BP_Episodes_C_StartNewEpisode");
static_assert(offsetof(BP_Episodes_C_StartNewEpisode, Difficulty) == 0x000000, "Member 'BP_Episodes_C_StartNewEpisode::Difficulty' has a wrong offset!");

}

