#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EpisodesSave

#include "Basic.hpp"

#include "S_EpisodeDefinition_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EpisodesSave.BP_EpisodesSave_C
// 0x0038 (0x0060 - 0x0028)
class UBP_EpisodesSave_C final : public USaveGame
{
public:
	struct FS_EpisodeDefinition                   EpisodeDefinition;                                 // 0x0028(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         CurrentDay;                                        // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalDays;                                         // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Bank;                                              // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastDayReward;                                     // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MapIndex;                                          // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EpisodesSave_C">();
	}
	static class UBP_EpisodesSave_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_EpisodesSave_C>();
	}
};
static_assert(alignof(UBP_EpisodesSave_C) == 0x000008, "Wrong alignment on UBP_EpisodesSave_C");
static_assert(sizeof(UBP_EpisodesSave_C) == 0x000060, "Wrong size on UBP_EpisodesSave_C");
static_assert(offsetof(UBP_EpisodesSave_C, EpisodeDefinition) == 0x000028, "Member 'UBP_EpisodesSave_C::EpisodeDefinition' has a wrong offset!");
static_assert(offsetof(UBP_EpisodesSave_C, CurrentDay) == 0x000048, "Member 'UBP_EpisodesSave_C::CurrentDay' has a wrong offset!");
static_assert(offsetof(UBP_EpisodesSave_C, TotalDays) == 0x00004C, "Member 'UBP_EpisodesSave_C::TotalDays' has a wrong offset!");
static_assert(offsetof(UBP_EpisodesSave_C, Bank) == 0x000050, "Member 'UBP_EpisodesSave_C::Bank' has a wrong offset!");
static_assert(offsetof(UBP_EpisodesSave_C, LastDayReward) == 0x000054, "Member 'UBP_EpisodesSave_C::LastDayReward' has a wrong offset!");
static_assert(offsetof(UBP_EpisodesSave_C, MapIndex) == 0x000058, "Member 'UBP_EpisodesSave_C::MapIndex' has a wrong offset!");

}

