#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Flashlight

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Flashlight.BP_Flashlight_C.CreateSaveObject
// 0x0010 (0x0010 - 0x0000)
struct BP_Flashlight_C_CreateSaveObject final
{
public:
	class USaveGame*                              Save;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_FlashlightSave_C*                   CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Flashlight_C_CreateSaveObject) == 0x000008, "Wrong alignment on BP_Flashlight_C_CreateSaveObject");
static_assert(sizeof(BP_Flashlight_C_CreateSaveObject) == 0x000010, "Wrong size on BP_Flashlight_C_CreateSaveObject");
static_assert(offsetof(BP_Flashlight_C_CreateSaveObject, Save) == 0x000000, "Member 'BP_Flashlight_C_CreateSaveObject::Save' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_C_CreateSaveObject, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000008, "Member 'BP_Flashlight_C_CreateSaveObject::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");

// Function BP_Flashlight.BP_Flashlight_C.IsBatteryEmpty
// 0x0002 (0x0002 - 0x0000)
struct BP_Flashlight_C_IsBatteryEmpty final
{
public:
	bool                                          Empty;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Flashlight_C_IsBatteryEmpty) == 0x000001, "Wrong alignment on BP_Flashlight_C_IsBatteryEmpty");
static_assert(sizeof(BP_Flashlight_C_IsBatteryEmpty) == 0x000002, "Wrong size on BP_Flashlight_C_IsBatteryEmpty");
static_assert(offsetof(BP_Flashlight_C_IsBatteryEmpty, Empty) == 0x000000, "Member 'BP_Flashlight_C_IsBatteryEmpty::Empty' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_C_IsBatteryEmpty, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000001, "Member 'BP_Flashlight_C_IsBatteryEmpty::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_Flashlight.BP_Flashlight_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Flashlight_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Flashlight_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Flashlight_C_ReceiveTick");
static_assert(sizeof(BP_Flashlight_C_ReceiveTick) == 0x000004, "Wrong size on BP_Flashlight_C_ReceiveTick");
static_assert(offsetof(BP_Flashlight_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Flashlight_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Flashlight.BP_Flashlight_C.LoadSaveData
// 0x0008 (0x0008 - 0x0000)
struct BP_Flashlight_C_LoadSaveData final
{
public:
	class USaveGame*                              Save;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Flashlight_C_LoadSaveData) == 0x000008, "Wrong alignment on BP_Flashlight_C_LoadSaveData");
static_assert(sizeof(BP_Flashlight_C_LoadSaveData) == 0x000008, "Wrong size on BP_Flashlight_C_LoadSaveData");
static_assert(offsetof(BP_Flashlight_C_LoadSaveData, Save) == 0x000000, "Member 'BP_Flashlight_C_LoadSaveData::Save' has a wrong offset!");

// Function BP_Flashlight.BP_Flashlight_C.ExecuteUbergraph_BP_Flashlight
// 0x0080 (0x0080 - 0x0000)
struct BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBatteryEmpty_Empty;                     // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              K2Node_Event_Save;                                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_FlashlightSave_C*                   K2Node_DynamicCast_AsBP_Flashlight_Save;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInResults_InResults;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight) == 0x000008, "Wrong alignment on BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight");
static_assert(sizeof(BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight) == 0x000080, "Wrong size on BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight");
static_assert(offsetof(BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight, EntryPoint) == 0x000000, "Member 'BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000004, "Member 'BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight, CallFunc_IsBatteryEmpty_Empty) == 0x00000C, "Member 'BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight::CallFunc_IsBatteryEmpty_Empty' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight, CallFunc_HasAuthority_ReturnValue) == 0x00000D, "Member 'BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight, CallFunc_BooleanAND_ReturnValue) == 0x00000E, "Member 'BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight, CallFunc_BooleanAND_ReturnValue_1) == 0x00000F, "Member 'BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight, CallFunc_HasAuthority_ReturnValue_1) == 0x000010, "Member 'BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight, CallFunc_BooleanAND_ReturnValue_2) == 0x000011, "Member 'BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight, CallFunc_FClamp_ReturnValue) == 0x000028, "Member 'BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight, K2Node_Event_Save) == 0x000030, "Member 'BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight::K2Node_Event_Save' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight, CallFunc_GetGameInstance_ReturnValue) == 0x000038, "Member 'BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight, K2Node_DynamicCast_AsBP_Flashlight_Save) == 0x000040, "Member 'BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight::K2Node_DynamicCast_AsBP_Flashlight_Save' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight, K2Node_DynamicCast_AsBP_UPGame_Instance) == 0x000050, "Member 'BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight::K2Node_DynamicCast_AsBP_UPGame_Instance' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight, CallFunc_IsInResults_InResults) == 0x000059, "Member 'BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight::CallFunc_IsInResults_InResults' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000060, "Member 'BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000078, "Member 'BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

