#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FanBlades_01b

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_FanBlades_01b.BP_FanBlades_01b_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_FanBlades_01b_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FanBlades_01b_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_FanBlades_01b_C_ReceiveTick");
static_assert(sizeof(BP_FanBlades_01b_C_ReceiveTick) == 0x000004, "Wrong size on BP_FanBlades_01b_C_ReceiveTick");
static_assert(offsetof(BP_FanBlades_01b_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_FanBlades_01b_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_FanBlades_01b.BP_FanBlades_01b_C.ExecuteUbergraph_BP_FanBlades_01b
// 0x0100 (0x0100 - 0x0000)
struct BP_FanBlades_01b_C_ExecuteUbergraph_BP_FanBlades_01b final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetAttachParent_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult;    // 0x0010(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FanBlades_01b_C_ExecuteUbergraph_BP_FanBlades_01b) == 0x000008, "Wrong alignment on BP_FanBlades_01b_C_ExecuteUbergraph_BP_FanBlades_01b");
static_assert(sizeof(BP_FanBlades_01b_C_ExecuteUbergraph_BP_FanBlades_01b) == 0x000100, "Wrong size on BP_FanBlades_01b_C_ExecuteUbergraph_BP_FanBlades_01b");
static_assert(offsetof(BP_FanBlades_01b_C_ExecuteUbergraph_BP_FanBlades_01b, EntryPoint) == 0x000000, "Member 'BP_FanBlades_01b_C_ExecuteUbergraph_BP_FanBlades_01b::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FanBlades_01b_C_ExecuteUbergraph_BP_FanBlades_01b, CallFunc_GetAttachParent_ReturnValue) == 0x000008, "Member 'BP_FanBlades_01b_C_ExecuteUbergraph_BP_FanBlades_01b::CallFunc_GetAttachParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FanBlades_01b_C_ExecuteUbergraph_BP_FanBlades_01b, CallFunc_K2_AddRelativeRotation_SweepHitResult) == 0x000010, "Member 'BP_FanBlades_01b_C_ExecuteUbergraph_BP_FanBlades_01b::CallFunc_K2_AddRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_FanBlades_01b_C_ExecuteUbergraph_BP_FanBlades_01b, K2Node_Event_DeltaSeconds) == 0x0000F8, "Member 'BP_FanBlades_01b_C_ExecuteUbergraph_BP_FanBlades_01b::K2Node_Event_DeltaSeconds' has a wrong offset!");

}

