#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Helmet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_AvatarHelmet_structs.hpp"


namespace SDK::Params
{

// Function BP_Helmet.BP_Helmet_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Helmet_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Helmet_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_Helmet_C_ReceiveEndPlay");
static_assert(sizeof(BP_Helmet_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_Helmet_C_ReceiveEndPlay");
static_assert(offsetof(BP_Helmet_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_Helmet_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_Helmet.BP_Helmet_C.UpdateHelmetOnAvatar
// 0x0001 (0x0001 - 0x0000)
struct BP_Helmet_C_UpdateHelmetOnAvatar final
{
public:
	bool                                          ForceRemove;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Helmet_C_UpdateHelmetOnAvatar) == 0x000001, "Wrong alignment on BP_Helmet_C_UpdateHelmetOnAvatar");
static_assert(sizeof(BP_Helmet_C_UpdateHelmetOnAvatar) == 0x000001, "Wrong size on BP_Helmet_C_UpdateHelmetOnAvatar");
static_assert(offsetof(BP_Helmet_C_UpdateHelmetOnAvatar, ForceRemove) == 0x000000, "Member 'BP_Helmet_C_UpdateHelmetOnAvatar::ForceRemove' has a wrong offset!");

// Function BP_Helmet.BP_Helmet_C.ExecuteUbergraph_BP_Helmet
// 0x00B8 (0x00B8 - 0x0000)
struct BP_Helmet_C_ExecuteUbergraph_BP_Helmet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_AvatarHelmet                        Temp_struct_Variable;                              // 0x0008(0x0050)(HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ForceRemove;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_AvatarHelmet                        K2Node_Select_Default;                             // 0x0060(0x0050)(HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Helmet_C_ExecuteUbergraph_BP_Helmet) == 0x000008, "Wrong alignment on BP_Helmet_C_ExecuteUbergraph_BP_Helmet");
static_assert(sizeof(BP_Helmet_C_ExecuteUbergraph_BP_Helmet) == 0x0000B8, "Wrong size on BP_Helmet_C_ExecuteUbergraph_BP_Helmet");
static_assert(offsetof(BP_Helmet_C_ExecuteUbergraph_BP_Helmet, EntryPoint) == 0x000000, "Member 'BP_Helmet_C_ExecuteUbergraph_BP_Helmet::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Helmet_C_ExecuteUbergraph_BP_Helmet, Temp_bool_Variable) == 0x000004, "Member 'BP_Helmet_C_ExecuteUbergraph_BP_Helmet::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Helmet_C_ExecuteUbergraph_BP_Helmet, Temp_struct_Variable) == 0x000008, "Member 'BP_Helmet_C_ExecuteUbergraph_BP_Helmet::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Helmet_C_ExecuteUbergraph_BP_Helmet, K2Node_CustomEvent_ForceRemove) == 0x000058, "Member 'BP_Helmet_C_ExecuteUbergraph_BP_Helmet::K2Node_CustomEvent_ForceRemove' has a wrong offset!");
static_assert(offsetof(BP_Helmet_C_ExecuteUbergraph_BP_Helmet, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'BP_Helmet_C_ExecuteUbergraph_BP_Helmet::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Helmet_C_ExecuteUbergraph_BP_Helmet, CallFunc_BooleanOR_ReturnValue) == 0x00005A, "Member 'BP_Helmet_C_ExecuteUbergraph_BP_Helmet::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Helmet_C_ExecuteUbergraph_BP_Helmet, K2Node_Select_Default) == 0x000060, "Member 'BP_Helmet_C_ExecuteUbergraph_BP_Helmet::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Helmet_C_ExecuteUbergraph_BP_Helmet, K2Node_Event_EndPlayReason) == 0x0000B0, "Member 'BP_Helmet_C_ExecuteUbergraph_BP_Helmet::K2Node_Event_EndPlayReason' has a wrong offset!");

}

