#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteriorModuleConnection

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "E_InteriorConnectionState_structs.hpp"


namespace SDK::Params
{

// Function BP_InteriorModuleConnection.BP_InteriorModuleConnection_C.ExecuteUbergraph_BP_InteriorModuleConnection
// 0x00A0 (0x00A0 - 0x0000)
struct BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWorldLoaded_IsLoaded;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_InteractableDoor_C*                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection) == 0x000010, "Wrong alignment on BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection");
static_assert(sizeof(BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection) == 0x0000A0, "Wrong size on BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection");
static_assert(offsetof(BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection, EntryPoint) == 0x000000, "Member 'BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection, CallFunc_IsWorldLoaded_IsLoaded) == 0x000005, "Member 'BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection::CallFunc_IsWorldLoaded_IsLoaded' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection, CallFunc_HasAuthority_ReturnValue) == 0x000006, "Member 'BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection, CallFunc_FMax_ReturnValue) == 0x000010, "Member 'BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection, CallFunc_IsValidClass_ReturnValue) == 0x000080, "Member 'BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000088, "Member 'BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection, CallFunc_FinishSpawningActor_ReturnValue) == 0x000090, "Member 'BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000098, "Member 'BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection, CallFunc_BooleanAND_ReturnValue) == 0x000099, "Member 'BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00009A, "Member 'BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection, CallFunc_IsValid_ReturnValue_1) == 0x00009B, "Member 'BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection, CallFunc_Not_PreBool_ReturnValue) == 0x00009C, "Member 'BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection, CallFunc_BooleanAND_ReturnValue_1) == 0x00009D, "Member 'BP_InteriorModuleConnection_C_ExecuteUbergraph_BP_InteriorModuleConnection::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BP_InteriorModuleConnection.BP_InteriorModuleConnection_C.FindPairedConnection
// 0x0080 (0x0080 - 0x0000)
struct BP_InteriorModuleConnection_C_FindPairedConnection final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_InteriorModuleConnection_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_InteriorModuleConnection_C*         CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_DistanceSquared_ReturnValue;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteriorModuleConnection_C_FindPairedConnection) == 0x000008, "Wrong alignment on BP_InteriorModuleConnection_C_FindPairedConnection");
static_assert(sizeof(BP_InteriorModuleConnection_C_FindPairedConnection) == 0x000080, "Wrong size on BP_InteriorModuleConnection_C_FindPairedConnection");
static_assert(offsetof(BP_InteriorModuleConnection_C_FindPairedConnection, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_InteriorModuleConnection_C_FindPairedConnection::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_FindPairedConnection, Temp_bool_True_if_break_was_hit_Variable) == 0x000004, "Member 'BP_InteriorModuleConnection_C_FindPairedConnection::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_FindPairedConnection, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'BP_InteriorModuleConnection_C_FindPairedConnection::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_FindPairedConnection, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_InteriorModuleConnection_C_FindPairedConnection::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_FindPairedConnection, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'BP_InteriorModuleConnection_C_FindPairedConnection::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_FindPairedConnection, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_InteriorModuleConnection_C_FindPairedConnection::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_FindPairedConnection, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_InteriorModuleConnection_C_FindPairedConnection::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_FindPairedConnection, CallFunc_GetAllActorsOfClass_OutActors) == 0x000030, "Member 'BP_InteriorModuleConnection_C_FindPairedConnection::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_FindPairedConnection, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_InteriorModuleConnection_C_FindPairedConnection::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_FindPairedConnection, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_InteriorModuleConnection_C_FindPairedConnection::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_FindPairedConnection, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_InteriorModuleConnection_C_FindPairedConnection::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_FindPairedConnection, CallFunc_BooleanAND_ReturnValue) == 0x000051, "Member 'BP_InteriorModuleConnection_C_FindPairedConnection::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_FindPairedConnection, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000052, "Member 'BP_InteriorModuleConnection_C_FindPairedConnection::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_FindPairedConnection, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000058, "Member 'BP_InteriorModuleConnection_C_FindPairedConnection::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_FindPairedConnection, CallFunc_Vector_DistanceSquared_ReturnValue) == 0x000070, "Member 'BP_InteriorModuleConnection_C_FindPairedConnection::CallFunc_Vector_DistanceSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_FindPairedConnection, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000078, "Member 'BP_InteriorModuleConnection_C_FindPairedConnection::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_InteriorModuleConnection.BP_InteriorModuleConnection_C.IsWorldLoaded
// 0x0018 (0x0018 - 0x0000)
struct BP_InteriorModuleConnection_C_IsWorldLoaded final
{
public:
	bool                                          IsLoaded;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPGameSession_C*                    CallFunc_GetActorOfClass_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasSessionStarted_Started;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteriorModuleConnection_C_IsWorldLoaded) == 0x000008, "Wrong alignment on BP_InteriorModuleConnection_C_IsWorldLoaded");
static_assert(sizeof(BP_InteriorModuleConnection_C_IsWorldLoaded) == 0x000018, "Wrong size on BP_InteriorModuleConnection_C_IsWorldLoaded");
static_assert(offsetof(BP_InteriorModuleConnection_C_IsWorldLoaded, IsLoaded) == 0x000000, "Member 'BP_InteriorModuleConnection_C_IsWorldLoaded::IsLoaded' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_IsWorldLoaded, CallFunc_GetActorOfClass_ReturnValue) == 0x000008, "Member 'BP_InteriorModuleConnection_C_IsWorldLoaded::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_IsWorldLoaded, CallFunc_HasSessionStarted_Started) == 0x000010, "Member 'BP_InteriorModuleConnection_C_IsWorldLoaded::CallFunc_HasSessionStarted_Started' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_IsWorldLoaded, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_InteriorModuleConnection_C_IsWorldLoaded::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_InteriorModuleConnection.BP_InteriorModuleConnection_C.UpdateVisuals
// 0x0028 (0x0028 - 0x0000)
struct BP_InteriorModuleConnection_C_UpdateVisuals final
{
public:
	class UClass*                                 Temp_class_Variable;                               // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_InteriorConnectionState                     Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_IMC_Part_C*                         K2Node_DynamicCast_AsBP_IMC_Part;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteriorModuleConnection_C_UpdateVisuals) == 0x000008, "Wrong alignment on BP_InteriorModuleConnection_C_UpdateVisuals");
static_assert(sizeof(BP_InteriorModuleConnection_C_UpdateVisuals) == 0x000028, "Wrong size on BP_InteriorModuleConnection_C_UpdateVisuals");
static_assert(offsetof(BP_InteriorModuleConnection_C_UpdateVisuals, Temp_class_Variable) == 0x000000, "Member 'BP_InteriorModuleConnection_C_UpdateVisuals::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_UpdateVisuals, Temp_byte_Variable) == 0x000008, "Member 'BP_InteriorModuleConnection_C_UpdateVisuals::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_UpdateVisuals, K2Node_Select_Default) == 0x000010, "Member 'BP_InteriorModuleConnection_C_UpdateVisuals::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_UpdateVisuals, K2Node_DynamicCast_AsBP_IMC_Part) == 0x000018, "Member 'BP_InteriorModuleConnection_C_UpdateVisuals::K2Node_DynamicCast_AsBP_IMC_Part' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_UpdateVisuals, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_InteriorModuleConnection_C_UpdateVisuals::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleConnection_C_UpdateVisuals, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'BP_InteriorModuleConnection_C_UpdateVisuals::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

