#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteriorModuleBounds

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InteriorModuleBounds.BP_InteriorModuleBounds_C
// 0x00A0 (0x0338 - 0x0298)
class ABP_InteriorModuleBounds_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Connections;                                       // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Bounds;                                            // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             Size;                                              // 0x02B8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CellSize;                                          // 0x02C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DoorOffset;                                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UWorld>>          Furnitures;                                        // 0x02E8(0x0010)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UWorld>                  SelectedFurnitures;                                // 0x02F8(0x0028)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify, UObjectWrapper, HasGetValueTypeHash)
	class FString                                 LevelName;                                         // 0x0320(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, RepNotify, HasGetValueTypeHash)
	class ULevelStreamingDynamic*                 FurnituresInstance;                                // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CreateConnection(const struct FVector& Location);
	void CreateConnectionsX();
	void CreateConnectionsY();
	void ExecuteUbergraph_BP_InteriorModuleBounds(int32 EntryPoint);
	void IsOnBorder(int32 X, int32 Y, int32 Z, bool* Result);
	void IsReadyToLoad(bool* Result);
	void LoadFurnituresLevel();
	void OnRep_LevelName();
	void OnRep_SelectedFurnitures();
	void ReceiveBeginPlay();
	void UpdateConnections();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InteriorModuleBounds_C">();
	}
	static class ABP_InteriorModuleBounds_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_InteriorModuleBounds_C>();
	}
};
static_assert(alignof(ABP_InteriorModuleBounds_C) == 0x000008, "Wrong alignment on ABP_InteriorModuleBounds_C");
static_assert(sizeof(ABP_InteriorModuleBounds_C) == 0x000338, "Wrong size on ABP_InteriorModuleBounds_C");
static_assert(offsetof(ABP_InteriorModuleBounds_C, UberGraphFrame) == 0x000298, "Member 'ABP_InteriorModuleBounds_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_InteriorModuleBounds_C, Connections) == 0x0002A0, "Member 'ABP_InteriorModuleBounds_C::Connections' has a wrong offset!");
static_assert(offsetof(ABP_InteriorModuleBounds_C, Bounds) == 0x0002A8, "Member 'ABP_InteriorModuleBounds_C::Bounds' has a wrong offset!");
static_assert(offsetof(ABP_InteriorModuleBounds_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_InteriorModuleBounds_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_InteriorModuleBounds_C, Size) == 0x0002B8, "Member 'ABP_InteriorModuleBounds_C::Size' has a wrong offset!");
static_assert(offsetof(ABP_InteriorModuleBounds_C, CellSize) == 0x0002C8, "Member 'ABP_InteriorModuleBounds_C::CellSize' has a wrong offset!");
static_assert(offsetof(ABP_InteriorModuleBounds_C, DoorOffset) == 0x0002E0, "Member 'ABP_InteriorModuleBounds_C::DoorOffset' has a wrong offset!");
static_assert(offsetof(ABP_InteriorModuleBounds_C, Furnitures) == 0x0002E8, "Member 'ABP_InteriorModuleBounds_C::Furnitures' has a wrong offset!");
static_assert(offsetof(ABP_InteriorModuleBounds_C, SelectedFurnitures) == 0x0002F8, "Member 'ABP_InteriorModuleBounds_C::SelectedFurnitures' has a wrong offset!");
static_assert(offsetof(ABP_InteriorModuleBounds_C, LevelName) == 0x000320, "Member 'ABP_InteriorModuleBounds_C::LevelName' has a wrong offset!");
static_assert(offsetof(ABP_InteriorModuleBounds_C, FurnituresInstance) == 0x000330, "Member 'ABP_InteriorModuleBounds_C::FurnituresInstance' has a wrong offset!");

}

