#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractableOutwardDoor_WoodGlass

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_InteractableOutwardDoor_WoodGlass.BP_InteractableOutwardDoor_WoodGlass_C.ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass
// 0x0180 (0x0180 - 0x0000)
struct BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_OpenProgress;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0090(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass) == 0x000008, "Wrong alignment on BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass");
static_assert(sizeof(BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass) == 0x000180, "Wrong size on BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass");
static_assert(offsetof(BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass, EntryPoint) == 0x000000, "Member 'BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass, Temp_bool_Variable) == 0x000004, "Member 'BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass, Temp_real_Variable) == 0x000008, "Member 'BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass, Temp_real_Variable_1) == 0x000010, "Member 'BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass, K2Node_Event_OpenProgress) == 0x000018, "Member 'BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass::K2Node_Event_OpenProgress' has a wrong offset!");
static_assert(offsetof(BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000038, "Member 'BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000050, "Member 'BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass, K2Node_Select_Default) == 0x000068, "Member 'BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass, CallFunc_Lerp_ReturnValue) == 0x000070, "Member 'BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass, CallFunc_MakeRotator_ReturnValue) == 0x000078, "Member 'BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000090, "Member 'BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000178, "Member 'BP_InteractableOutwardDoor_WoodGlass_C_ExecuteUbergraph_BP_InteractableOutwardDoor_WoodGlass::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

// Function BP_InteractableOutwardDoor_WoodGlass.BP_InteractableOutwardDoor_WoodGlass_C.GetDoorMeshes
// 0x0020 (0x0020 - 0x0000)
struct BP_InteractableOutwardDoor_WoodGlass_C_GetDoorMeshes final
{
public:
	TArray<class UStaticMeshComponent*>           Meshes;                                            // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_InteractableOutwardDoor_WoodGlass_C_GetDoorMeshes) == 0x000008, "Wrong alignment on BP_InteractableOutwardDoor_WoodGlass_C_GetDoorMeshes");
static_assert(sizeof(BP_InteractableOutwardDoor_WoodGlass_C_GetDoorMeshes) == 0x000020, "Wrong size on BP_InteractableOutwardDoor_WoodGlass_C_GetDoorMeshes");
static_assert(offsetof(BP_InteractableOutwardDoor_WoodGlass_C_GetDoorMeshes, Meshes) == 0x000000, "Member 'BP_InteractableOutwardDoor_WoodGlass_C_GetDoorMeshes::Meshes' has a wrong offset!");
static_assert(offsetof(BP_InteractableOutwardDoor_WoodGlass_C_GetDoorMeshes, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_InteractableOutwardDoor_WoodGlass_C_GetDoorMeshes::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_InteractableOutwardDoor_WoodGlass.BP_InteractableOutwardDoor_WoodGlass_C.UpdateDoor
// 0x0008 (0x0008 - 0x0000)
struct BP_InteractableOutwardDoor_WoodGlass_C_UpdateDoor final
{
public:
	double                                        OpenProgress;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableOutwardDoor_WoodGlass_C_UpdateDoor) == 0x000008, "Wrong alignment on BP_InteractableOutwardDoor_WoodGlass_C_UpdateDoor");
static_assert(sizeof(BP_InteractableOutwardDoor_WoodGlass_C_UpdateDoor) == 0x000008, "Wrong size on BP_InteractableOutwardDoor_WoodGlass_C_UpdateDoor");
static_assert(offsetof(BP_InteractableOutwardDoor_WoodGlass_C_UpdateDoor, OpenProgress) == 0x000000, "Member 'BP_InteractableOutwardDoor_WoodGlass_C_UpdateDoor::OpenProgress' has a wrong offset!");

}

