#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemsStock

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "S_InventoryItemSave_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ItemsStock.BP_ItemsStock_C
// 0x00D8 (0x0370 - 0x0298)
class ABP_ItemsStock_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow18;                                           // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow17;                                           // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow8;                                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow7;                                            // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow16;                                           // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow15;                                           // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow6;                                            // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow5;                                            // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow10;                                           // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow14;                                           // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow13;                                           // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow12;                                           // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow11;                                           // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow4;                                            // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow3;                                            // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow2;                                            // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow1;                                            // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UArrowComponent*>                SpawnLocations;                                    // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class ABP_UPGameState_C*                      GameState;                                         // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   GameInstance;                                      // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemsSpawned;                                      // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_InventoryItemSave>           RecoverStock;                                      // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void UpdateStock();
	void SpawnItems();
	void SpawnItem(int32 Index_0, const struct FS_InventoryItemSave& Item);
	void ServerTravelStarted(const class FString& DestinationMapName);
	void ResetStock();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void InitStockReset();
	void GetSpawnLocation(int32 Index_0, struct FTransform* SpawnTransform);
	void GetItemsInStock(TArray<struct FS_InventoryItemSave>* Items);
	void ExecuteUbergraph_BP_ItemsStock(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ItemsStock_C">();
	}
	static class ABP_ItemsStock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ItemsStock_C>();
	}
};
static_assert(alignof(ABP_ItemsStock_C) == 0x000008, "Wrong alignment on ABP_ItemsStock_C");
static_assert(sizeof(ABP_ItemsStock_C) == 0x000370, "Wrong size on ABP_ItemsStock_C");
static_assert(offsetof(ABP_ItemsStock_C, UberGraphFrame) == 0x000298, "Member 'ABP_ItemsStock_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ItemsStock_C, Arrow18) == 0x0002A0, "Member 'ABP_ItemsStock_C::Arrow18' has a wrong offset!");
static_assert(offsetof(ABP_ItemsStock_C, Arrow17) == 0x0002A8, "Member 'ABP_ItemsStock_C::Arrow17' has a wrong offset!");
static_assert(offsetof(ABP_ItemsStock_C, Arrow8) == 0x0002B0, "Member 'ABP_ItemsStock_C::Arrow8' has a wrong offset!");
static_assert(offsetof(ABP_ItemsStock_C, Arrow7) == 0x0002B8, "Member 'ABP_ItemsStock_C::Arrow7' has a wrong offset!");
static_assert(offsetof(ABP_ItemsStock_C, Arrow16) == 0x0002C0, "Member 'ABP_ItemsStock_C::Arrow16' has a wrong offset!");
static_assert(offsetof(ABP_ItemsStock_C, Arrow15) == 0x0002C8, "Member 'ABP_ItemsStock_C::Arrow15' has a wrong offset!");
static_assert(offsetof(ABP_ItemsStock_C, Arrow6) == 0x0002D0, "Member 'ABP_ItemsStock_C::Arrow6' has a wrong offset!");
static_assert(offsetof(ABP_ItemsStock_C, Arrow5) == 0x0002D8, "Member 'ABP_ItemsStock_C::Arrow5' has a wrong offset!");
static_assert(offsetof(ABP_ItemsStock_C, Arrow10) == 0x0002E0, "Member 'ABP_ItemsStock_C::Arrow10' has a wrong offset!");
static_assert(offsetof(ABP_ItemsStock_C, Arrow14) == 0x0002E8, "Member 'ABP_ItemsStock_C::Arrow14' has a wrong offset!");
static_assert(offsetof(ABP_ItemsStock_C, Arrow13) == 0x0002F0, "Member 'ABP_ItemsStock_C::Arrow13' has a wrong offset!");
static_assert(offsetof(ABP_ItemsStock_C, Arrow12) == 0x0002F8, "Member 'ABP_ItemsStock_C::Arrow12' has a wrong offset!");
static_assert(offsetof(ABP_ItemsStock_C, Arrow11) == 0x000300, "Member 'ABP_ItemsStock_C::Arrow11' has a wrong offset!");
static_assert(offsetof(ABP_ItemsStock_C, Arrow4) == 0x000308, "Member 'ABP_ItemsStock_C::Arrow4' has a wrong offset!");
static_assert(offsetof(ABP_ItemsStock_C, Arrow3) == 0x000310, "Member 'ABP_ItemsStock_C::Arrow3' has a wrong offset!");
static_assert(offsetof(ABP_ItemsStock_C, Arrow2) == 0x000318, "Member 'ABP_ItemsStock_C::Arrow2' has a wrong offset!");
static_assert(offsetof(ABP_ItemsStock_C, Arrow1) == 0x000320, "Member 'ABP_ItemsStock_C::Arrow1' has a wrong offset!");
static_assert(offsetof(ABP_ItemsStock_C, Arrow) == 0x000328, "Member 'ABP_ItemsStock_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_ItemsStock_C, DefaultSceneRoot) == 0x000330, "Member 'ABP_ItemsStock_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ItemsStock_C, SpawnLocations) == 0x000338, "Member 'ABP_ItemsStock_C::SpawnLocations' has a wrong offset!");
static_assert(offsetof(ABP_ItemsStock_C, GameState) == 0x000348, "Member 'ABP_ItemsStock_C::GameState' has a wrong offset!");
static_assert(offsetof(ABP_ItemsStock_C, GameInstance) == 0x000350, "Member 'ABP_ItemsStock_C::GameInstance' has a wrong offset!");
static_assert(offsetof(ABP_ItemsStock_C, ItemsSpawned) == 0x000358, "Member 'ABP_ItemsStock_C::ItemsSpawned' has a wrong offset!");
static_assert(offsetof(ABP_ItemsStock_C, RecoverStock) == 0x000360, "Member 'ABP_ItemsStock_C::RecoverStock' has a wrong offset!");

}

