#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Infected

#include "Basic.hpp"

#include "S_PlayerAvatar_structs.hpp"


namespace SDK::Params
{

// Function BP_Infected.BP_Infected_C.CopyAvatar
// 0x00A0 (0x00A0 - 0x0000)
struct BP_Infected_C_CopyAvatar final
{
public:
	struct FS_PlayerAvatar                        Avatar_0;                                          // 0x0000(0x00A0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Infected_C_CopyAvatar) == 0x000008, "Wrong alignment on BP_Infected_C_CopyAvatar");
static_assert(sizeof(BP_Infected_C_CopyAvatar) == 0x0000A0, "Wrong size on BP_Infected_C_CopyAvatar");
static_assert(offsetof(BP_Infected_C_CopyAvatar, Avatar_0) == 0x000000, "Member 'BP_Infected_C_CopyAvatar::Avatar_0' has a wrong offset!");

// Function BP_Infected.BP_Infected_C.CopyHiddenBones
// 0x0008 (0x0008 - 0x0000)
struct BP_Infected_C_CopyHiddenBones final
{
public:
	class USkeletalMeshComponent*                 Mesh_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Infected_C_CopyHiddenBones) == 0x000008, "Wrong alignment on BP_Infected_C_CopyHiddenBones");
static_assert(sizeof(BP_Infected_C_CopyHiddenBones) == 0x000008, "Wrong size on BP_Infected_C_CopyHiddenBones");
static_assert(offsetof(BP_Infected_C_CopyHiddenBones, Mesh_0) == 0x000000, "Member 'BP_Infected_C_CopyHiddenBones::Mesh_0' has a wrong offset!");

// Function BP_Infected.BP_Infected_C.ExecuteUbergraph_BP_Infected
// 0x0198 (0x0198 - 0x0000)
struct BP_Infected_C_ExecuteUbergraph_BP_Infected final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerCharacter_C*                K2Node_DynamicCast_AsBP_UPPlayer_Character;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Survivor_Exterior_C*                K2Node_DynamicCast_AsBP_Survivor_Exterior;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PlayerAvatar                        CallFunc_GetAvatar_Avatar;                         // 0x0030(0x00A0)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 K2Node_CustomEvent_Mesh;                           // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetBoneName_ReturnValue;                  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToActor_ReturnValue;             // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBoneHiddenByName_ReturnValue;           // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EB[0x1];                                       // 0x00EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumBones_ReturnValue;                  // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PlayerAvatar                        K2Node_CustomEvent_Avatar;                         // 0x00F8(0x00A0)(HasGetValueTypeHash)
};
static_assert(alignof(BP_Infected_C_ExecuteUbergraph_BP_Infected) == 0x000008, "Wrong alignment on BP_Infected_C_ExecuteUbergraph_BP_Infected");
static_assert(sizeof(BP_Infected_C_ExecuteUbergraph_BP_Infected) == 0x000198, "Wrong size on BP_Infected_C_ExecuteUbergraph_BP_Infected");
static_assert(offsetof(BP_Infected_C_ExecuteUbergraph_BP_Infected, EntryPoint) == 0x000000, "Member 'BP_Infected_C_ExecuteUbergraph_BP_Infected::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Infected_C_ExecuteUbergraph_BP_Infected, Temp_int_Variable) == 0x000004, "Member 'BP_Infected_C_ExecuteUbergraph_BP_Infected::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Infected_C_ExecuteUbergraph_BP_Infected, CallFunc_HasAuthority_ReturnValue) == 0x000008, "Member 'BP_Infected_C_ExecuteUbergraph_BP_Infected::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Infected_C_ExecuteUbergraph_BP_Infected, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Infected_C_ExecuteUbergraph_BP_Infected::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Infected_C_ExecuteUbergraph_BP_Infected, K2Node_DynamicCast_AsBP_UPPlayer_Character) == 0x000010, "Member 'BP_Infected_C_ExecuteUbergraph_BP_Infected::K2Node_DynamicCast_AsBP_UPPlayer_Character' has a wrong offset!");
static_assert(offsetof(BP_Infected_C_ExecuteUbergraph_BP_Infected, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Infected_C_ExecuteUbergraph_BP_Infected::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Infected_C_ExecuteUbergraph_BP_Infected, K2Node_DynamicCast_AsBP_Survivor_Exterior) == 0x000020, "Member 'BP_Infected_C_ExecuteUbergraph_BP_Infected::K2Node_DynamicCast_AsBP_Survivor_Exterior' has a wrong offset!");
static_assert(offsetof(BP_Infected_C_ExecuteUbergraph_BP_Infected, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'BP_Infected_C_ExecuteUbergraph_BP_Infected::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Infected_C_ExecuteUbergraph_BP_Infected, CallFunc_GetAvatar_Avatar) == 0x000030, "Member 'BP_Infected_C_ExecuteUbergraph_BP_Infected::CallFunc_GetAvatar_Avatar' has a wrong offset!");
static_assert(offsetof(BP_Infected_C_ExecuteUbergraph_BP_Infected, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'BP_Infected_C_ExecuteUbergraph_BP_Infected::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Infected_C_ExecuteUbergraph_BP_Infected, K2Node_CustomEvent_Mesh) == 0x0000D8, "Member 'BP_Infected_C_ExecuteUbergraph_BP_Infected::K2Node_CustomEvent_Mesh' has a wrong offset!");
static_assert(offsetof(BP_Infected_C_ExecuteUbergraph_BP_Infected, CallFunc_GetBoneName_ReturnValue) == 0x0000E0, "Member 'BP_Infected_C_ExecuteUbergraph_BP_Infected::CallFunc_GetBoneName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Infected_C_ExecuteUbergraph_BP_Infected, CallFunc_K2_AttachToActor_ReturnValue) == 0x0000E8, "Member 'BP_Infected_C_ExecuteUbergraph_BP_Infected::CallFunc_K2_AttachToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Infected_C_ExecuteUbergraph_BP_Infected, CallFunc_IsBoneHiddenByName_ReturnValue) == 0x0000E9, "Member 'BP_Infected_C_ExecuteUbergraph_BP_Infected::CallFunc_IsBoneHiddenByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Infected_C_ExecuteUbergraph_BP_Infected, CallFunc_IsValid_ReturnValue_1) == 0x0000EA, "Member 'BP_Infected_C_ExecuteUbergraph_BP_Infected::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Infected_C_ExecuteUbergraph_BP_Infected, CallFunc_GetNumBones_ReturnValue) == 0x0000EC, "Member 'BP_Infected_C_ExecuteUbergraph_BP_Infected::CallFunc_GetNumBones_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Infected_C_ExecuteUbergraph_BP_Infected, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000F0, "Member 'BP_Infected_C_ExecuteUbergraph_BP_Infected::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Infected_C_ExecuteUbergraph_BP_Infected, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000F4, "Member 'BP_Infected_C_ExecuteUbergraph_BP_Infected::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Infected_C_ExecuteUbergraph_BP_Infected, K2Node_CustomEvent_Avatar) == 0x0000F8, "Member 'BP_Infected_C_ExecuteUbergraph_BP_Infected::K2Node_CustomEvent_Avatar' has a wrong offset!");

}

