#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InventoryItem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_InventoryItem.BP_InventoryItem_C.CreateSaveObject
// 0x0008 (0x0008 - 0x0000)
struct BP_InventoryItem_C_CreateSaveObject final
{
public:
	class USaveGame*                              Save;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InventoryItem_C_CreateSaveObject) == 0x000008, "Wrong alignment on BP_InventoryItem_C_CreateSaveObject");
static_assert(sizeof(BP_InventoryItem_C_CreateSaveObject) == 0x000008, "Wrong size on BP_InventoryItem_C_CreateSaveObject");
static_assert(offsetof(BP_InventoryItem_C_CreateSaveObject, Save) == 0x000000, "Member 'BP_InventoryItem_C_CreateSaveObject::Save' has a wrong offset!");

// Function BP_InventoryItem.BP_InventoryItem_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_InventoryItem_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InventoryItem_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_InventoryItem_C_ReceiveTick");
static_assert(sizeof(BP_InventoryItem_C_ReceiveTick) == 0x000004, "Wrong size on BP_InventoryItem_C_ReceiveTick");
static_assert(offsetof(BP_InventoryItem_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_InventoryItem_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_InventoryItem.BP_InventoryItem_C.LoadSaveData
// 0x0008 (0x0008 - 0x0000)
struct BP_InventoryItem_C_LoadSaveData final
{
public:
	class USaveGame*                              Save;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InventoryItem_C_LoadSaveData) == 0x000008, "Wrong alignment on BP_InventoryItem_C_LoadSaveData");
static_assert(sizeof(BP_InventoryItem_C_LoadSaveData) == 0x000008, "Wrong size on BP_InventoryItem_C_LoadSaveData");
static_assert(offsetof(BP_InventoryItem_C_LoadSaveData, Save) == 0x000000, "Member 'BP_InventoryItem_C_LoadSaveData::Save' has a wrong offset!");

// Function BP_InventoryItem.BP_InventoryItem_C.LoadSaveObject
// 0x0028 (0x0028 - 0x0000)
struct BP_InventoryItem_C_LoadSaveObject final
{
public:
	class USaveGame*                              Save;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetInventoryItemSaveSlot_Slot;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InventoryItem_C_LoadSaveObject) == 0x000008, "Wrong alignment on BP_InventoryItem_C_LoadSaveObject");
static_assert(sizeof(BP_InventoryItem_C_LoadSaveObject) == 0x000028, "Wrong size on BP_InventoryItem_C_LoadSaveObject");
static_assert(offsetof(BP_InventoryItem_C_LoadSaveObject, Save) == 0x000000, "Member 'BP_InventoryItem_C_LoadSaveObject::Save' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_LoadSaveObject, CallFunc_GetInventoryItemSaveSlot_Slot) == 0x000008, "Member 'BP_InventoryItem_C_LoadSaveObject::CallFunc_GetInventoryItemSaveSlot_Slot' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_LoadSaveObject, CallFunc_DoesSaveGameExist_ReturnValue) == 0x000018, "Member 'BP_InventoryItem_C_LoadSaveObject::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_LoadSaveObject, CallFunc_LoadGameFromSlot_ReturnValue) == 0x000020, "Member 'BP_InventoryItem_C_LoadSaveObject::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");

// Function BP_InventoryItem.BP_InventoryItem_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_InventoryItem_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InventoryItem_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_InventoryItem_C_ReceiveEndPlay");
static_assert(sizeof(BP_InventoryItem_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_InventoryItem_C_ReceiveEndPlay");
static_assert(offsetof(BP_InventoryItem_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_InventoryItem_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_InventoryItem.BP_InventoryItem_C.ExecuteUbergraph_BP_InventoryItem
// 0x0190 (0x0190 - 0x0000)
struct BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerController_C*               CallFunc_GetPlayerController_PlayerController;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0038(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadSaveObject_Save;                      // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              K2Node_CustomEvent_Save;                           // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerController_C*               CallFunc_GetPlayerController_PlayerController_1;   // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue;      // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x014B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x014E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14F[0x1];                                      // 0x014F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_AddHudWidget_Widget;                      // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_InventoryItemOverlay_C*              K2Node_DynamicCast_AsW_Inventory_Item_Overlay;     // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSessionHost_IsHost;                     // 0x0163(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_CreateSaveObject_Save;                    // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetInventoryItemSaveSlot_Slot;            // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem) == 0x000008, "Wrong alignment on BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem");
static_assert(sizeof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem) == 0x000190, "Wrong size on BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, EntryPoint) == 0x000000, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, CallFunc_GetPlayerController_PlayerController) == 0x000008, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::CallFunc_GetPlayerController_PlayerController' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, CallFunc_IsValid_ReturnValue_2) == 0x000018, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000020, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000038, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, CallFunc_Not_PreBool_ReturnValue) == 0x000120, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, CallFunc_BooleanOR_ReturnValue) == 0x000121, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, CallFunc_LoadSaveObject_Save) == 0x000128, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::CallFunc_LoadSaveObject_Save' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, K2Node_CustomEvent_Save) == 0x000130, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::K2Node_CustomEvent_Save' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, K2Node_Event_EndPlayReason) == 0x000138, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, CallFunc_GetPlayerController_PlayerController_1) == 0x000140, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::CallFunc_GetPlayerController_PlayerController_1' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, CallFunc_IsValid_ReturnValue_3) == 0x000148, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, CallFunc_IsLocalPlayerController_ReturnValue) == 0x000149, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::CallFunc_IsLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, CallFunc_IsValidClass_ReturnValue) == 0x00014A, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, CallFunc_IsValid_ReturnValue_4) == 0x00014B, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, CallFunc_BooleanAND_ReturnValue) == 0x00014C, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, CallFunc_Not_PreBool_ReturnValue_1) == 0x00014D, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, CallFunc_BooleanAND_ReturnValue_1) == 0x00014E, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, CallFunc_AddHudWidget_Widget) == 0x000150, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::CallFunc_AddHudWidget_Widget' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, K2Node_DynamicCast_AsW_Inventory_Item_Overlay) == 0x000158, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::K2Node_DynamicCast_AsW_Inventory_Item_Overlay' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, CallFunc_IsValid_ReturnValue_5) == 0x000161, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, CallFunc_HasAuthority_ReturnValue) == 0x000162, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, CallFunc_IsSessionHost_IsHost) == 0x000163, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::CallFunc_IsSessionHost_IsHost' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, CallFunc_CreateSaveObject_Save) == 0x000168, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::CallFunc_CreateSaveObject_Save' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, CallFunc_IsValid_ReturnValue_6) == 0x000170, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, CallFunc_GetInventoryItemSaveSlot_Slot) == 0x000178, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::CallFunc_GetInventoryItemSaveSlot_Slot' has a wrong offset!");
static_assert(offsetof(BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem, CallFunc_SaveGameToSlot_ReturnValue) == 0x000188, "Member 'BP_InventoryItem_C_ExecuteUbergraph_BP_InventoryItem::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");

}

