#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteriorModuleConnection

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_InteriorConnectionState_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InteriorModuleConnection.BP_InteriorModuleConnection_C
// 0x0078 (0x0310 - 0x0298)
class ABP_InteriorModuleConnection_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   ChildActor;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        InArrow;                                           // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        OutArrow;                                          // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 OpenActor;                                         // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ClosedActor;                                       // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      WallMaterial;                                      // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 DoorActor;                                         // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        DoorChance;                                        // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_InteriorConnectionState                     State;                                             // 0x02F0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_InteriorModuleConnection_C*         PairedConnection;                                  // 0x02F8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMainConnection;                                  // 0x0300(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_InteractableDoor_C*                 Door;                                              // 0x0308(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_InteriorModuleConnection(int32 EntryPoint);
	void FindPairedConnection();
	void IsWorldLoaded(bool* IsLoaded);
	void OnRep_State();
	void ReceiveBeginPlay();
	void SpawnDoor();
	void SpawnDoorIfNeeded();
	void UpdateVisuals();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InteriorModuleConnection_C">();
	}
	static class ABP_InteriorModuleConnection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_InteriorModuleConnection_C>();
	}
};
static_assert(alignof(ABP_InteriorModuleConnection_C) == 0x000008, "Wrong alignment on ABP_InteriorModuleConnection_C");
static_assert(sizeof(ABP_InteriorModuleConnection_C) == 0x000310, "Wrong size on ABP_InteriorModuleConnection_C");
static_assert(offsetof(ABP_InteriorModuleConnection_C, UberGraphFrame) == 0x000298, "Member 'ABP_InteriorModuleConnection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_InteriorModuleConnection_C, ChildActor) == 0x0002A0, "Member 'ABP_InteriorModuleConnection_C::ChildActor' has a wrong offset!");
static_assert(offsetof(ABP_InteriorModuleConnection_C, Billboard) == 0x0002A8, "Member 'ABP_InteriorModuleConnection_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_InteriorModuleConnection_C, InArrow) == 0x0002B0, "Member 'ABP_InteriorModuleConnection_C::InArrow' has a wrong offset!");
static_assert(offsetof(ABP_InteriorModuleConnection_C, OutArrow) == 0x0002B8, "Member 'ABP_InteriorModuleConnection_C::OutArrow' has a wrong offset!");
static_assert(offsetof(ABP_InteriorModuleConnection_C, DefaultSceneRoot) == 0x0002C0, "Member 'ABP_InteriorModuleConnection_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_InteriorModuleConnection_C, OpenActor) == 0x0002C8, "Member 'ABP_InteriorModuleConnection_C::OpenActor' has a wrong offset!");
static_assert(offsetof(ABP_InteriorModuleConnection_C, ClosedActor) == 0x0002D0, "Member 'ABP_InteriorModuleConnection_C::ClosedActor' has a wrong offset!");
static_assert(offsetof(ABP_InteriorModuleConnection_C, WallMaterial) == 0x0002D8, "Member 'ABP_InteriorModuleConnection_C::WallMaterial' has a wrong offset!");
static_assert(offsetof(ABP_InteriorModuleConnection_C, DoorActor) == 0x0002E0, "Member 'ABP_InteriorModuleConnection_C::DoorActor' has a wrong offset!");
static_assert(offsetof(ABP_InteriorModuleConnection_C, DoorChance) == 0x0002E8, "Member 'ABP_InteriorModuleConnection_C::DoorChance' has a wrong offset!");
static_assert(offsetof(ABP_InteriorModuleConnection_C, State) == 0x0002F0, "Member 'ABP_InteriorModuleConnection_C::State' has a wrong offset!");
static_assert(offsetof(ABP_InteriorModuleConnection_C, PairedConnection) == 0x0002F8, "Member 'ABP_InteriorModuleConnection_C::PairedConnection' has a wrong offset!");
static_assert(offsetof(ABP_InteriorModuleConnection_C, IsMainConnection) == 0x000300, "Member 'ABP_InteriorModuleConnection_C::IsMainConnection' has a wrong offset!");
static_assert(offsetof(ABP_InteriorModuleConnection_C, Door) == 0x000308, "Member 'ABP_InteriorModuleConnection_C::Door' has a wrong offset!");

}

