#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractableOutwardDoor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_InteractableDoor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InteractableOutwardDoor.BP_InteractableOutwardDoor_C
// 0x0018 (0x0340 - 0x0328)
class ABP_InteractableOutwardDoor_C final : public ABP_InteractableDoor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_InteractableOutwardDoor_C;       // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Door;                                              // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DoorFrame;                                         // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateDoor(double OpenProgress);
	void StartOpeningFX();
	void StartClosingFX();
	void GetDoorMeshes(TArray<class UStaticMeshComponent*>* Meshes);
	void ExecuteUbergraph_BP_InteractableOutwardDoor(int32 EntryPoint);
	void EndClosingFX();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InteractableOutwardDoor_C">();
	}
	static class ABP_InteractableOutwardDoor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_InteractableOutwardDoor_C>();
	}
};
static_assert(alignof(ABP_InteractableOutwardDoor_C) == 0x000008, "Wrong alignment on ABP_InteractableOutwardDoor_C");
static_assert(sizeof(ABP_InteractableOutwardDoor_C) == 0x000340, "Wrong size on ABP_InteractableOutwardDoor_C");
static_assert(offsetof(ABP_InteractableOutwardDoor_C, UberGraphFrame_BP_InteractableOutwardDoor_C) == 0x000328, "Member 'ABP_InteractableOutwardDoor_C::UberGraphFrame_BP_InteractableOutwardDoor_C' has a wrong offset!");
static_assert(offsetof(ABP_InteractableOutwardDoor_C, Door) == 0x000330, "Member 'ABP_InteractableOutwardDoor_C::Door' has a wrong offset!");
static_assert(offsetof(ABP_InteractableOutwardDoor_C, DoorFrame) == 0x000338, "Member 'ABP_InteractableOutwardDoor_C::DoorFrame' has a wrong offset!");

}

