#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemsStock

#include "Basic.hpp"

#include "S_InventoryItem_structs.hpp"
#include "S_InventoryItemSave_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ItemsStock.BP_ItemsStock_C.SpawnItem
// 0x00F0 (0x00F0 - 0x0000)
struct BP_ItemsStock_C_SpawnItem final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_InventoryItemSave                   Item;                                              // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSpawnLocation_SpawnTransform;          // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_InventoryItem                       CallFunc_Map_Find_Value;                           // 0x0070(0x0068)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PickupItem_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemsStock_C_SpawnItem) == 0x000010, "Wrong alignment on BP_ItemsStock_C_SpawnItem");
static_assert(sizeof(BP_ItemsStock_C_SpawnItem) == 0x0000F0, "Wrong size on BP_ItemsStock_C_SpawnItem");
static_assert(offsetof(BP_ItemsStock_C_SpawnItem, Index_0) == 0x000000, "Member 'BP_ItemsStock_C_SpawnItem::Index_0' has a wrong offset!");
static_assert(offsetof(BP_ItemsStock_C_SpawnItem, Item) == 0x000004, "Member 'BP_ItemsStock_C_SpawnItem::Item' has a wrong offset!");
static_assert(offsetof(BP_ItemsStock_C_SpawnItem, CallFunc_GetSpawnLocation_SpawnTransform) == 0x000010, "Member 'BP_ItemsStock_C_SpawnItem::CallFunc_GetSpawnLocation_SpawnTransform' has a wrong offset!");
static_assert(offsetof(BP_ItemsStock_C_SpawnItem, CallFunc_Map_Find_Value) == 0x000070, "Member 'BP_ItemsStock_C_SpawnItem::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_ItemsStock_C_SpawnItem, CallFunc_Map_Find_ReturnValue) == 0x0000D8, "Member 'BP_ItemsStock_C_SpawnItem::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemsStock_C_SpawnItem, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000E0, "Member 'BP_ItemsStock_C_SpawnItem::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemsStock_C_SpawnItem, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000E8, "Member 'BP_ItemsStock_C_SpawnItem::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_ItemsStock.BP_ItemsStock_C.ServerTravelStarted
// 0x0010 (0x0010 - 0x0000)
struct BP_ItemsStock_C_ServerTravelStarted final
{
public:
	class FString                                 DestinationMapName;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemsStock_C_ServerTravelStarted) == 0x000008, "Wrong alignment on BP_ItemsStock_C_ServerTravelStarted");
static_assert(sizeof(BP_ItemsStock_C_ServerTravelStarted) == 0x000010, "Wrong size on BP_ItemsStock_C_ServerTravelStarted");
static_assert(offsetof(BP_ItemsStock_C_ServerTravelStarted, DestinationMapName) == 0x000000, "Member 'BP_ItemsStock_C_ServerTravelStarted::DestinationMapName' has a wrong offset!");

// Function BP_ItemsStock.BP_ItemsStock_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ItemsStock_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemsStock_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ItemsStock_C_ReceiveTick");
static_assert(sizeof(BP_ItemsStock_C_ReceiveTick) == 0x000004, "Wrong size on BP_ItemsStock_C_ReceiveTick");
static_assert(offsetof(BP_ItemsStock_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ItemsStock_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ItemsStock.BP_ItemsStock_C.GetSpawnLocation
// 0x0150 (0x0150 - 0x0000)
struct BP_ItemsStock_C_GetSpawnLocation final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             SpawnTransform;                                    // 0x0010(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UArrowComponent*                        CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0080(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        CallFunc_Array_Random_OutItem;                     // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x00F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemsStock_C_GetSpawnLocation) == 0x000010, "Wrong alignment on BP_ItemsStock_C_GetSpawnLocation");
static_assert(sizeof(BP_ItemsStock_C_GetSpawnLocation) == 0x000150, "Wrong size on BP_ItemsStock_C_GetSpawnLocation");
static_assert(offsetof(BP_ItemsStock_C_GetSpawnLocation, Index_0) == 0x000000, "Member 'BP_ItemsStock_C_GetSpawnLocation::Index_0' has a wrong offset!");
static_assert(offsetof(BP_ItemsStock_C_GetSpawnLocation, SpawnTransform) == 0x000010, "Member 'BP_ItemsStock_C_GetSpawnLocation::SpawnTransform' has a wrong offset!");
static_assert(offsetof(BP_ItemsStock_C_GetSpawnLocation, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000070, "Member 'BP_ItemsStock_C_GetSpawnLocation::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemsStock_C_GetSpawnLocation, CallFunc_Array_Get_Item) == 0x000078, "Member 'BP_ItemsStock_C_GetSpawnLocation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ItemsStock_C_GetSpawnLocation, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000080, "Member 'BP_ItemsStock_C_GetSpawnLocation::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemsStock_C_GetSpawnLocation, CallFunc_Array_Random_OutItem) == 0x0000E0, "Member 'BP_ItemsStock_C_GetSpawnLocation::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(BP_ItemsStock_C_GetSpawnLocation, CallFunc_Array_Random_OutIndex) == 0x0000E8, "Member 'BP_ItemsStock_C_GetSpawnLocation::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(BP_ItemsStock_C_GetSpawnLocation, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x0000F0, "Member 'BP_ItemsStock_C_GetSpawnLocation::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");

// Function BP_ItemsStock.BP_ItemsStock_C.GetItemsInStock
// 0x00D8 (0x00D8 - 0x0000)
struct BP_ItemsStock_C_GetItemsInStock final
{
public:
	TArray<struct FS_InventoryItemSave>           Items;                                             // 0x0000(0x0010)(Parm, OutParm)
	TArray<struct FS_InventoryItemSave>           _Items;                                            // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_PickupItem_C*>               CallFunc_GetAllActorsOfClass_OutActors;            // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PickupItem_C*                       CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_InventoryItem                       CallFunc_Map_Find_Value;                           // 0x0058(0x0068)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_InventoryItemSave                   K2Node_MakeStruct_S_InventoryItemSave;             // 0x00C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemsStock_C_GetItemsInStock) == 0x000008, "Wrong alignment on BP_ItemsStock_C_GetItemsInStock");
static_assert(sizeof(BP_ItemsStock_C_GetItemsInStock) == 0x0000D8, "Wrong size on BP_ItemsStock_C_GetItemsInStock");
static_assert(offsetof(BP_ItemsStock_C_GetItemsInStock, Items) == 0x000000, "Member 'BP_ItemsStock_C_GetItemsInStock::Items' has a wrong offset!");
static_assert(offsetof(BP_ItemsStock_C_GetItemsInStock, _Items) == 0x000010, "Member 'BP_ItemsStock_C_GetItemsInStock::_Items' has a wrong offset!");
static_assert(offsetof(BP_ItemsStock_C_GetItemsInStock, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_ItemsStock_C_GetItemsInStock::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemsStock_C_GetItemsInStock, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BP_ItemsStock_C_GetItemsInStock::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemsStock_C_GetItemsInStock, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_ItemsStock_C_GetItemsInStock::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemsStock_C_GetItemsInStock, CallFunc_GetAllActorsOfClass_OutActors) == 0x000030, "Member 'BP_ItemsStock_C_GetItemsInStock::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_ItemsStock_C_GetItemsInStock, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_ItemsStock_C_GetItemsInStock::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemsStock_C_GetItemsInStock, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_ItemsStock_C_GetItemsInStock::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ItemsStock_C_GetItemsInStock, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_ItemsStock_C_GetItemsInStock::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemsStock_C_GetItemsInStock, CallFunc_Map_Find_Value) == 0x000058, "Member 'BP_ItemsStock_C_GetItemsInStock::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_ItemsStock_C_GetItemsInStock, CallFunc_Map_Find_ReturnValue) == 0x0000C0, "Member 'BP_ItemsStock_C_GetItemsInStock::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemsStock_C_GetItemsInStock, K2Node_MakeStruct_S_InventoryItemSave) == 0x0000C4, "Member 'BP_ItemsStock_C_GetItemsInStock::K2Node_MakeStruct_S_InventoryItemSave' has a wrong offset!");
static_assert(offsetof(BP_ItemsStock_C_GetItemsInStock, CallFunc_Array_Add_ReturnValue) == 0x0000CC, "Member 'BP_ItemsStock_C_GetItemsInStock::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemsStock_C_GetItemsInStock, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000D0, "Member 'BP_ItemsStock_C_GetItemsInStock::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ItemsStock.BP_ItemsStock_C.ExecuteUbergraph_BP_ItemsStock
// 0x00F0 (0x00F0 - 0x0000)
struct BP_ItemsStock_C_ExecuteUbergraph_BP_ItemsStock final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPGameState_C*                      K2Node_DynamicCast_AsBP_UPGame_State;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& DestinationMapName)> K2Node_CreateDelegate_OutputDelegate;   // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_InventoryItemSave                   CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance;           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_InventoryItemSave>           CallFunc_GetItemsInStock_Items;                    // 0x0090(0x0010)(ReferenceParm)
	class FString                                 K2Node_CustomEvent_DestinationMapName;             // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UArrowComponent*>                K2Node_MakeArray_Array;                            // 0x00B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_PickupItem_C*>               CallFunc_GetAllActorsOfClass_OutActors;            // 0x00D0(0x0010)(ReferenceParm)
	class ABP_PickupItem_C*                       CallFunc_Array_Get_Item_1;                         // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemsStock_C_ExecuteUbergraph_BP_ItemsStock) == 0x000008, "Wrong alignment on BP_ItemsStock_C_ExecuteUbergraph_BP_ItemsStock");
static_assert(sizeof(BP_ItemsStock_C_ExecuteUbergraph_BP_ItemsStock) == 0x0000F0, "Wrong size on BP_ItemsStock_C_ExecuteUbergraph_BP_ItemsStock");
static_assert(offsetof(BP_ItemsStock_C_ExecuteUbergraph_BP_ItemsStock, EntryPoint) == 0x000000, "Member 'BP_ItemsStock_C_ExecuteUbergraph_BP_ItemsStock::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ItemsStock_C_ExecuteUbergraph_BP_ItemsStock, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_ItemsStock_C_ExecuteUbergraph_BP_ItemsStock::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
