#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractableDoor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_InteractableDoor.BP_InteractableDoor_C.DestroyDoor
// 0x0018 (0x0018 - 0x0000)
struct BP_InteractableDoor_C_DestroyDoor final
{
public:
	struct FVector                                Origin;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableDoor_C_DestroyDoor) == 0x000008, "Wrong alignment on BP_InteractableDoor_C_DestroyDoor");
static_assert(sizeof(BP_InteractableDoor_C_DestroyDoor) == 0x000018, "Wrong size on BP_InteractableDoor_C_DestroyDoor");
static_assert(offsetof(BP_InteractableDoor_C_DestroyDoor, Origin) == 0x000000, "Member 'BP_InteractableDoor_C_DestroyDoor::Origin' has a wrong offset!");

// Function BP_InteractableDoor.BP_InteractableDoor_C.ExecuteUbergraph_BP_InteractableDoor
// 0x01D0 (0x01D0 - 0x0000)
struct BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_OpenProgress;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Origin;                         // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           CallFunc_GetDoorMeshes_Meshes;                     // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	ECollisionResponse                            Temp_byte_Variable_1;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           CallFunc_GetDoorMeshes_Meshes_1;                   // 0x0108(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            K2Node_Select_Default;                             // 0x0126(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0127(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Interactor;                     // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerCharacter_C*                K2Node_Event_Player;                               // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetOpeningSide_OpeningSide;               // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_CustomEvent_BridgeClass;                    // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0150(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_NavigationBridge_C*                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C2[0x2];                                      // 0x01C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateDoor_OpenProgress_ImplicitCast;     // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor) == 0x000010, "Wrong alignment on BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor");
static_assert(sizeof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor) == 0x0001D0, "Wrong size on BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, EntryPoint) == 0x000000, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_HasAuthority_ReturnValue) == 0x00001C, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, K2Node_CustomEvent_OpenProgress) == 0x000020, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::K2Node_CustomEvent_OpenProgress' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, Temp_byte_Variable) == 0x000028, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, K2Node_CustomEvent_Origin) == 0x000030, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::K2Node_CustomEvent_Origin' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_GetDoorMeshes_Meshes) == 0x000048, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_GetDoorMeshes_Meshes' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, Temp_byte_Variable_1) == 0x000058, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_Array_Get_Item) == 0x000060, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000068, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000080, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_Normal_ReturnValue) == 0x0000A0, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_Less_IntInt_ReturnValue) == 0x0000B8, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, Temp_bool_Variable) == 0x0000B9, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0000C0, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000D8, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000F0, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_GetDoorMeshes_Meshes_1) == 0x000108, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_GetDoorMeshes_Meshes_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_Array_Get_Item_1) == 0x000118, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_Array_Length_ReturnValue_1) == 0x000120, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_Less_IntInt_ReturnValue_1) == 0x000124, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_BooleanOR_ReturnValue) == 0x000125, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, K2Node_Select_Default) == 0x000126, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_BooleanOR_ReturnValue_1) == 0x000127, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, K2Node_CustomEvent_Interactor) == 0x000128, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::K2Node_CustomEvent_Interactor' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, K2Node_Event_Player) == 0x000130, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_GetOpeningSide_OpeningSide) == 0x000138, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_GetOpeningSide_OpeningSide' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, K2Node_CustomEvent_BridgeClass) == 0x000140, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::K2Node_CustomEvent_BridgeClass' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_Not_PreBool_ReturnValue) == 0x000148, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_BooleanAND_ReturnValue) == 0x000149, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_GetTransform_ReturnValue) == 0x000150, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001B0, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001B8, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_IsValid_ReturnValue) == 0x0001C0, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, K2Node_SwitchEnum_CmpSuccess) == 0x0001C1, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_Delay_Duration_ImplicitCast) == 0x0001C4, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor, CallFunc_UpdateDoor_OpenProgress_ImplicitCast) == 0x0001C8, "Member 'BP_InteractableDoor_C_ExecuteUbergraph_BP_InteractableDoor::CallFunc_UpdateDoor_OpenProgress_ImplicitCast' has a wrong offset!");

// Function BP_InteractableDoor.BP_InteractableDoor_C.GetDoorMeshes
// 0x0010 (0x0010 - 0x0000)
struct BP_InteractableDoor_C_GetDoorMeshes final
{
public:
	TArray<class UStaticMeshComponent*>           Meshes;                                            // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
};
static_assert(alignof(BP_InteractableDoor_C_GetDoorMeshes) == 0x000008, "Wrong alignment on BP_InteractableDoor_C_GetDoorMeshes");
static_assert(sizeof(BP_InteractableDoor_C_GetDoorMeshes) == 0x000010, "Wrong size on BP_InteractableDoor_C_GetDoorMeshes");
static_assert(offsetof(BP_InteractableDoor_C_GetDoorMeshes, Meshes) == 0x000000, "Member 'BP_InteractableDoor_C_GetDoorMeshes::Meshes' has a wrong offset!");

// Function BP_InteractableDoor.BP_InteractableDoor_C.GetInteractText
// 0x0018 (0x0018 - 0x0000)
struct BP_InteractableDoor_C_GetInteractText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(Parm, OutParm)
};
static_assert(alignof(BP_InteractableDoor_C_GetInteractText) == 0x000008, "Wrong alignment on BP_InteractableDoor_C_GetInteractText");
static_assert(sizeof(BP_InteractableDoor_C_GetInteractText) == 0x000018, "Wrong size on BP_InteractableDoor_C_GetInteractText");
static_assert(offsetof(BP_InteractableDoor_C_GetInteractText, Text) == 0x000000, "Member 'BP_InteractableDoor_C_GetInteractText::Text' has a wrong offset!");

// Function BP_InteractableDoor.BP_InteractableDoor_C.GetOpeningSide
// 0x0098 (0x0098 - 0x0000)
struct BP_InteractableDoor_C_GetOpeningSide final
{
public:
	class AActor*                                 Interactor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          OpeningSide_0;                                     // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableDoor_C_GetOpeningSide) == 0x000008, "Wrong alignment on BP_InteractableDoor_C_GetOpeningSide");
static_assert(sizeof(BP_InteractableDoor_C_GetOpeningSide) == 0x000098, "Wrong size on BP_InteractableDoor_C_GetOpeningSide");
static_assert(offsetof(BP_InteractableDoor_C_GetOpeningSide, Interactor) == 0x000000, "Member 'BP_InteractableDoor_C_GetOpeningSide::Interactor' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_GetOpeningSide, OpeningSide_0) == 0x000008, "Member 'BP_InteractableDoor_C_GetOpeningSide::OpeningSide_0' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_GetOpeningSide, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'BP_InteractableDoor_C_GetOpeningSide::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_GetOpeningSide, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_InteractableDoor_C_GetOpeningSide::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_GetOpeningSide, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000028, "Member 'BP_InteractableDoor_C_GetOpeningSide::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_GetOpeningSide, CallFunc_GetActorForwardVector_ReturnValue) == 0x000040, "Member 'BP_InteractableDoor_C_GetOpeningSide::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_GetOpeningSide, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000058, "Member 'BP_InteractableDoor_C_GetOpeningSide::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_GetOpeningSide, CallFunc_Normal_ReturnValue) == 0x000070, "Member 'BP_InteractableDoor_C_GetOpeningSide::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_GetOpeningSide, CallFunc_Dot_VectorVector_ReturnValue) == 0x000088, "Member 'BP_InteractableDoor_C_GetOpeningSide::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_GetOpeningSide, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000090, "Member 'BP_InteractableDoor_C_GetOpeningSide::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_InteractableDoor.BP_InteractableDoor_C.Interact
// 0x0008 (0x0008 - 0x0000)
struct BP_InteractableDoor_C_Interact final
{
public:
	class ABP_UPPlayerCharacter_C*                Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableDoor_C_Interact) == 0x000008, "Wrong alignment on BP_InteractableDoor_C_Interact");
static_assert(sizeof(BP_InteractableDoor_C_Interact) == 0x000008, "Wrong size on BP_InteractableDoor_C_Interact");
static_assert(offsetof(BP_InteractableDoor_C_Interact, Player) == 0x000000, "Member 'BP_InteractableDoor_C_Interact::Player' has a wrong offset!");

// Function BP_InteractableDoor.BP_InteractableDoor_C.IsOpen
// 0x0002 (0x0002 - 0x0000)
struct BP_InteractableDoor_C_IsOpen final
{
public:
	bool                                          Open;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableDoor_C_IsOpen) == 0x000001, "Wrong alignment on BP_InteractableDoor_C_IsOpen");
static_assert(sizeof(BP_InteractableDoor_C_IsOpen) == 0x000002, "Wrong size on BP_InteractableDoor_C_IsOpen");
static_assert(offsetof(BP_InteractableDoor_C_IsOpen, Open) == 0x000000, "Member 'BP_InteractableDoor_C_IsOpen::Open' has a wrong offset!");
static_assert(offsetof(BP_InteractableDoor_C_IsOpen, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'BP_InteractableDoor_C_IsOpen::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_InteractableDoor.BP_InteractableDoor_C.SpawnBridge
// 0x0008 (0x0008 - 0x0000)
struct BP_InteractableDoor_C_SpawnBridge final
{
public:
	class UClass*                                 BridgeClass;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableDoor_C_SpawnBridge) == 0x000008, "Wrong alignment on BP_InteractableDoor_C_SpawnBridge");
static_assert(sizeof(BP_InteractableDoor_C_SpawnBridge) == 0x000008, "Wrong size on BP_InteractableDoor_C_SpawnBridge");
static_assert(offsetof(BP_InteractableDoor_C_SpawnBridge, BridgeClass) == 0x000000, "Member 'BP_InteractableDoor_C_SpawnBridge::BridgeClass' has a wrong offset!");

// Function BP_InteractableDoor.BP_InteractableDoor_C.ToggleState
// 0x0008 (0x0008 - 0x0000)
struct BP_InteractableDoor_C_ToggleState final
{
public:
	class AActor*                                 Interactor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableDoor_C_ToggleState) == 0x000008, "Wrong alignment on BP_InteractableDoor_C_ToggleState");
static_assert(sizeof(BP_InteractableDoor_C_ToggleState) == 0x000008, "Wrong size on BP_InteractableDoor_C_ToggleState");
static_assert(offsetof(BP_InteractableDoor_C_ToggleState, Interactor) == 0x000000, "Member 'BP_InteractableDoor_C_ToggleState::Interactor' has a wrong offset!");

// Function BP_InteractableDoor.BP_InteractableDoor_C.UpdateDoor
// 0x0008 (0x0008 - 0x0000)
struct BP_InteractableDoor_C_UpdateDoor final
{
public:
	double                                        OpenProgress;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableDoor_C_UpdateDoor) == 0x000008, "Wrong alignment on BP_InteractableDoor_C_UpdateDoor");
static_assert(sizeof(BP_InteractableDoor_C_UpdateDoor) == 0x000008, "Wrong size on BP_InteractableDoor_C_UpdateDoor");
static_assert(offsetof(BP_InteractableDoor_C_UpdateDoor, OpenProgress) == 0x000000, "Member 'BP_InteractableDoor_C_UpdateDoor::OpenProgress' has a wrong offset!");

}

