#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteriorModuleBounds

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_InteriorModuleBounds.BP_InteriorModuleBounds_C.CreateConnection
// 0x0180 (0x0180 - 0x0000)
struct BP_InteriorModuleBounds_C_CreateConnection final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0020(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    CallFunc_AddComponent_ReturnValue;                 // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0090(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_InteriorModuleBounds_C_CreateConnection) == 0x000010, "Wrong alignment on BP_InteriorModuleBounds_C_CreateConnection");
static_assert(sizeof(BP_InteriorModuleBounds_C_CreateConnection) == 0x000180, "Wrong size on BP_InteriorModuleBounds_C_CreateConnection");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnection, Location) == 0x000000, "Member 'BP_InteriorModuleBounds_C_CreateConnection::Location' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnection, Temp_struct_Variable) == 0x000020, "Member 'BP_InteriorModuleBounds_C_CreateConnection::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnection, CallFunc_AddComponent_ReturnValue) == 0x000080, "Member 'BP_InteriorModuleBounds_C_CreateConnection::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnection, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000088, "Member 'BP_InteriorModuleBounds_C_CreateConnection::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnection, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000090, "Member 'BP_InteriorModuleBounds_C_CreateConnection::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

// Function BP_InteriorModuleBounds.BP_InteriorModuleBounds_C.CreateConnectionsX
// 0x00D8 (0x00D8 - 0x0000)
struct BP_InteriorModuleBounds_C_CreateConnectionsX final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteriorModuleBounds_C_CreateConnectionsX) == 0x000008, "Wrong alignment on BP_InteriorModuleBounds_C_CreateConnectionsX");
static_assert(sizeof(BP_InteriorModuleBounds_C_CreateConnectionsX) == 0x0000D8, "Wrong size on BP_InteriorModuleBounds_C_CreateConnectionsX");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsX, Temp_int_Variable) == 0x000000, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsX::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsX, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsX::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsX, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsX::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsX, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsX::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsX, Temp_int_Variable_1) == 0x00001C, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsX::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsX, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000020, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsX::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsX, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsX::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsX, CallFunc_MakeVector_ReturnValue) == 0x000030, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsX::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsX, Temp_int_Array_Index_Variable) == 0x000048, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsX::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsX, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsX::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsX, CallFunc_Add_IntInt_ReturnValue_2) == 0x000050, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsX::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsX, CallFunc_Subtract_IntInt_ReturnValue) == 0x000054, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsX::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsX, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000058, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsX::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsX, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00005C, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsX::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsX, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000060, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsX::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsX, K2Node_MakeArray_Array) == 0x000068, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsX::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsX, CallFunc_Array_Get_Item) == 0x000078, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsX::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsX, CallFunc_Array_Length_ReturnValue) == 0x00007C, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsX::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsX, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000080, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsX::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsX, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsX::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsX, CallFunc_MakeVector_ReturnValue_1) == 0x000090, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsX::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsX, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000A8, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsX::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsX, CallFunc_Add_VectorVector_ReturnValue) == 0x0000C0, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsX::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function BP_InteriorModuleBounds.BP_InteriorModuleBounds_C.CreateConnectionsY
// 0x00E0 (0x00E0 - 0x0000)
struct BP_InteriorModuleBounds_C_CreateConnectionsY final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteriorModuleBounds_C_CreateConnectionsY) == 0x000008, "Wrong alignment on BP_InteriorModuleBounds_C_CreateConnectionsY");
static_assert(sizeof(BP_InteriorModuleBounds_C_CreateConnectionsY) == 0x0000E0, "Wrong size on BP_InteriorModuleBounds_C_CreateConnectionsY");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsY, Temp_int_Variable) == 0x000000, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsY::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsY, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsY::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsY, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsY::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsY, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsY::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsY, Temp_int_Variable_1) == 0x00001C, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsY::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsY, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000020, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsY::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsY, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsY::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsY, CallFunc_MakeVector_ReturnValue) == 0x000030, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsY::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsY, Temp_int_Array_Index_Variable) == 0x000048, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsY::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsY, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsY::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsY, CallFunc_Add_IntInt_ReturnValue_2) == 0x000050, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsY::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsY, CallFunc_Subtract_IntInt_ReturnValue) == 0x000054, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsY::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsY, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000058, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsY::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsY, K2Node_MakeArray_Array) == 0x000060, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsY::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsY, CallFunc_Array_Get_Item) == 0x000070, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsY::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsY, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsY::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsY, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000078, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsY::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsY, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsY::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsY, CallFunc_MakeVector_ReturnValue_1) == 0x000088, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsY::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsY, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000A0, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsY::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsY, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000B8, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsY::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsY, CallFunc_Add_VectorVector_ReturnValue) == 0x0000C0, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsY::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_CreateConnectionsY, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000D8, "Member 'BP_InteriorModuleBounds_C_CreateConnectionsY::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_InteriorModuleBounds.BP_InteriorModuleBounds_C.ExecuteUbergraph_BP_InteriorModuleBounds
// 0x0098 (0x0098 - 0x0000)
struct BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReadyToLoad_Result;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UWorld>                  CallFunc_Array_Random_OutItem;                     // 0x0008(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_NewGuid_ReturnValue;                      // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_GuidToString_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LoadLevelInstanceBySoftObjectPtr_bOutSuccess; // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreamingDynamic*                 CallFunc_LoadLevelInstanceBySoftObjectPtr_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds) == 0x000008, "Wrong alignment on BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds");
static_assert(sizeof(BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds) == 0x000098, "Wrong size on BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds");
static_assert(offsetof(BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds, EntryPoint) == 0x000000, "Member 'BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds, CallFunc_IsReadyToLoad_Result) == 0x000004, "Member 'BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds::CallFunc_IsReadyToLoad_Result' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds, CallFunc_HasAuthority_ReturnValue) == 0x000005, "Member 'BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds, CallFunc_Array_Random_OutItem) == 0x000008, "Member 'BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds, CallFunc_Array_Random_OutIndex) == 0x000030, "Member 'BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000034, "Member 'BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds, CallFunc_NewGuid_ReturnValue) == 0x000038, "Member 'BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds::CallFunc_NewGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds, CallFunc_Conv_GuidToString_ReturnValue) == 0x000048, "Member 'BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds::CallFunc_Conv_GuidToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000058, "Member 'BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000070, "Member 'BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds, CallFunc_LoadLevelInstanceBySoftObjectPtr_bOutSuccess) == 0x000088, "Member 'BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds::CallFunc_LoadLevelInstanceBySoftObjectPtr_bOutSuccess' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds, CallFunc_LoadLevelInstanceBySoftObjectPtr_ReturnValue) == 0x000090, "Member 'BP_InteriorModuleBounds_C_ExecuteUbergraph_BP_InteriorModuleBounds::CallFunc_LoadLevelInstanceBySoftObjectPtr_ReturnValue' has a wrong offset!");

// Function BP_InteriorModuleBounds.BP_InteriorModuleBounds_C.IsOnBorder
// 0x0010 (0x0010 - 0x0000)
struct BP_InteriorModuleBounds_C_IsOnBorder final
{
public:
	int32                                         X;                                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Y;                                                 // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Z;                                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteriorModuleBounds_C_IsOnBorder) == 0x000004, "Wrong alignment on BP_InteriorModuleBounds_C_IsOnBorder");
static_assert(sizeof(BP_InteriorModuleBounds_C_IsOnBorder) == 0x000010, "Wrong size on BP_InteriorModuleBounds_C_IsOnBorder");
static_assert(offsetof(BP_InteriorModuleBounds_C_IsOnBorder, X) == 0x000000, "Member 'BP_InteriorModuleBounds_C_IsOnBorder::X' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_IsOnBorder, Y) == 0x000004, "Member 'BP_InteriorModuleBounds_C_IsOnBorder::Y' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_IsOnBorder, Z) == 0x000008, "Member 'BP_InteriorModuleBounds_C_IsOnBorder::Z' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_IsOnBorder, Result) == 0x00000C, "Member 'BP_InteriorModuleBounds_C_IsOnBorder::Result' has a wrong offset!");

// Function BP_InteriorModuleBounds.BP_InteriorModuleBounds_C.IsReadyToLoad
// 0x0008 (0x0008 - 0x0000)
struct BP_InteriorModuleBounds_C_IsReadyToLoad final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteriorModuleBounds_C_IsReadyToLoad) == 0x000001, "Wrong alignment on BP_InteriorModuleBounds_C_IsReadyToLoad");
static_assert(sizeof(BP_InteriorModuleBounds_C_IsReadyToLoad) == 0x000008, "Wrong size on BP_InteriorModuleBounds_C_IsReadyToLoad");
static_assert(offsetof(BP_InteriorModuleBounds_C_IsReadyToLoad, Result) == 0x000000, "Member 'BP_InteriorModuleBounds_C_IsReadyToLoad::Result' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_IsReadyToLoad, CallFunc_IsEmpty_ReturnValue) == 0x000001, "Member 'BP_InteriorModuleBounds_C_IsReadyToLoad::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_IsReadyToLoad, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000002, "Member 'BP_InteriorModuleBounds_C_IsReadyToLoad::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_IsReadyToLoad, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'BP_InteriorModuleBounds_C_IsReadyToLoad::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_IsReadyToLoad, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_InteriorModuleBounds_C_IsReadyToLoad::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_IsReadyToLoad, CallFunc_Not_PreBool_ReturnValue_1) == 0x000005, "Member 'BP_InteriorModuleBounds_C_IsReadyToLoad::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_IsReadyToLoad, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'BP_InteriorModuleBounds_C_IsReadyToLoad::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_IsReadyToLoad, CallFunc_BooleanAND_ReturnValue_1) == 0x000007, "Member 'BP_InteriorModuleBounds_C_IsReadyToLoad::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BP_InteriorModuleBounds.BP_InteriorModuleBounds_C.UpdateConnections
// 0x0038 (0x0038 - 0x0000)
struct BP_InteriorModuleBounds_C_UpdateConnections final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteriorModuleBounds_C_UpdateConnections) == 0x000008, "Wrong alignment on BP_InteriorModuleBounds_C_UpdateConnections");
static_assert(sizeof(BP_InteriorModuleBounds_C_UpdateConnections) == 0x000038, "Wrong size on BP_InteriorModuleBounds_C_UpdateConnections");
static_assert(offsetof(BP_InteriorModuleBounds_C_UpdateConnections, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_InteriorModuleBounds_C_UpdateConnections::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_UpdateConnections, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_InteriorModuleBounds_C_UpdateConnections::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_UpdateConnections, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_InteriorModuleBounds_C_UpdateConnections::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_UpdateConnections, CallFunc_GetChildrenComponents_Children) == 0x000010, "Member 'BP_InteriorModuleBounds_C_UpdateConnections::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_UpdateConnections, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_InteriorModuleBounds_C_UpdateConnections::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_UpdateConnections, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_InteriorModuleBounds_C_UpdateConnections::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_UpdateConnections, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_InteriorModuleBounds_C_UpdateConnections::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_InteriorModuleBounds.BP_InteriorModuleBounds_C.UserConstructionScript
// 0x0148 (0x0148 - 0x0000)
struct BP_InteriorModuleBounds_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_IntVectorToVector_ReturnValue;       // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0060(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_InteriorModuleBounds_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_InteriorModuleBounds_C_UserConstructionScript");
static_assert(sizeof(BP_InteriorModuleBounds_C_UserConstructionScript) == 0x000148, "Wrong size on BP_InteriorModuleBounds_C_UserConstructionScript");
static_assert(offsetof(BP_InteriorModuleBounds_C_UserConstructionScript, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000000, "Member 'BP_InteriorModuleBounds_C_UserConstructionScript::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteriorModuleBounds_C_UserConstructionScript, CallFunc_Conv_IntVectorToVector_ReturnValue) == 0x000018, "Member 'BP_InteriorModuleBounds_C_UserConstructionScript::CallFunc_Conv_IntVectorToVector_ReturnValue' has a wrong offset!");
