#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InputsSettings

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InputsSettings.BP_InputsSettings_C
// 0x0010 (0x0038 - 0x0028)
class UBP_InputsSettings_C final : public USaveGame
{
public:
	double                                        LookSensitivity;                                   // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InvertMouseX;                                      // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InvertMouseY;                                      // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InputsSettings_C">();
	}
	static class UBP_InputsSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_InputsSettings_C>();
	}
};
static_assert(alignof(UBP_InputsSettings_C) == 0x000008, "Wrong alignment on UBP_InputsSettings_C");
static_assert(sizeof(UBP_InputsSettings_C) == 0x000038, "Wrong size on UBP_InputsSettings_C");
static_assert(offsetof(UBP_InputsSettings_C, LookSensitivity) == 0x000028, "Member 'UBP_InputsSettings_C::LookSensitivity' has a wrong offset!");
static_assert(offsetof(UBP_InputsSettings_C, InvertMouseX) == 0x000030, "Member 'UBP_InputsSettings_C::InvertMouseX' has a wrong offset!");
static_assert(offsetof(UBP_InputsSettings_C, InvertMouseY) == 0x000031, "Member 'UBP_InputsSettings_C::InvertMouseY' has a wrong offset!");

}

