#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_KillableCharacter

#include "Basic.hpp"

#include "E_Dismemberment_structs.hpp"
#include "E_ScoringActorState_structs.hpp"
#include "S_FrozenRagdoll_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_DeathType_structs.hpp"


namespace SDK::Params
{

// Function BP_KillableCharacter.BP_KillableCharacter_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_KillableCharacter_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KillableCharacter_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_KillableCharacter_C_ReceiveTick");
static_assert(sizeof(BP_KillableCharacter_C_ReceiveTick) == 0x000004, "Wrong size on BP_KillableCharacter_C_ReceiveTick");
static_assert(offsetof(BP_KillableCharacter_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_KillableCharacter_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_KillableCharacter.BP_KillableCharacter_C.GetEyesLocation
// 0x0070 (0x0070 - 0x0000)
struct BP_KillableCharacter_C_GetEyesLocation final
{
public:
	struct FVector                                EyesLocation;                                      // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KillableCharacter_C_GetEyesLocation) == 0x000008, "Wrong alignment on BP_KillableCharacter_C_GetEyesLocation");
static_assert(sizeof(BP_KillableCharacter_C_GetEyesLocation) == 0x000070, "Wrong size on BP_KillableCharacter_C_GetEyesLocation");
static_assert(offsetof(BP_KillableCharacter_C_GetEyesLocation, EyesLocation) == 0x000000, "Member 'BP_KillableCharacter_C_GetEyesLocation::EyesLocation' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_GetEyesLocation, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x000018, "Member 'BP_KillableCharacter_C_GetEyesLocation::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_GetEyesLocation, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'BP_KillableCharacter_C_GetEyesLocation::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_GetEyesLocation, CallFunc_MakeVector_ReturnValue) == 0x000038, "Member 'BP_KillableCharacter_C_GetEyesLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_GetEyesLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x000050, "Member 'BP_KillableCharacter_C_GetEyesLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_GetEyesLocation, CallFunc_MakeVector_Z_ImplicitCast) == 0x000068, "Member 'BP_KillableCharacter_C_GetEyesLocation::CallFunc_MakeVector_Z_ImplicitCast' has a wrong offset!");

// Function BP_KillableCharacter.BP_KillableCharacter_C.GetDefaultScoringState
// 0x0001 (0x0001 - 0x0000)
struct BP_KillableCharacter_C_GetDefaultScoringState final
{
public:
	E_ScoringActorState                           State;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KillableCharacter_C_GetDefaultScoringState) == 0x000001, "Wrong alignment on BP_KillableCharacter_C_GetDefaultScoringState");
static_assert(sizeof(BP_KillableCharacter_C_GetDefaultScoringState) == 0x000001, "Wrong size on BP_KillableCharacter_C_GetDefaultScoringState");
static_assert(offsetof(BP_KillableCharacter_C_GetDefaultScoringState, State) == 0x000000, "Member 'BP_KillableCharacter_C_GetDefaultScoringState::State' has a wrong offset!");

// Function BP_KillableCharacter.BP_KillableCharacter_C.EnableRagdoll
// 0x0020 (0x0020 - 0x0000)
struct BP_KillableCharacter_C_EnableRagdoll final
{
public:
	struct FVector                                SourceLocation;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Force;                                             // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KillableCharacter_C_EnableRagdoll) == 0x000008, "Wrong alignment on BP_KillableCharacter_C_EnableRagdoll");
static_assert(sizeof(BP_KillableCharacter_C_EnableRagdoll) == 0x000020, "Wrong size on BP_KillableCharacter_C_EnableRagdoll");
static_assert(offsetof(BP_KillableCharacter_C_EnableRagdoll, SourceLocation) == 0x000000, "Member 'BP_KillableCharacter_C_EnableRagdoll::SourceLocation' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_EnableRagdoll, Force) == 0x000018, "Member 'BP_KillableCharacter_C_EnableRagdoll::Force' has a wrong offset!");

// Function BP_KillableCharacter.BP_KillableCharacter_C.KnockOut
// 0x0008 (0x0008 - 0x0000)
struct BP_KillableCharacter_C_KnockOut final
{
public:
	double                                        Duration;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KillableCharacter_C_KnockOut) == 0x000008, "Wrong alignment on BP_KillableCharacter_C_KnockOut");
static_assert(sizeof(BP_KillableCharacter_C_KnockOut) == 0x000008, "Wrong size on BP_KillableCharacter_C_KnockOut");
static_assert(offsetof(BP_KillableCharacter_C_KnockOut, Duration) == 0x000000, "Member 'BP_KillableCharacter_C_KnockOut::Duration' has a wrong offset!");

// Function BP_KillableCharacter.BP_KillableCharacter_C.GetInteractNoise
// 0x0010 (0x0010 - 0x0000)
struct BP_KillableCharacter_C_GetInteractNoise final
{
public:
	bool                                          NoiseOnInteract;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NoiseRange;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KillableCharacter_C_GetInteractNoise) == 0x000008, "Wrong alignment on BP_KillableCharacter_C_GetInteractNoise");
static_assert(sizeof(BP_KillableCharacter_C_GetInteractNoise) == 0x000010, "Wrong size on BP_KillableCharacter_C_GetInteractNoise");
static_assert(offsetof(BP_KillableCharacter_C_GetInteractNoise, NoiseOnInteract) == 0x000000, "Member 'BP_KillableCharacter_C_GetInteractNoise::NoiseOnInteract' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_GetInteractNoise, NoiseRange) == 0x000008, "Member 'BP_KillableCharacter_C_GetInteractNoise::NoiseRange' has a wrong offset!");

// Function BP_KillableCharacter.BP_KillableCharacter_C.GetInteractText
// 0x0018 (0x0018 - 0x0000)
struct BP_KillableCharacter_C_GetInteractText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(Parm, OutParm)
};
static_assert(alignof(BP_KillableCharacter_C_GetInteractText) == 0x000008, "Wrong alignment on BP_KillableCharacter_C_GetInteractText");
static_assert(sizeof(BP_KillableCharacter_C_GetInteractText) == 0x000018, "Wrong size on BP_KillableCharacter_C_GetInteractText");
static_assert(offsetof(BP_KillableCharacter_C_GetInteractText, Text) == 0x000000, "Member 'BP_KillableCharacter_C_GetInteractText::Text' has a wrong offset!");

// Function BP_KillableCharacter.BP_KillableCharacter_C.GetInteractDistance
// 0x0010 (0x0010 - 0x0000)
struct BP_KillableCharacter_C_GetInteractDistance final
{
public:
	double                                        Distance;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KillableCharacter_C_GetInteractDistance) == 0x000008, "Wrong alignment on BP_KillableCharacter_C_GetInteractDistance");
static_assert(sizeof(BP_KillableCharacter_C_GetInteractDistance) == 0x000010, "Wrong size on BP_KillableCharacter_C_GetInteractDistance");
static_assert(offsetof(BP_KillableCharacter_C_GetInteractDistance, Distance) == 0x000000, "Member 'BP_KillableCharacter_C_GetInteractDistance::Distance' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_GetInteractDistance, CallFunc_BooleanAND_ReturnValue) == 0x000008, "Member 'BP_KillableCharacter_C_GetInteractDistance::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_GetInteractDistance, CallFunc_BooleanAND_ReturnValue_1) == 0x000009, "Member 'BP_KillableCharacter_C_GetInteractDistance::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BP_KillableCharacter.BP_KillableCharacter_C.GetInteractDuration
// 0x0008 (0x0008 - 0x0000)
struct BP_KillableCharacter_C_GetInteractDuration final
{
public:
	double                                        Duration;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KillableCharacter_C_GetInteractDuration) == 0x000008, "Wrong alignment on BP_KillableCharacter_C_GetInteractDuration");
static_assert(sizeof(BP_KillableCharacter_C_GetInteractDuration) == 0x000008, "Wrong size on BP_KillableCharacter_C_GetInteractDuration");
static_assert(offsetof(BP_KillableCharacter_C_GetInteractDuration, Duration) == 0x000000, "Member 'BP_KillableCharacter_C_GetInteractDuration::Duration' has a wrong offset!");

// Function BP_KillableCharacter.BP_KillableCharacter_C.IsDead
// 0x0001 (0x0001 - 0x0000)
struct BP_KillableCharacter_C_IsDead final
{
public:
	bool                                          Dead_0;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KillableCharacter_C_IsDead) == 0x000001, "Wrong alignment on BP_KillableCharacter_C_IsDead");
static_assert(sizeof(BP_KillableCharacter_C_IsDead) == 0x000001, "Wrong size on BP_KillableCharacter_C_IsDead");
static_assert(offsetof(BP_KillableCharacter_C_IsDead, Dead_0) == 0x000000, "Member 'BP_KillableCharacter_C_IsDead::Dead_0' has a wrong offset!");

// Function BP_KillableCharacter.BP_KillableCharacter_C.ResetRagdollVelocities
// 0x0010 (0x0010 - 0x0000)
struct BP_KillableCharacter_C_ResetRagdollVelocities final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KillableCharacter_C_ResetRagdollVelocities) == 0x000004, "Wrong alignment on BP_KillableCharacter_C_ResetRagdollVelocities");
static_assert(sizeof(BP_KillableCharacter_C_ResetRagdollVelocities) == 0x000010, "Wrong size on BP_KillableCharacter_C_ResetRagdollVelocities");
static_assert(offsetof(BP_KillableCharacter_C_ResetRagdollVelocities, Temp_int_Variable) == 0x000000, "Member 'BP_KillableCharacter_C_ResetRagdollVelocities::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_ResetRagdollVelocities, CallFunc_Array_LastIndex_ReturnValue) == 0x000004, "Member 'BP_KillableCharacter_C_ResetRagdollVelocities::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_ResetRagdollVelocities, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_KillableCharacter_C_ResetRagdollVelocities::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_ResetRagdollVelocities, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_KillableCharacter_C_ResetRagdollVelocities::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_KillableCharacter.BP_KillableCharacter_C.ShouldSyncRagdoll
// 0x0090 (0x0090 - 0x0000)
struct BP_KillableCharacter_C_ShouldSyncRagdoll final
{
public:
	struct FS_FrozenRagdoll                       Ragdoll;                                           // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_DistanceSquared_ReturnValue;       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KillableCharacter_C_ShouldSyncRagdoll) == 0x000008, "Wrong alignment on BP_KillableCharacter_C_ShouldSyncRagdoll");
static_assert(sizeof(BP_KillableCharacter_C_ShouldSyncRagdoll) == 0x000090, "Wrong size on BP_KillableCharacter_C_ShouldSyncRagdoll");
static_assert(offsetof(BP_KillableCharacter_C_ShouldSyncRagdoll, Ragdoll) == 0x000000, "Member 'BP_KillableCharacter_C_ShouldSyncRagdoll::Ragdoll' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_ShouldSyncRagdoll, Result) == 0x000040, "Member 'BP_KillableCharacter_C_ShouldSyncRagdoll::Result' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_ShouldSyncRagdoll, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'BP_KillableCharacter_C_ShouldSyncRagdoll::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_ShouldSyncRagdoll, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'BP_KillableCharacter_C_ShouldSyncRagdoll::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_ShouldSyncRagdoll, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'BP_KillableCharacter_C_ShouldSyncRagdoll::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_ShouldSyncRagdoll, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_KillableCharacter_C_ShouldSyncRagdoll::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_ShouldSyncRagdoll, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_KillableCharacter_C_ShouldSyncRagdoll::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_ShouldSyncRagdoll, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'BP_KillableCharacter_C_ShouldSyncRagdoll::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_ShouldSyncRagdoll, CallFunc_Array_Length_ReturnValue_1) == 0x000074, "Member 'BP_KillableCharacter_C_ShouldSyncRagdoll::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_ShouldSyncRagdoll, CallFunc_Array_Length_ReturnValue_2) == 0x000078, "Member 'BP_KillableCharacter_C_ShouldSyncRagdoll::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_ShouldSyncRagdoll, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00007C, "Member 'BP_KillableCharacter_C_ShouldSyncRagdoll::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_ShouldSyncRagdoll, CallFunc_Vector_DistanceSquared_ReturnValue) == 0x000080, "Member 'BP_KillableCharacter_C_ShouldSyncRagdoll::CallFunc_Vector_DistanceSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_ShouldSyncRagdoll, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000088, "Member 'BP_KillableCharacter_C_ShouldSyncRagdoll::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_KillableCharacter.BP_KillableCharacter_C.GetLightDismembermentBone
// 0x0028 (0x0028 - 0x0000)
struct BP_KillableCharacter_C_GetLightDismembermentBone final
{
public:
	bool                                          Found;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BoneName;                                          // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   _BoneName;                                         // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Random_OutItem;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KillableCharacter_C_GetLightDismembermentBone) == 0x000004, "Wrong alignment on BP_KillableCharacter_C_GetLightDismembermentBone");
static_assert(sizeof(BP_KillableCharacter_C_GetLightDismembermentBone) == 0x000028, "Wrong size on BP_KillableCharacter_C_GetLightDismembermentBone");
static_assert(offsetof(BP_KillableCharacter_C_GetLightDismembermentBone, Found) == 0x000000, "Member 'BP_KillableCharacter_C_GetLightDismembermentBone::Found' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_GetLightDismembermentBone, BoneName) == 0x000004, "Member 'BP_KillableCharacter_C_GetLightDismembermentBone::BoneName' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_GetLightDismembermentBone, _BoneName) == 0x00000C, "Member 'BP_KillableCharacter_C_GetLightDismembermentBone::_BoneName' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_GetLightDismembermentBone, CallFunc_Array_RemoveItem_ReturnValue) == 0x000014, "Member 'BP_KillableCharacter_C_GetLightDismembermentBone::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_GetLightDismembermentBone, CallFunc_Array_Random_OutItem) == 0x000018, "Member 'BP_KillableCharacter_C_GetLightDismembermentBone::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_GetLightDismembermentBone, CallFunc_Array_Random_OutIndex) == 0x000020, "Member 'BP_KillableCharacter_C_GetLightDismembermentBone::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_GetLightDismembermentBone, CallFunc_Array_IsEmpty_ReturnValue) == 0x000024, "Member 'BP_KillableCharacter_C_GetLightDismembermentBone::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");

// Function BP_KillableCharacter.BP_KillableCharacter_C.GetEyesHeight
// 0x0018 (0x0018 - 0x0000)
struct BP_KillableCharacter_C_GetEyesHeight final
{
public:
	double                                        EyesHeight;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_FunctionResult_EyesHeight_ImplicitCast;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KillableCharacter_C_GetEyesHeight) == 0x000008, "Wrong alignment on BP_KillableCharacter_C_GetEyesHeight");
static_assert(sizeof(BP_KillableCharacter_C_GetEyesHeight) == 0x000018, "Wrong size on BP_KillableCharacter_C_GetEyesHeight");
static_assert(offsetof(BP_KillableCharacter_C_GetEyesHeight, EyesHeight) == 0x000000, "Member 'BP_KillableCharacter_C_GetEyesHeight::EyesHeight' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_GetEyesHeight, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x000008, "Member 'BP_KillableCharacter_C_GetEyesHeight::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_GetEyesHeight, K2Node_FunctionResult_EyesHeight_ImplicitCast) == 0x000010, "Member 'BP_KillableCharacter_C_GetEyesHeight::K2Node_FunctionResult_EyesHeight_ImplicitCast' has a wrong offset!");

// Function BP_KillableCharacter.BP_KillableCharacter_C.CheckIfChased
// 0x0028 (0x0028 - 0x0000)
struct BP_KillableCharacter_C_CheckIfChased final
{
public:
	bool                                          IsChased_0;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Parent_Enemy_C*                     CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KillableCharacter_C_CheckIfChased) == 0x000008, "Wrong alignment on BP_KillableCharacter_C_CheckIfChased");
static_assert(sizeof(BP_KillableCharacter_C_CheckIfChased) == 0x000028, "Wrong size on BP_KillableCharacter_C_CheckIfChased");
static_assert(offsetof(BP_KillableCharacter_C_CheckIfChased, IsChased_0) == 0x000000, "Member 'BP_KillableCharacter_C_CheckIfChased::IsChased_0' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_CheckIfChased, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_KillableCharacter_C_CheckIfChased::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_CheckIfChased, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_KillableCharacter_C_CheckIfChased::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_CheckIfChased, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_KillableCharacter_C_CheckIfChased::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_CheckIfChased, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_KillableCharacter_C_CheckIfChased::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_CheckIfChased, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_KillableCharacter_C_CheckIfChased::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_CheckIfChased, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'BP_KillableCharacter_C_CheckIfChased::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_CheckIfChased, CallFunc_Less_IntInt_ReturnValue) == 0x00001D, "Member 'BP_KillableCharacter_C_CheckIfChased::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_CheckIfChased, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00001E, "Member 'BP_KillableCharacter_C_CheckIfChased::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_CheckIfChased, CallFunc_Not_PreBool_ReturnValue) == 0x00001F, "Member 'BP_KillableCharacter_C_CheckIfChased::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_CheckIfChased, CallFunc_BooleanAND_ReturnValue) == 0x000020, "Member 'BP_KillableCharacter_C_CheckIfChased::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_CheckIfChased, CallFunc_BooleanAND_ReturnValue_1) == 0x000021, "Member 'BP_KillableCharacter_C_CheckIfChased::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_CheckIfChased, CallFunc_BooleanAND_ReturnValue_2) == 0x000022, "Member 'BP_KillableCharacter_C_CheckIfChased::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function BP_KillableCharacter.BP_KillableCharacter_C.PlaySkeletalAnim
// 0x0010 (0x0010 - 0x0000)
struct BP_KillableCharacter_C_PlaySkeletalAnim final
{
public:
	class UAnimationAsset*                        Anim;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bLooping;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KillableCharacter_C_PlaySkeletalAnim) == 0x000008, "Wrong alignment on BP_KillableCharacter_C_PlaySkeletalAnim");
static_assert(sizeof(BP_KillableCharacter_C_PlaySkeletalAnim) == 0x000010, "Wrong size on BP_KillableCharacter_C_PlaySkeletalAnim");
static_assert(offsetof(BP_KillableCharacter_C_PlaySkeletalAnim, Anim) == 0x000000, "Member 'BP_KillableCharacter_C_PlaySkeletalAnim::Anim' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_PlaySkeletalAnim, bLooping) == 0x000008, "Member 'BP_KillableCharacter_C_PlaySkeletalAnim::bLooping' has a wrong offset!");

// Function BP_KillableCharacter.BP_KillableCharacter_C.SetOverlayMaterial
// 0x0008 (0x0008 - 0x0000)
struct BP_KillableCharacter_C_SetOverlayMaterial final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KillableCharacter_C_SetOverlayMaterial) == 0x000008, "Wrong alignment on BP_KillableCharacter_C_SetOverlayMaterial");
static_assert(sizeof(BP_KillableCharacter_C_SetOverlayMaterial) == 0x000008, "Wrong size on BP_KillableCharacter_C_SetOverlayMaterial");
static_assert(offsetof(BP_KillableCharacter_C_SetOverlayMaterial, Material) == 0x000000, "Member 'BP_KillableCharacter_C_SetOverlayMaterial::Material' has a wrong offset!");

// Function BP_KillableCharacter.BP_KillableCharacter_C.SpawnBloodParticlesOnMesh
// 0x05F0 (0x05F0 - 0x0000)
struct BP_KillableCharacter_C_SpawnBloodParticlesOnMesh final
{
public:
	class FName                                   BoneName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Size;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkinnedMeshComponent*                  Mesh_0;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   _BrokenBoneName;                                   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             _AttachTransform;                                  // 0x0020(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   _AttachBoneName;                                   // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkinnedMeshComponent*                  _MeshToAttach;                                     // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAttached_ReturnValue;           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetBoneTransform_ReturnValue;             // 0x00C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x01B0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x02A0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetBoneTransform_ReturnValue_1;           // 0x0390(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_2;                // 0x03F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_2;                // 0x0408(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_2;                   // 0x0420(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetParentBone_ReturnValue;                // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0440(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0458(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0470(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_488[0x8];                                      // 0x0488(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0490(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_1;        // 0x04F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult_1;    // 0x04F8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh) == 0x000010, "Wrong alignment on BP_KillableCharacter_C_SpawnBloodParticlesOnMesh");
static_assert(sizeof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh) == 0x0005F0, "Wrong size on BP_KillableCharacter_C_SpawnBloodParticlesOnMesh");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, BoneName) == 0x000000, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::BoneName' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, Size) == 0x000008, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::Size' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, Mesh_0) == 0x000010, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::Mesh_0' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, _BrokenBoneName) == 0x000018, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::_BrokenBoneName' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, _AttachTransform) == 0x000020, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::_AttachTransform' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, _AttachBoneName) == 0x000080, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::_AttachBoneName' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, _MeshToAttach) == 0x000088, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::_MeshToAttach' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000098, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, CallFunc_SpawnDecalAttached_ReturnValue) == 0x0000B0, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::CallFunc_SpawnDecalAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, CallFunc_GetBoneTransform_ReturnValue) == 0x0000C0, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::CallFunc_GetBoneTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, CallFunc_BreakTransform_Location) == 0x000120, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, CallFunc_BreakTransform_Rotation) == 0x000138, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, CallFunc_BreakTransform_Scale) == 0x000150, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, CallFunc_BreakTransform_Location_1) == 0x000168, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, CallFunc_BreakTransform_Rotation_1) == 0x000180, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, CallFunc_BreakTransform_Scale_1) == 0x000198, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0001B0, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000298, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x0002A0, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, CallFunc_IsValid_ReturnValue_1) == 0x000388, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, CallFunc_GetBoneTransform_ReturnValue_1) == 0x000390, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::CallFunc_GetBoneTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, CallFunc_BreakTransform_Location_2) == 0x0003F0, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::CallFunc_BreakTransform_Location_2' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, CallFunc_BreakTransform_Rotation_2) == 0x000408, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::CallFunc_BreakTransform_Rotation_2' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, CallFunc_BreakTransform_Scale_2) == 0x000420, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::CallFunc_BreakTransform_Scale_2' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, CallFunc_GetParentBone_ReturnValue) == 0x000438, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::CallFunc_GetParentBone_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000440, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000458, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, CallFunc_VLerp_ReturnValue) == 0x000470, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, CallFunc_MakeTransform_ReturnValue) == 0x000490, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, CallFunc_SpawnSystemAttached_ReturnValue_1) == 0x0004F0, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::CallFunc_SpawnSystemAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, CallFunc_K2_SetWorldTransform_SweepHitResult_1) == 0x0004F8, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::CallFunc_K2_SetWorldTransform_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SpawnBloodParticlesOnMesh, CallFunc_IsValid_ReturnValue_2) == 0x0005E0, "Member 'BP_KillableCharacter_C_SpawnBloodParticlesOnMesh::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function BP_KillableCharacter.BP_KillableCharacter_C.SetCollisionsInternal
// 0x0010 (0x0010 - 0x0000)
struct BP_KillableCharacter_C_SetCollisionsInternal final
{
public:
	class FName                                   CapsulePreset;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MeshPreset;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KillableCharacter_C_SetCollisionsInternal) == 0x000004, "Wrong alignment on BP_KillableCharacter_C_SetCollisionsInternal");
static_assert(sizeof(BP_KillableCharacter_C_SetCollisionsInternal) == 0x000010, "Wrong size on BP_KillableCharacter_C_SetCollisionsInternal");
static_assert(offsetof(BP_KillableCharacter_C_SetCollisionsInternal, CapsulePreset) == 0x000000, "Member 'BP_KillableCharacter_C_SetCollisionsInternal::CapsulePreset' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_SetCollisionsInternal, MeshPreset) == 0x000008, "Member 'BP_KillableCharacter_C_SetCollisionsInternal::MeshPreset' has a wrong offset!");

// Function BP_KillableCharacter.BP_KillableCharacter_C.GetRagdollBoneIndex
// 0x000C (0x000C - 0x0000)
struct BP_KillableCharacter_C_GetRagdollBoneIndex final
{
public:
	int32                                         BodyIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BoneIndex;                                         // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KillableCharacter_C_GetRagdollBoneIndex) == 0x000004, "Wrong alignment on BP_KillableCharacter_C_GetRagdollBoneIndex");
static_assert(sizeof(BP_KillableCharacter_C_GetRagdollBoneIndex) == 0x00000C, "Wrong size on BP_KillableCharacter_C_GetRagdollBoneIndex");
static_assert(offsetof(BP_KillableCharacter_C_GetRagdollBoneIndex, BodyIndex) == 0x000000, "Member 'BP_KillableCharacter_C_GetRagdollBoneIndex::BodyIndex' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_GetRagdollBoneIndex, BoneIndex) == 0x000004, "Member 'BP_KillableCharacter_C_GetRagdollBoneIndex::BoneIndex' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_GetRagdollBoneIndex, CallFunc_Array_Get_Item) == 0x000008, "Member 'BP_KillableCharacter_C_GetRagdollBoneIndex::CallFunc_Array_Get_Item' has a wrong offset!");

// Function BP_KillableCharacter.BP_KillableCharacter_C.GetRecoverLocation
// 0x02A8 (0x02A8 - 0x0000)
struct BP_KillableCharacter_C_GetRecoverLocation final
{
public:
	struct FVector                                RecoverLocation;                                   // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARecastNavMesh*                         CallFunc_GetPawnNavData_NavData;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRagdollLocation_RagdollLocation;       // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0050(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0090(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17B[0x1];                                      // 0x017B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_ProjectPointToNavigation_ProjectedLocation; // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_ProjectPointToNavigation_ReturnValue;  // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast;                // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KillableCharacter_C_GetRecoverLocation) == 0x000008, "Wrong alignment on BP_KillableCharacter_C_GetRecoverLocation");
static_assert(sizeof(BP_KillableCharacter_C_GetRecoverLocation) == 0x0002A8, "Wrong size on BP_KillableCharacter_C_GetRecoverLocation");
static_assert(offsetof(BP_KillableCharacter_C_GetRecoverLocation, RecoverLocation) == 0x000000, "Member 'BP_KillableCharacter_C_GetRecoverLocation::RecoverLocation' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_GetRecoverLocation, CallFunc_GetPawnNavData_NavData) == 0x000018, "Member 'BP_KillableCharacter_C_GetRecoverLocation::CallFunc_GetPawnNavData_NavData' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_GetRecoverLocation, CallFunc_MakeVector_ReturnValue) == 0x000020, "Member 'BP_KillableCharacter_C_GetRecoverLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_GetRecoverLocation, CallFunc_GetRagdollLocation_RagdollLocation) == 0x000038, "Member 'BP_KillableCharacter_C_GetRecoverLocation::CallFunc_GetRagdollLocation_RagdollLocation' has a wrong offset!");
static_assert(offsetof(BP_KillableCharacter_C_GetRecoverLocation, Temp_object_Variable) == 0x000050, "Member 'BP_KillableCharacter_C_GetRecoverLocation::Temp_object_Variable' has a wrong offset!");
