#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LocalPlayerVoice

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LocalPlayerVoice.BP_LocalPlayerVoice_C
// 0x0028 (0x02C0 - 0x0298)
class ABP_LocalPlayerVoice_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOdinSynthComponent*                    LocalPlayerOdinSynth;                              // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOdinCaptureMedia*                      OdinCaptureMedia;                                  // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         LocalVoiceVolume;                                  // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExteriorVolumeMultiplier;                          // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InteriorVolumeMultiplier;                          // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_LocalPlayerVoice(int32 EntryPoint);
	void LocalAudioEnvelopeValueChanged(const float EnvelopeValue);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LocalPlayerVoice_C">();
	}
	static class ABP_LocalPlayerVoice_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LocalPlayerVoice_C>();
	}
};
static_assert(alignof(ABP_LocalPlayerVoice_C) == 0x000008, "Wrong alignment on ABP_LocalPlayerVoice_C");
static_assert(sizeof(ABP_LocalPlayerVoice_C) == 0x0002C0, "Wrong size on ABP_LocalPlayerVoice_C");
static_assert(offsetof(ABP_LocalPlayerVoice_C, UberGraphFrame) == 0x000298, "Member 'ABP_LocalPlayerVoice_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LocalPlayerVoice_C, LocalPlayerOdinSynth) == 0x0002A0, "Member 'ABP_LocalPlayerVoice_C::LocalPlayerOdinSynth' has a wrong offset!");
static_assert(offsetof(ABP_LocalPlayerVoice_C, OdinCaptureMedia) == 0x0002A8, "Member 'ABP_LocalPlayerVoice_C::OdinCaptureMedia' has a wrong offset!");
static_assert(offsetof(ABP_LocalPlayerVoice_C, LocalVoiceVolume) == 0x0002B0, "Member 'ABP_LocalPlayerVoice_C::LocalVoiceVolume' has a wrong offset!");
static_assert(offsetof(ABP_LocalPlayerVoice_C, ExteriorVolumeMultiplier) == 0x0002B4, "Member 'ABP_LocalPlayerVoice_C::ExteriorVolumeMultiplier' has a wrong offset!");
static_assert(offsetof(ABP_LocalPlayerVoice_C, InteriorVolumeMultiplier) == 0x0002B8, "Member 'ABP_LocalPlayerVoice_C::InteriorVolumeMultiplier' has a wrong offset!");

}

