#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Military_Patrol

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Military_Patrol.BP_Military_Patrol_C
// 0x0030 (0x02C8 - 0x0298)
class ABP_Military_Patrol_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Spawn_Soldier2;                                    // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Spawn_Soldier1;                                    // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Spawn_Captain;                                     // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_Military_Captain_C*                 Captain;                                           // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Military_Patrol(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Military_Patrol_C">();
	}
	static class ABP_Military_Patrol_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Military_Patrol_C>();
	}
};
static_assert(alignof(ABP_Military_Patrol_C) == 0x000008, "Wrong alignment on ABP_Military_Patrol_C");
static_assert(sizeof(ABP_Military_Patrol_C) == 0x0002C8, "Wrong size on ABP_Military_Patrol_C");
static_assert(offsetof(ABP_Military_Patrol_C, UberGraphFrame) == 0x000298, "Member 'ABP_Military_Patrol_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Military_Patrol_C, Spawn_Soldier2) == 0x0002A0, "Member 'ABP_Military_Patrol_C::Spawn_Soldier2' has a wrong offset!");
static_assert(offsetof(ABP_Military_Patrol_C, Spawn_Soldier1) == 0x0002A8, "Member 'ABP_Military_Patrol_C::Spawn_Soldier1' has a wrong offset!");
static_assert(offsetof(ABP_Military_Patrol_C, Spawn_Captain) == 0x0002B0, "Member 'ABP_Military_Patrol_C::Spawn_Captain' has a wrong offset!");
static_assert(offsetof(ABP_Military_Patrol_C, DefaultSceneRoot) == 0x0002B8, "Member 'ABP_Military_Patrol_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Military_Patrol_C, Captain) == 0x0002C0, "Member 'ABP_Military_Patrol_C::Captain' has a wrong offset!");

}

