#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Military_Soldier

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Military_Soldier.BP_Military_Soldier_C.CanShoot
// 0x0004 (0x0004 - 0x0000)
struct BP_Military_Soldier_C_CanShoot final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Military_Soldier_C_CanShoot) == 0x000001, "Wrong alignment on BP_Military_Soldier_C_CanShoot");
static_assert(sizeof(BP_Military_Soldier_C_CanShoot) == 0x000004, "Wrong size on BP_Military_Soldier_C_CanShoot");
static_assert(offsetof(BP_Military_Soldier_C_CanShoot, Value) == 0x000000, "Member 'BP_Military_Soldier_C_CanShoot::Value' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_CanShoot, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000001, "Member 'BP_Military_Soldier_C_CanShoot::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_CanShoot, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'BP_Military_Soldier_C_CanShoot::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_CanShoot, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'BP_Military_Soldier_C_CanShoot::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_Military_Soldier.BP_Military_Soldier_C.ExecuteUbergraph_BP_Military_Soldier
// 0x02F8 (0x02F8 - 0x0000)
struct BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_TargetActor;                          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBulletTrajectory_Origin;               // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBulletTrajectory_End;                  // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Military_Captain_C*                 CallFunc_GetActorOfClass_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x00F8(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleByProfile_OutHit;          // 0x0108(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleByProfile_ReturnValue;     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F3[0x1];                                      // 0x01F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0270(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_KillableCharacter_C*                K2Node_DynamicCast_AsBP_Killable_Character;        // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAffinity_Affinity;                     // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_ReportNoiseEvent_MaxRange_ImplicitCast;   // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier) == 0x000008, "Wrong alignment on BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier");
static_assert(sizeof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier) == 0x0002F8, "Wrong size on BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, EntryPoint) == 0x000000, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000008, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000038, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, K2Node_Event_TargetActor) == 0x000040, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::K2Node_Event_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_GetBulletTrajectory_Origin) == 0x000048, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_GetBulletTrajectory_Origin' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_GetBulletTrajectory_End) == 0x000060, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_GetBulletTrajectory_End' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000080, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_GetActorOfClass_ReturnValue) == 0x000088, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000090, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000098, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_K2_GetComponentRotation_ReturnValue_1) == 0x0000B0, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_K2_GetComponentRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000C8, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x0000D0, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0000E8, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, Temp_int_Variable) == 0x0000F0, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, Temp_object_Variable) == 0x0000F8, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_LineTraceSingleByProfile_OutHit) == 0x000108, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_LineTraceSingleByProfile_OutHit' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_LineTraceSingleByProfile_ReturnValue) == 0x0001F0, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_LineTraceSingleByProfile_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_BreakHitResult_bBlockingHit) == 0x0001F1, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001F2, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_BreakHitResult_Time) == 0x0001F4, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_BreakHitResult_Distance) == 0x0001F8, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_BreakHitResult_Location) == 0x000200, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_BreakHitResult_ImpactPoint) == 0x000218, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_BreakHitResult_Normal) == 0x000230, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_BreakHitResult_ImpactNormal) == 0x000248, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_BreakHitResult_PhysMat) == 0x000260, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_BreakHitResult_HitActor) == 0x000268, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_BreakHitResult_HitComponent) == 0x000270, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_BreakHitResult_HitBoneName) == 0x000278, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_BreakHitResult_BoneName) == 0x000280, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_BreakHitResult_HitItem) == 0x000288, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_BreakHitResult_ElementIndex) == 0x00028C, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_BreakHitResult_FaceIndex) == 0x000290, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_BreakHitResult_TraceStart) == 0x000298, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_BreakHitResult_TraceEnd) == 0x0002B0, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, K2Node_DynamicCast_AsBP_Killable_Character) == 0x0002C8, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::K2Node_DynamicCast_AsBP_Killable_Character' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, K2Node_DynamicCast_bSuccess) == 0x0002D0, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0002D8, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_GetAffinity_Affinity) == 0x0002F0, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_GetAffinity_Affinity' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier, CallFunc_ReportNoiseEvent_MaxRange_ImplicitCast) == 0x0002F4, "Member 'BP_Military_Soldier_C_ExecuteUbergraph_BP_Military_Soldier::CallFunc_ReportNoiseEvent_MaxRange_ImplicitCast' has a wrong offset!");

// Function BP_Military_Soldier.BP_Military_Soldier_C.GetBulletTrajectory
// 0x0138 (0x0138 - 0x0000)
struct BP_Military_Soldier_C_GetBulletTrajectory final
{
public:
	class AActor*                                 AimedTarget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Origin;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                End;                                               // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorEyesViewPoint_OutLocation;        // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetActorEyesViewPoint_OutRotation;        // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Military_Soldier_C_GetBulletTrajectory) == 0x000008, "Wrong alignment on BP_Military_Soldier_C_GetBulletTrajectory");
static_assert(sizeof(BP_Military_Soldier_C_GetBulletTrajectory) == 0x000138, "Wrong size on BP_Military_Soldier_C_GetBulletTrajectory");
static_assert(offsetof(BP_Military_Soldier_C_GetBulletTrajectory, AimedTarget) == 0x000000, "Member 'BP_Military_Soldier_C_GetBulletTrajectory::AimedTarget' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_GetBulletTrajectory, Origin) == 0x000008, "Member 'BP_Military_Soldier_C_GetBulletTrajectory::Origin' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_GetBulletTrajectory, End) == 0x000020, "Member 'BP_Military_Soldier_C_GetBulletTrajectory::End' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_GetBulletTrajectory, CallFunc_GetActorEyesViewPoint_OutLocation) == 0x000038, "Member 'BP_Military_Soldier_C_GetBulletTrajectory::CallFunc_GetActorEyesViewPoint_OutLocation' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_GetBulletTrajectory, CallFunc_GetActorEyesViewPoint_OutRotation) == 0x000050, "Member 'BP_Military_Soldier_C_GetBulletTrajectory::CallFunc_GetActorEyesViewPoint_OutRotation' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_GetBulletTrajectory, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000068, "Member 'BP_Military_Soldier_C_GetBulletTrajectory::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_GetBulletTrajectory, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000080, "Member 'BP_Military_Soldier_C_GetBulletTrajectory::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_GetBulletTrajectory, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000098, "Member 'BP_Military_Soldier_C_GetBulletTrajectory::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_GetBulletTrajectory, CallFunc_Normal_ReturnValue) == 0x0000B0, "Member 'BP_Military_Soldier_C_GetBulletTrajectory::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_GetBulletTrajectory, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000C8, "Member 'BP_Military_Soldier_C_GetBulletTrajectory::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_GetBulletTrajectory, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000D0, "Member 'BP_Military_Soldier_C_GetBulletTrajectory::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_GetBulletTrajectory, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0000E8, "Member 'BP_Military_Soldier_C_GetBulletTrajectory::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_GetBulletTrajectory, CallFunc_MakeVector_ReturnValue) == 0x0000F0, "Member 'BP_Military_Soldier_C_GetBulletTrajectory::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_GetBulletTrajectory, CallFunc_Add_VectorVector_ReturnValue) == 0x000108, "Member 'BP_Military_Soldier_C_GetBulletTrajectory::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Soldier_C_GetBulletTrajectory, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000120, "Member 'BP_Military_Soldier_C_GetBulletTrajectory::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");

// Function BP_Military_Soldier.BP_Military_Soldier_C.Shoot
// 0x0008 (0x0008 - 0x0000)
struct BP_Military_Soldier_C_Shoot final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Military_Soldier_C_Shoot) == 0x000008, "Wrong alignment on BP_Military_Soldier_C_Shoot");
static_assert(sizeof(BP_Military_Soldier_C_Shoot) == 0x000008, "Wrong size on BP_Military_Soldier_C_Shoot");
static_assert(offsetof(BP_Military_Soldier_C_Shoot, TargetActor) == 0x000000, "Member 'BP_Military_Soldier_C_Shoot::TargetActor' has a wrong offset!");

}

