#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerAvatarSelection

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PlayerAvatarSelection.BP_PlayerAvatarSelection_C.Interact
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerAvatarSelection_C_Interact final
{
public:
	class ABP_UPPlayerCharacter_C*                Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerAvatarSelection_C_Interact) == 0x000008, "Wrong alignment on BP_PlayerAvatarSelection_C_Interact");
static_assert(sizeof(BP_PlayerAvatarSelection_C_Interact) == 0x000008, "Wrong size on BP_PlayerAvatarSelection_C_Interact");
static_assert(offsetof(BP_PlayerAvatarSelection_C_Interact, Player) == 0x000000, "Member 'BP_PlayerAvatarSelection_C_Interact::Player' has a wrong offset!");

// Function BP_PlayerAvatarSelection.BP_PlayerAvatarSelection_C.ExecuteUbergraph_BP_PlayerAvatarSelection
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerAvatarSelection_C_ExecuteUbergraph_BP_PlayerAvatarSelection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                K2Node_Event_Player;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerAvatarSelection_C_ExecuteUbergraph_BP_PlayerAvatarSelection) == 0x000008, "Wrong alignment on BP_PlayerAvatarSelection_C_ExecuteUbergraph_BP_PlayerAvatarSelection");
static_assert(sizeof(BP_PlayerAvatarSelection_C_ExecuteUbergraph_BP_PlayerAvatarSelection) == 0x000010, "Wrong size on BP_PlayerAvatarSelection_C_ExecuteUbergraph_BP_PlayerAvatarSelection");
static_assert(offsetof(BP_PlayerAvatarSelection_C_ExecuteUbergraph_BP_PlayerAvatarSelection, EntryPoint) == 0x000000, "Member 'BP_PlayerAvatarSelection_C_ExecuteUbergraph_BP_PlayerAvatarSelection::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerAvatarSelection_C_ExecuteUbergraph_BP_PlayerAvatarSelection, K2Node_Event_Player) == 0x000008, "Member 'BP_PlayerAvatarSelection_C_ExecuteUbergraph_BP_PlayerAvatarSelection::K2Node_Event_Player' has a wrong offset!");

}

