#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Parent_Enemy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_ScoringActorState_structs.hpp"


namespace SDK::Params
{

// Function BP_Parent_Enemy.BP_Parent_Enemy_C.HasKilled (All)
// 0x0010 (0x0010 - 0x0000)
struct BP_Parent_Enemy_C_HasKilled__All_ final
{
public:
	TScriptInterface<class IBPI_Killable_C>       KilledActor;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Parent_Enemy_C_HasKilled__All_) == 0x000008, "Wrong alignment on BP_Parent_Enemy_C_HasKilled__All_");
static_assert(sizeof(BP_Parent_Enemy_C_HasKilled__All_) == 0x000010, "Wrong size on BP_Parent_Enemy_C_HasKilled__All_");
static_assert(offsetof(BP_Parent_Enemy_C_HasKilled__All_, KilledActor) == 0x000000, "Member 'BP_Parent_Enemy_C_HasKilled__All_::KilledActor' has a wrong offset!");

// Function BP_Parent_Enemy.BP_Parent_Enemy_C.StartGrawlCooldown
// 0x0008 (0x0008 - 0x0000)
struct BP_Parent_Enemy_C_StartGrawlCooldown final
{
public:
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Parent_Enemy_C_StartGrawlCooldown) == 0x000008, "Wrong alignment on BP_Parent_Enemy_C_StartGrawlCooldown");
static_assert(sizeof(BP_Parent_Enemy_C_StartGrawlCooldown) == 0x000008, "Wrong size on BP_Parent_Enemy_C_StartGrawlCooldown");
static_assert(offsetof(BP_Parent_Enemy_C_StartGrawlCooldown, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000000, "Member 'BP_Parent_Enemy_C_StartGrawlCooldown::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");

// Function BP_Parent_Enemy.BP_Parent_Enemy_C.IsGrawlInCooldown
// 0x0020 (0x0020 - 0x0000)
struct BP_Parent_Enemy_C_IsGrawlInCooldown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Parent_Enemy_C_IsGrawlInCooldown) == 0x000008, "Wrong alignment on BP_Parent_Enemy_C_IsGrawlInCooldown");
static_assert(sizeof(BP_Parent_Enemy_C_IsGrawlInCooldown) == 0x000020, "Wrong size on BP_Parent_Enemy_C_IsGrawlInCooldown");
static_assert(offsetof(BP_Parent_Enemy_C_IsGrawlInCooldown, ReturnValue) == 0x000000, "Member 'BP_Parent_Enemy_C_IsGrawlInCooldown::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_IsGrawlInCooldown, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000008, "Member 'BP_Parent_Enemy_C_IsGrawlInCooldown::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_IsGrawlInCooldown, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_Parent_Enemy_C_IsGrawlInCooldown::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_IsGrawlInCooldown, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_Parent_Enemy_C_IsGrawlInCooldown::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_Parent_Enemy.BP_Parent_Enemy_C.GetNavPointsInVolume
// 0x0060 (0x0060 - 0x0000)
struct BP_Parent_Enemy_C_GetNavPointsInVolume final
{
public:
	class ABP_InteriorVolume_C*                   InteriorVolume;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_NavigationPoint_C*>          NavPoints;                                         // 0x0008(0x0010)(Parm, OutParm)
	TArray<class ABP_NavigationPoint_C*>          _NavPoints;                                        // 0x0018(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_NavigationPoint_Default_C*>  CallFunc_GetAllActorsOfClass_OutActors;            // 0x0038(0x0010)(ReferenceParm)
	class ABP_NavigationPoint_Default_C*          CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Parent_Enemy_C_GetNavPointsInVolume) == 0x000008, "Wrong alignment on BP_Parent_Enemy_C_GetNavPointsInVolume");
static_assert(sizeof(BP_Parent_Enemy_C_GetNavPointsInVolume) == 0x000060, "Wrong size on BP_Parent_Enemy_C_GetNavPointsInVolume");
static_assert(offsetof(BP_Parent_Enemy_C_GetNavPointsInVolume, InteriorVolume) == 0x000000, "Member 'BP_Parent_Enemy_C_GetNavPointsInVolume::InteriorVolume' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_GetNavPointsInVolume, NavPoints) == 0x000008, "Member 'BP_Parent_Enemy_C_GetNavPointsInVolume::NavPoints' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_GetNavPointsInVolume, _NavPoints) == 0x000018, "Member 'BP_Parent_Enemy_C_GetNavPointsInVolume::_NavPoints' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_GetNavPointsInVolume, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_Parent_Enemy_C_GetNavPointsInVolume::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_GetNavPointsInVolume, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'BP_Parent_Enemy_C_GetNavPointsInVolume::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_GetNavPointsInVolume, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_Parent_Enemy_C_GetNavPointsInVolume::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_GetNavPointsInVolume, CallFunc_GetAllActorsOfClass_OutActors) == 0x000038, "Member 'BP_Parent_Enemy_C_GetNavPointsInVolume::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_GetNavPointsInVolume, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_Parent_Enemy_C_GetNavPointsInVolume::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_GetNavPointsInVolume, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_Parent_Enemy_C_GetNavPointsInVolume::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_GetNavPointsInVolume, CallFunc_Array_Add_ReturnValue) == 0x000054, "Member 'BP_Parent_Enemy_C_GetNavPointsInVolume::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_GetNavPointsInVolume, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'BP_Parent_Enemy_C_GetNavPointsInVolume::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_GetNavPointsInVolume, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000059, "Member 'BP_Parent_Enemy_C_GetNavPointsInVolume::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_Parent_Enemy.BP_Parent_Enemy_C.SetAudioAttachedEnabled
// 0x0030 (0x0030 - 0x0000)
struct BP_Parent_Enemy_C_SetAudioAttachedEnabled final
{
public:
	class UAudioComponent*                        InAudio;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Sound;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Enabled;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        OutAudio;                                          // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Parent_Enemy_C_SetAudioAttachedEnabled) == 0x000008, "Wrong alignment on BP_Parent_Enemy_C_SetAudioAttachedEnabled");
static_assert(sizeof(BP_Parent_Enemy_C_SetAudioAttachedEnabled) == 0x000030, "Wrong size on BP_Parent_Enemy_C_SetAudioAttachedEnabled");
static_assert(offsetof(BP_Parent_Enemy_C_SetAudioAttachedEnabled, InAudio) == 0x000000, "Member 'BP_Parent_Enemy_C_SetAudioAttachedEnabled::InAudio' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_SetAudioAttachedEnabled, Sound) == 0x000008, "Member 'BP_Parent_Enemy_C_SetAudioAttachedEnabled::Sound' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_SetAudioAttachedEnabled, Enabled) == 0x000010, "Member 'BP_Parent_Enemy_C_SetAudioAttachedEnabled::Enabled' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_SetAudioAttachedEnabled, OutAudio) == 0x000018, "Member 'BP_Parent_Enemy_C_SetAudioAttachedEnabled::OutAudio' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_SetAudioAttachedEnabled, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000020, "Member 'BP_Parent_Enemy_C_SetAudioAttachedEnabled::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_SetAudioAttachedEnabled, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_Parent_Enemy_C_SetAudioAttachedEnabled::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_SetAudioAttachedEnabled, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000029, "Member 'BP_Parent_Enemy_C_SetAudioAttachedEnabled::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function BP_Parent_Enemy.BP_Parent_Enemy_C.GetAffinity
// 0x0010 (0x0010 - 0x0000)
struct BP_Parent_Enemy_C_GetAffinity final
{
public:
	class ABP_KillableCharacter_C*                Killable;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Affinity;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAffinity_Affinity;                     // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Parent_Enemy_C_GetAffinity) == 0x000008, "Wrong alignment on BP_Parent_Enemy_C_GetAffinity");
static_assert(sizeof(BP_Parent_Enemy_C_GetAffinity) == 0x000010, "Wrong size on BP_Parent_Enemy_C_GetAffinity");
static_assert(offsetof(BP_Parent_Enemy_C_GetAffinity, Killable) == 0x000000, "Member 'BP_Parent_Enemy_C_GetAffinity::Killable' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_GetAffinity, Affinity) == 0x000008, "Member 'BP_Parent_Enemy_C_GetAffinity::Affinity' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_GetAffinity, CallFunc_GetAffinity_Affinity) == 0x000009, "Member 'BP_Parent_Enemy_C_GetAffinity::CallFunc_GetAffinity_Affinity' has a wrong offset!");

// Function BP_Parent_Enemy.BP_Parent_Enemy_C.GetEyesLocation
// 0x0030 (0x0030 - 0x0000)
struct BP_Parent_Enemy_C_GetEyesLocation final
{
public:
	struct FVector                                EyesLocation;                                      // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Parent_Enemy_C_GetEyesLocation) == 0x000008, "Wrong alignment on BP_Parent_Enemy_C_GetEyesLocation");
static_assert(sizeof(BP_Parent_Enemy_C_GetEyesLocation) == 0x000030, "Wrong size on BP_Parent_Enemy_C_GetEyesLocation");
static_assert(offsetof(BP_Parent_Enemy_C_GetEyesLocation, EyesLocation) == 0x000000, "Member 'BP_Parent_Enemy_C_GetEyesLocation::EyesLocation' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_GetEyesLocation, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000018, "Member 'BP_Parent_Enemy_C_GetEyesLocation::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");

// Function BP_Parent_Enemy.BP_Parent_Enemy_C.SetEyeHeight
// 0x0020 (0x0020 - 0x0000)
struct BP_Parent_Enemy_C_SetEyeHeight final
{
public:
	double                                        CallFunc_BreakVector_X;                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_BaseEyeHeight_ImplicitCast;     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Parent_Enemy_C_SetEyeHeight) == 0x000008, "Wrong alignment on BP_Parent_Enemy_C_SetEyeHeight");
static_assert(sizeof(BP_Parent_Enemy_C_SetEyeHeight) == 0x000020, "Wrong size on BP_Parent_Enemy_C_SetEyeHeight");
static_assert(offsetof(BP_Parent_Enemy_C_SetEyeHeight, CallFunc_BreakVector_X) == 0x000000, "Member 'BP_Parent_Enemy_C_SetEyeHeight::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_SetEyeHeight, CallFunc_BreakVector_Y) == 0x000008, "Member 'BP_Parent_Enemy_C_SetEyeHeight::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_SetEyeHeight, CallFunc_BreakVector_Z) == 0x000010, "Member 'BP_Parent_Enemy_C_SetEyeHeight::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_SetEyeHeight, K2Node_VariableSet_BaseEyeHeight_ImplicitCast) == 0x000018, "Member 'BP_Parent_Enemy_C_SetEyeHeight::K2Node_VariableSet_BaseEyeHeight_ImplicitCast' has a wrong offset!");

// Function BP_Parent_Enemy.BP_Parent_Enemy_C.GetDefaultScoringState
// 0x0004 (0x0004 - 0x0000)
struct BP_Parent_Enemy_C_GetDefaultScoringState final
{
public:
	E_ScoringActorState                           State;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ScoringActorState                           CallFunc_GetDefaultScoringState_State;             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Parent_Enemy_C_GetDefaultScoringState) == 0x000001, "Wrong alignment on BP_Parent_Enemy_C_GetDefaultScoringState");
static_assert(sizeof(BP_Parent_Enemy_C_GetDefaultScoringState) == 0x000004, "Wrong size on BP_Parent_Enemy_C_GetDefaultScoringState");
static_assert(offsetof(BP_Parent_Enemy_C_GetDefaultScoringState, State) == 0x000000, "Member 'BP_Parent_Enemy_C_GetDefaultScoringState::State' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_GetDefaultScoringState, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_Parent_Enemy_C_GetDefaultScoringState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_GetDefaultScoringState, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'BP_Parent_Enemy_C_GetDefaultScoringState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_GetDefaultScoringState, CallFunc_GetDefaultScoringState_State) == 0x000003, "Member 'BP_Parent_Enemy_C_GetDefaultScoringState::CallFunc_GetDefaultScoringState_State' has a wrong offset!");

// Function BP_Parent_Enemy.BP_Parent_Enemy_C.HasKilled (Server)
// 0x0010 (0x0010 - 0x0000)
struct BP_Parent_Enemy_C_HasKilled__Server_ final
{
public:
	TScriptInterface<class IBPI_Killable_C>       KilledActor;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Parent_Enemy_C_HasKilled__Server_) == 0x000008, "Wrong alignment on BP_Parent_Enemy_C_HasKilled__Server_");
static_assert(sizeof(BP_Parent_Enemy_C_HasKilled__Server_) == 0x000010, "Wrong size on BP_Parent_Enemy_C_HasKilled__Server_");
static_assert(offsetof(BP_Parent_Enemy_C_HasKilled__Server_, KilledActor) == 0x000000, "Member 'BP_Parent_Enemy_C_HasKilled__Server_::KilledActor' has a wrong offset!");

// Function BP_Parent_Enemy.BP_Parent_Enemy_C.HasHarmed (Server)
// 0x0010 (0x0010 - 0x0000)
struct BP_Parent_Enemy_C_HasHarmed__Server_ final
{
public:
	TScriptInterface<class IBPI_Killable_C>       HarmedActor;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Parent_Enemy_C_HasHarmed__Server_) == 0x000008, "Wrong alignment on BP_Parent_Enemy_C_HasHarmed__Server_");
static_assert(sizeof(BP_Parent_Enemy_C_HasHarmed__Server_) == 0x000010, "Wrong size on BP_Parent_Enemy_C_HasHarmed__Server_");
static_assert(offsetof(BP_Parent_Enemy_C_HasHarmed__Server_, HarmedActor) == 0x000000, "Member 'BP_Parent_Enemy_C_HasHarmed__Server_::HarmedActor' has a wrong offset!");

// Function BP_Parent_Enemy.BP_Parent_Enemy_C.PlaySound
// 0x0008 (0x0008 - 0x0000)
struct BP_Parent_Enemy_C_PlaySound final
{
public:
	class USoundCue*                              Sound;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Parent_Enemy_C_PlaySound) == 0x000008, "Wrong alignment on BP_Parent_Enemy_C_PlaySound");
static_assert(sizeof(BP_Parent_Enemy_C_PlaySound) == 0x000008, "Wrong size on BP_Parent_Enemy_C_PlaySound");
static_assert(offsetof(BP_Parent_Enemy_C_PlaySound, Sound) == 0x000000, "Member 'BP_Parent_Enemy_C_PlaySound::Sound' has a wrong offset!");

// Function BP_Parent_Enemy.BP_Parent_Enemy_C.StopIdleAudio
// 0x0010 (0x0010 - 0x0000)
struct BP_Parent_Enemy_C_StopIdleAudio final
{
public:
	class ABP_KillableCharacter_C*                KilledCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Killer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Parent_Enemy_C_StopIdleAudio) == 0x000008, "Wrong alignment on BP_Parent_Enemy_C_StopIdleAudio");
static_assert(sizeof(BP_Parent_Enemy_C_StopIdleAudio) == 0x000010, "Wrong size on BP_Parent_Enemy_C_StopIdleAudio");
static_assert(offsetof(BP_Parent_Enemy_C_StopIdleAudio, KilledCharacter) == 0x000000, "Member 'BP_Parent_Enemy_C_StopIdleAudio::KilledCharacter' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_StopIdleAudio, Killer) == 0x000008, "Member 'BP_Parent_Enemy_C_StopIdleAudio::Killer' has a wrong offset!");

// Function BP_Parent_Enemy.BP_Parent_Enemy_C.SetIdleAudioEnabled
// 0x0001 (0x0001 - 0x0000)
struct BP_Parent_Enemy_C_SetIdleAudioEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Parent_Enemy_C_SetIdleAudioEnabled) == 0x000001, "Wrong alignment on BP_Parent_Enemy_C_SetIdleAudioEnabled");
static_assert(sizeof(BP_Parent_Enemy_C_SetIdleAudioEnabled) == 0x000001, "Wrong size on BP_Parent_Enemy_C_SetIdleAudioEnabled");
static_assert(offsetof(BP_Parent_Enemy_C_SetIdleAudioEnabled, Enabled) == 0x000000, "Member 'BP_Parent_Enemy_C_SetIdleAudioEnabled::Enabled' has a wrong offset!");

// Function BP_Parent_Enemy.BP_Parent_Enemy_C.Killed (Server)
// 0x0010 (0x0010 - 0x0000)
struct BP_Parent_Enemy_C_Killed__Server_ final
{
public:
	class ABP_KillableCharacter_C*                KilledCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Killer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Parent_Enemy_C_Killed__Server_) == 0x000008, "Wrong alignment on BP_Parent_Enemy_C_Killed__Server_");
static_assert(sizeof(BP_Parent_Enemy_C_Killed__Server_) == 0x000010, "Wrong size on BP_Parent_Enemy_C_Killed__Server_");
static_assert(offsetof(BP_Parent_Enemy_C_Killed__Server_, KilledCharacter) == 0x000000, "Member 'BP_Parent_Enemy_C_Killed__Server_::KilledCharacter' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_Killed__Server_, Killer) == 0x000008, "Member 'BP_Parent_Enemy_C_Killed__Server_::Killer' has a wrong offset!");

// Function BP_Parent_Enemy.BP_Parent_Enemy_C.AttachToCharacter
// 0x0010 (0x0010 - 0x0000)
struct BP_Parent_Enemy_C_AttachToCharacter final
{
public:
	class ABP_KillableCharacter_C*                Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Parent_Enemy_C_AttachToCharacter) == 0x000008, "Wrong alignment on BP_Parent_Enemy_C_AttachToCharacter");
static_assert(sizeof(BP_Parent_Enemy_C_AttachToCharacter) == 0x000010, "Wrong size on BP_Parent_Enemy_C_AttachToCharacter");
static_assert(offsetof(BP_Parent_Enemy_C_AttachToCharacter, Character) == 0x000000, "Member 'BP_Parent_Enemy_C_AttachToCharacter::Character' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_AttachToCharacter, BoneName) == 0x000008, "Member 'BP_Parent_Enemy_C_AttachToCharacter::BoneName' has a wrong offset!");

// Function BP_Parent_Enemy.BP_Parent_Enemy_C.HasHarmed (All)
// 0x0010 (0x0010 - 0x0000)
struct BP_Parent_Enemy_C_HasHarmed__All_ final
{
public:
	TScriptInterface<class IBPI_Killable_C>       HarmedActor;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Parent_Enemy_C_HasHarmed__All_) == 0x000008, "Wrong alignment on BP_Parent_Enemy_C_HasHarmed__All_");
static_assert(sizeof(BP_Parent_Enemy_C_HasHarmed__All_) == 0x000010, "Wrong size on BP_Parent_Enemy_C_HasHarmed__All_");
static_assert(offsetof(BP_Parent_Enemy_C_HasHarmed__All_, HarmedActor) == 0x000000, "Member 'BP_Parent_Enemy_C_HasHarmed__All_::HarmedActor' has a wrong offset!");

// Function BP_Parent_Enemy.BP_Parent_Enemy_C.EnableRagdoll
// 0x0020 (0x0020 - 0x0000)
struct BP_Parent_Enemy_C_EnableRagdoll final
{
public:
	struct FVector                                SourceLocation;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Force;                                             // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Parent_Enemy_C_EnableRagdoll) == 0x000008, "Wrong alignment on BP_Parent_Enemy_C_EnableRagdoll");
static_assert(sizeof(BP_Parent_Enemy_C_EnableRagdoll) == 0x000020, "Wrong size on BP_Parent_Enemy_C_EnableRagdoll");
static_assert(offsetof(BP_Parent_Enemy_C_EnableRagdoll, SourceLocation) == 0x000000, "Member 'BP_Parent_Enemy_C_EnableRagdoll::SourceLocation' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_EnableRagdoll, Force) == 0x000018, "Member 'BP_Parent_Enemy_C_EnableRagdoll::Force' has a wrong offset!");

// Function BP_Parent_Enemy.BP_Parent_Enemy_C.KnockOut
// 0x0008 (0x0008 - 0x0000)
struct BP_Parent_Enemy_C_KnockOut final
{
public:
	double                                        Duration;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Parent_Enemy_C_KnockOut) == 0x000008, "Wrong alignment on BP_Parent_Enemy_C_KnockOut");
static_assert(sizeof(BP_Parent_Enemy_C_KnockOut) == 0x000008, "Wrong size on BP_Parent_Enemy_C_KnockOut");
static_assert(offsetof(BP_Parent_Enemy_C_KnockOut, Duration) == 0x000000, "Member 'BP_Parent_Enemy_C_KnockOut::Duration' has a wrong offset!");

// Function BP_Parent_Enemy.BP_Parent_Enemy_C.BndEvt__BP_Parent_Enemy_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_Parent_Enemy_C_BndEvt__BP_Parent_Enemy_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0030(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Parent_Enemy_C_BndEvt__BP_Parent_Enemy_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Parent_Enemy_C_BndEvt__BP_Parent_Enemy_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(BP_Parent_Enemy_C_BndEvt__BP_Parent_Enemy_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature) == 0x000118, "Wrong size on BP_Parent_Enemy_C_BndEvt__BP_Parent_Enemy_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(BP_Parent_Enemy_C_BndEvt__BP_Parent_Enemy_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'BP_Parent_Enemy_C_BndEvt__BP_Parent_Enemy_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_BndEvt__BP_Parent_Enemy_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Parent_Enemy_C_BndEvt__BP_Parent_Enemy_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_BndEvt__BP_Parent_Enemy_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Parent_Enemy_C_BndEvt__BP_Parent_Enemy_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_BndEvt__BP_Parent_Enemy_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'BP_Parent_Enemy_C_BndEvt__BP_Parent_Enemy_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_BndEvt__BP_Parent_Enemy_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, Hit) == 0x000030, "Member 'BP_Parent_Enemy_C_BndEvt__BP_Parent_Enemy_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function BP_Parent_Enemy.BP_Parent_Enemy_C.ExecuteUbergraph_BP_Parent_Enemy
// 0x0390 (0x0390 - 0x0000)
struct BP_Parent_Enemy_C_ExecuteUbergraph_BP_Parent_Enemy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              K2Node_CustomEvent_Sound;                          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_KillableCharacter_C*                K2Node_CustomEvent_KilledCharacter_1;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Killer_1;                       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Killable_C>       K2Node_Event_HarmedActor_1;                        // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Killable_C>       K2Node_Event_KilledActor_1;                        // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enabled;                        // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SetAudioAttachedEnabled_OutAudio;         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_KillableCharacter_C*                K2Node_CustomEvent_KilledCharacter;                // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Killer;                         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_KillableCharacter_C*                K2Node_CustomEvent_Character;                      // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Killable_C>       K2Node_Event_KilledActor;                          // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Killable_C>       K2Node_Event_HarmedActor;                          // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_NavigationPoint_Huge_C*>     CallFunc_GetAllActorsOfClass_OutActors;            // 0x0100(0x0010)(ReferenceParm)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABPC_ParentEnemy_C*                     K2Node_DynamicCast_AsBPC_Parent_Enemy;             // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_DynamicCast_AsAIController;                 // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x2];                                      // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ABP_KillableCharacter_C* KilledCharacter, class AActor* Killer)> K2Node_CreateDelegate_OutputDelegate; // 0x013C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_SourceLocation;                       // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Force;                                // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_Duration;                             // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_InteriorVolume_C*                   CallFunc_GetInteriorVolume_InteriorVolume;         // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_NavigationPoint_C*>          CallFunc_GetNavPointsInVolume_NavPoints;           // 0x01D8(0x0010)(ReferenceParm)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x0218(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void(class ABP_KillableCharacter_C* KilledCharacter, class AActor* Killer)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0300(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_KillableCharacter_C*                K2Node_DynamicCast_AsBP_Killable_Character;        // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                K2Node_DynamicCast_AsBP_UPPlayer_Character;        // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue_2;              // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABPC_ParentEnemy_C*                     K2Node_DynamicCast_AsBPC_Parent_Enemy_1;           // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_343[0x1];                                      // 0x0343(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0344(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0358(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0360(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0370(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCollisionProfileName_ReturnValue;      // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCollisionProfileName_ReturnValue_1;    // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ReportNoiseEvent_MaxRange_ImplicitCast;   // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ReportNoiseEvent_MaxRange_ImplicitCast_1; // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Parent_Enemy_C_ExecuteUbergraph_BP_Parent_Enemy) == 0x000008, "Wrong alignment on BP_Parent_Enemy_C_ExecuteUbergraph_BP_Parent_Enemy");
static_assert(sizeof(BP_Parent_Enemy_C_ExecuteUbergraph_BP_Parent_Enemy) == 0x000390, "Wrong size on BP_Parent_Enemy_C_ExecuteUbergraph_BP_Parent_Enemy");
static_assert(offsetof(BP_Parent_Enemy_C_ExecuteUbergraph_BP_Parent_Enemy, EntryPoint) == 0x000000, "Member 'BP_Parent_Enemy_C_ExecuteUbergraph_BP_Parent_Enemy::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Parent_Enemy_C_ExecuteUbergraph_BP_Parent_Enemy, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_Parent_Enemy_C_ExecuteUbergraph_BP_Parent_Enemy::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
