#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PhysicalActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PhysicalActor.BP_PhysicalActor_C.ReceiveHit
// 0x0150 (0x0150 - 0x0000)
struct BP_PhysicalActor_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0050(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0068(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_PhysicalActor_C_ReceiveHit) == 0x000008, "Wrong alignment on BP_PhysicalActor_C_ReceiveHit");
static_assert(sizeof(BP_PhysicalActor_C_ReceiveHit) == 0x000150, "Wrong size on BP_PhysicalActor_C_ReceiveHit");
static_assert(offsetof(BP_PhysicalActor_C_ReceiveHit, MyComp) == 0x000000, "Member 'BP_PhysicalActor_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ReceiveHit, Other) == 0x000008, "Member 'BP_PhysicalActor_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ReceiveHit, OtherComp) == 0x000010, "Member 'BP_PhysicalActor_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'BP_PhysicalActor_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ReceiveHit, HitLocation) == 0x000020, "Member 'BP_PhysicalActor_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ReceiveHit, HitNormal) == 0x000038, "Member 'BP_PhysicalActor_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ReceiveHit, NormalImpulse) == 0x000050, "Member 'BP_PhysicalActor_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ReceiveHit, Hit) == 0x000068, "Member 'BP_PhysicalActor_C_ReceiveHit::Hit' has a wrong offset!");

// Function BP_PhysicalActor.BP_PhysicalActor_C.ExecuteUbergraph_BP_PhysicalActor
// 0x03A8 (0x03A8 - 0x0000)
struct BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         CallFunc_Array_Random_OutItem;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        CallFunc_Array_Random_OutItem_1;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Power;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Normal;                         // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0140(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TScriptInterface<class IBPI_Killable_C>       K2Node_Event_HarmedActor;                          // 0x0228(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCollisionEffectPower_TriggerEffects;   // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetCollisionEffectPower_EffetPower;       // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_KillableCharacter_C*                K2Node_DynamicCast_AsBP_Killable_Character;        // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Killable_C>       K2Node_Event_HarmedActor_1;                        // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_272[0x6];                                      // 0x0272(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_SleepingComponent;              // 0x0278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyRigidBodyAwake_ReturnValue;          // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Killable_C>       K2Node_Event_KilledActor_1;                        // 0x02A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UPrimitiveComponent* SleepingComponent, class FName BoneName)> K2Node_CreateDelegate_OutputDelegate; // 0x02B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Killable_C>       K2Node_Event_KilledActor;                          // 0x02E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetAvgVelocity_AvgVelocity;               // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_2;        // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0328(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable;                              // 0x0340(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0358(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0370(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast; // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast_1; // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CollisionEffects_Power_ImplicitCast;      // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor) == 0x000008, "Wrong alignment on BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor");
static_assert(sizeof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor) == 0x0003A8, "Wrong size on BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, EntryPoint) == 0x000000, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_Array_Random_OutItem) == 0x000008, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_Array_Random_OutIndex) == 0x000010, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_Array_Random_OutItem_1) == 0x000018, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_Array_Random_OutItem_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_Array_Random_OutIndex_1) == 0x000020, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_Array_Random_OutIndex_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000028, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, K2Node_CustomEvent_Power) == 0x000038, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::K2Node_CustomEvent_Power' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, K2Node_CustomEvent_Location) == 0x000040, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, K2Node_CustomEvent_Normal) == 0x000058, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::K2Node_CustomEvent_Normal' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000070, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000078, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000090, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000098, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x0000B0, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x0000B8, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0000D0, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, K2Node_Event_MyComp) == 0x0000D8, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, K2Node_Event_Other) == 0x0000E0, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, K2Node_Event_OtherComp) == 0x0000E8, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, K2Node_Event_bSelfMoved) == 0x0000F0, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, K2Node_Event_HitLocation) == 0x0000F8, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, K2Node_Event_HitNormal) == 0x000110, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, K2Node_Event_NormalImpulse) == 0x000128, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, K2Node_Event_Hit) == 0x000140, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, K2Node_Event_HarmedActor) == 0x000228, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::K2Node_Event_HarmedActor' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_GetCollisionEffectPower_TriggerEffects) == 0x000238, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_GetCollisionEffectPower_TriggerEffects' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_GetCollisionEffectPower_EffetPower) == 0x000240, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_GetCollisionEffectPower_EffetPower' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, K2Node_DynamicCast_AsBP_Killable_Character) == 0x000248, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::K2Node_DynamicCast_AsBP_Killable_Character' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, K2Node_DynamicCast_bSuccess) == 0x000250, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, K2Node_Event_HarmedActor_1) == 0x000258, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::K2Node_Event_HarmedActor_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_HasAuthority_ReturnValue) == 0x000268, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, K2Node_Event_DeltaSeconds) == 0x00026C, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_HasAuthority_ReturnValue_1) == 0x000270, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_HasAuthority_ReturnValue_2) == 0x000271, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, K2Node_CustomEvent_SleepingComponent) == 0x000278, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::K2Node_CustomEvent_SleepingComponent' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, K2Node_CustomEvent_BoneName) == 0x000280, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_IsAnyRigidBodyAwake_ReturnValue) == 0x000288, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_IsAnyRigidBodyAwake_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, Temp_int_Variable) == 0x00028C, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_Array_LastIndex_ReturnValue) == 0x000290, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000294, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_Add_IntInt_ReturnValue) == 0x000298, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, K2Node_Event_KilledActor_1) == 0x0002A0, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::K2Node_Event_KilledActor_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_IsValid_ReturnValue) == 0x0002B0, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, K2Node_CreateDelegate_OutputDelegate) == 0x0002B4, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0002C8, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, K2Node_Event_KilledActor) == 0x0002E0, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::K2Node_Event_KilledActor' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_GetAvgVelocity_AvgVelocity) == 0x0002F0, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_GetAvgVelocity_AvgVelocity' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_HasAuthority_ReturnValue_3) == 0x000308, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_Conv_DoubleToVector_ReturnValue_2) == 0x000310, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_Conv_DoubleToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000328, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, Temp_struct_Variable) == 0x000340, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000358, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_RandomUnitVector_ReturnValue) == 0x000370, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast) == 0x000388, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast_1) == 0x000390, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000398, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor, CallFunc_CollisionEffects_Power_ImplicitCast) == 0x0003A0, "Member 'BP_PhysicalActor_C_ExecuteUbergraph_BP_PhysicalActor::CallFunc_CollisionEffects_Power_ImplicitCast' has a wrong offset!");

// Function BP_PhysicalActor.BP_PhysicalActor_C.GetAvgVelocity
// 0x00A8 (0x00A8 - 0x0000)
struct BP_PhysicalActor_C_GetAvgVelocity final
{
public:
	struct FVector                                AvgVelocity;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                _VelocitiesSum;                                    // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_IntToVector_ReturnValue;             // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PhysicalActor_C_GetAvgVelocity) == 0x000008, "Wrong alignment on BP_PhysicalActor_C_GetAvgVelocity");
static_assert(sizeof(BP_PhysicalActor_C_GetAvgVelocity) == 0x0000A8, "Wrong size on BP_PhysicalActor_C_GetAvgVelocity");
static_assert(offsetof(BP_PhysicalActor_C_GetAvgVelocity, AvgVelocity) == 0x000000, "Member 'BP_PhysicalActor_C_GetAvgVelocity::AvgVelocity' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetAvgVelocity, _VelocitiesSum) == 0x000018, "Member 'BP_PhysicalActor_C_GetAvgVelocity::_VelocitiesSum' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetAvgVelocity, Temp_int_Array_Index_Variable) == 0x000030, "Member 'BP_PhysicalActor_C_GetAvgVelocity::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetAvgVelocity, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'BP_PhysicalActor_C_GetAvgVelocity::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetAvgVelocity, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BP_PhysicalActor_C_GetAvgVelocity::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetAvgVelocity, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BP_PhysicalActor_C_GetAvgVelocity::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetAvgVelocity, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_PhysicalActor_C_GetAvgVelocity::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetAvgVelocity, CallFunc_Conv_IntToVector_ReturnValue) == 0x000058, "Member 'BP_PhysicalActor_C_GetAvgVelocity::CallFunc_Conv_IntToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetAvgVelocity, CallFunc_Add_VectorVector_ReturnValue) == 0x000070, "Member 'BP_PhysicalActor_C_GetAvgVelocity::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetAvgVelocity, CallFunc_Divide_VectorVector_ReturnValue) == 0x000088, "Member 'BP_PhysicalActor_C_GetAvgVelocity::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetAvgVelocity, CallFunc_Array_Length_ReturnValue_1) == 0x0000A0, "Member 'BP_PhysicalActor_C_GetAvgVelocity::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetAvgVelocity, CallFunc_Less_IntInt_ReturnValue) == 0x0000A4, "Member 'BP_PhysicalActor_C_GetAvgVelocity::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_PhysicalActor.BP_PhysicalActor_C.AddVelocityToBuffer
// 0x0040 (0x0040 - 0x0000)
struct BP_PhysicalActor_C_AddVelocityToBuffer final
{
public:
	struct FVector                                _VelocitiesSum;                                    // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PhysicalActor_C_AddVelocityToBuffer) == 0x000008, "Wrong alignment on BP_PhysicalActor_C_AddVelocityToBuffer");
static_assert(sizeof(BP_PhysicalActor_C_AddVelocityToBuffer) == 0x000040, "Wrong size on BP_PhysicalActor_C_AddVelocityToBuffer");
static_assert(offsetof(BP_PhysicalActor_C_AddVelocityToBuffer, _VelocitiesSum) == 0x000000, "Member 'BP_PhysicalActor_C_AddVelocityToBuffer::_VelocitiesSum' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_AddVelocityToBuffer, CallFunc_GetVelocity_ReturnValue) == 0x000018, "Member 'BP_PhysicalActor_C_AddVelocityToBuffer::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_AddVelocityToBuffer, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_PhysicalActor_C_AddVelocityToBuffer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_AddVelocityToBuffer, Temp_int_Variable) == 0x000034, "Member 'BP_PhysicalActor_C_AddVelocityToBuffer::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_AddVelocityToBuffer, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000038, "Member 'BP_PhysicalActor_C_AddVelocityToBuffer::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function BP_PhysicalActor.BP_PhysicalActor_C.EnableCollisions
// 0x0038 (0x0038 - 0x0000)
struct BP_PhysicalActor_C_EnableCollisions final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PhysicalActor_C_EnableCollisions) == 0x000008, "Wrong alignment on BP_PhysicalActor_C_EnableCollisions");
static_assert(sizeof(BP_PhysicalActor_C_EnableCollisions) == 0x000038, "Wrong size on BP_PhysicalActor_C_EnableCollisions");
static_assert(offsetof(BP_PhysicalActor_C_EnableCollisions, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_PhysicalActor_C_EnableCollisions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_EnableCollisions, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_PhysicalActor_C_EnableCollisions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_EnableCollisions, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_PhysicalActor_C_EnableCollisions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_EnableCollisions, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000010, "Member 'BP_PhysicalActor_C_EnableCollisions::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_EnableCollisions, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_PhysicalActor_C_EnableCollisions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_EnableCollisions, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_PhysicalActor_C_EnableCollisions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_EnableCollisions, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_PhysicalActor_C_EnableCollisions::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_PhysicalActor.BP_PhysicalActor_C.GetCollisionEffectPower
// 0x00E0 (0x00E0 - 0x0000)
struct BP_PhysicalActor_C_GetCollisionEffectPower final
{
public:
	class AActor*                                 HitActor;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impulse;                                           // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TriggerEffects;                                    // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        EffetPower;                                        // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetAvgVelocity_AvgVelocity;               // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Zero_ReturnValue;                  // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue_1;                      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualExactly_VectorVector_ReturnValue;    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_FunctionResult_EffetPower_ImplicitCast;     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_EffetPower_ImplicitCast_1;   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast_1;      // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PhysicalActor_C_GetCollisionEffectPower) == 0x000008, "Wrong alignment on BP_PhysicalActor_C_GetCollisionEffectPower");
static_assert(sizeof(BP_PhysicalActor_C_GetCollisionEffectPower) == 0x0000E0, "Wrong size on BP_PhysicalActor_C_GetCollisionEffectPower");
static_assert(offsetof(BP_PhysicalActor_C_GetCollisionEffectPower, HitActor) == 0x000000, "Member 'BP_PhysicalActor_C_GetCollisionEffectPower::HitActor' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetCollisionEffectPower, Impulse) == 0x000008, "Member 'BP_PhysicalActor_C_GetCollisionEffectPower::Impulse' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetCollisionEffectPower, TriggerEffects) == 0x000020, "Member 'BP_PhysicalActor_C_GetCollisionEffectPower::TriggerEffects' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetCollisionEffectPower, EffetPower) == 0x000028, "Member 'BP_PhysicalActor_C_GetCollisionEffectPower::EffetPower' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetCollisionEffectPower, CallFunc_GetAvgVelocity_AvgVelocity) == 0x000030, "Member 'BP_PhysicalActor_C_GetCollisionEffectPower::CallFunc_GetAvgVelocity_AvgVelocity' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetCollisionEffectPower, CallFunc_VSize_ReturnValue) == 0x000048, "Member 'BP_PhysicalActor_C_GetCollisionEffectPower::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetCollisionEffectPower, CallFunc_GetVelocity_ReturnValue) == 0x000050, "Member 'BP_PhysicalActor_C_GetCollisionEffectPower::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetCollisionEffectPower, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000068, "Member 'BP_PhysicalActor_C_GetCollisionEffectPower::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetCollisionEffectPower, CallFunc_Vector_Zero_ReturnValue) == 0x000080, "Member 'BP_PhysicalActor_C_GetCollisionEffectPower::CallFunc_Vector_Zero_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetCollisionEffectPower, CallFunc_VSize_ReturnValue_1) == 0x000098, "Member 'BP_PhysicalActor_C_GetCollisionEffectPower::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetCollisionEffectPower, CallFunc_EqualExactly_VectorVector_ReturnValue) == 0x0000A0, "Member 'BP_PhysicalActor_C_GetCollisionEffectPower::CallFunc_EqualExactly_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetCollisionEffectPower, CallFunc_GetFloatValue_ReturnValue) == 0x0000A4, "Member 'BP_PhysicalActor_C_GetCollisionEffectPower::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetCollisionEffectPower, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000A8, "Member 'BP_PhysicalActor_C_GetCollisionEffectPower::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetCollisionEffectPower, CallFunc_GetFloatValue_ReturnValue_1) == 0x0000AC, "Member 'BP_PhysicalActor_C_GetCollisionEffectPower::CallFunc_GetFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetCollisionEffectPower, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x0000B0, "Member 'BP_PhysicalActor_C_GetCollisionEffectPower::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetCollisionEffectPower, K2Node_FunctionResult_EffetPower_ImplicitCast) == 0x0000B8, "Member 'BP_PhysicalActor_C_GetCollisionEffectPower::K2Node_FunctionResult_EffetPower_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetCollisionEffectPower, K2Node_FunctionResult_EffetPower_ImplicitCast_1) == 0x0000C0, "Member 'BP_PhysicalActor_C_GetCollisionEffectPower::K2Node_FunctionResult_EffetPower_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetCollisionEffectPower, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x0000C8, "Member 'BP_PhysicalActor_C_GetCollisionEffectPower::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetCollisionEffectPower, CallFunc_GetFloatValue_InTime_ImplicitCast_1) == 0x0000CC, "Member 'BP_PhysicalActor_C_GetCollisionEffectPower::CallFunc_GetFloatValue_InTime_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetCollisionEffectPower, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0000D0, "Member 'BP_PhysicalActor_C_GetCollisionEffectPower::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_GetCollisionEffectPower, CallFunc_Greater_DoubleDouble_A_ImplicitCast_1) == 0x0000D8, "Member 'BP_PhysicalActor_C_GetCollisionEffectPower::CallFunc_Greater_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

// Function BP_PhysicalActor.BP_PhysicalActor_C.HasHarmed (All)
// 0x0010 (0x0010 - 0x0000)
struct BP_PhysicalActor_C_HasHarmed__All_ final
{
public:
	TScriptInterface<class IBPI_Killable_C>       HarmedActor;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PhysicalActor_C_HasHarmed__All_) == 0x000008, "Wrong alignment on BP_PhysicalActor_C_HasHarmed__All_");
static_assert(sizeof(BP_PhysicalActor_C_HasHarmed__All_) == 0x000010, "Wrong size on BP_PhysicalActor_C_HasHarmed__All_");
static_assert(offsetof(BP_PhysicalActor_C_HasHarmed__All_, HarmedActor) == 0x000000, "Member 'BP_PhysicalActor_C_HasHarmed__All_::HarmedActor' has a wrong offset!");

// Function BP_PhysicalActor.BP_PhysicalActor_C.HasHarmed (Server)
// 0x0010 (0x0010 - 0x0000)
struct BP_PhysicalActor_C_HasHarmed__Server_ final
{
public:
	TScriptInterface<class IBPI_Killable_C>       HarmedActor;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PhysicalActor_C_HasHarmed__Server_) == 0x000008, "Wrong alignment on BP_PhysicalActor_C_HasHarmed__Server_");
static_assert(sizeof(BP_PhysicalActor_C_HasHarmed__Server_) == 0x000010, "Wrong size on BP_PhysicalActor_C_HasHarmed__Server_");
static_assert(offsetof(BP_PhysicalActor_C_HasHarmed__Server_, HarmedActor) == 0x000000, "Member 'BP_PhysicalActor_C_HasHarmed__Server_::HarmedActor' has a wrong offset!");

// Function BP_PhysicalActor.BP_PhysicalActor_C.CollisionEffects
// 0x0038 (0x0038 - 0x0000)
struct BP_PhysicalActor_C_CollisionEffects final
{
public:
	float                                         Power;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Normal;                                            // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PhysicalActor_C_CollisionEffects) == 0x000008, "Wrong alignment on BP_PhysicalActor_C_CollisionEffects");
static_assert(sizeof(BP_PhysicalActor_C_CollisionEffects) == 0x000038, "Wrong size on BP_PhysicalActor_C_CollisionEffects");
static_assert(offsetof(BP_PhysicalActor_C_CollisionEffects, Power) == 0x000000, "Member 'BP_PhysicalActor_C_CollisionEffects::Power' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_CollisionEffects, Location) == 0x000008, "Member 'BP_PhysicalActor_C_CollisionEffects::Location' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_CollisionEffects, Normal) == 0x000020, "Member 'BP_PhysicalActor_C_CollisionEffects::Normal' has a wrong offset!");

// Function BP_PhysicalActor.BP_PhysicalActor_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PhysicalActor_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PhysicalActor_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PhysicalActor_C_ReceiveTick");
static_assert(sizeof(BP_PhysicalActor_C_ReceiveTick) == 0x000004, "Wrong size on BP_PhysicalActor_C_ReceiveTick");
static_assert(offsetof(BP_PhysicalActor_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PhysicalActor_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_PhysicalActor.BP_PhysicalActor_C.SleepChanged
// 0x0010 (0x0010 - 0x0000)
struct BP_PhysicalActor_C_SleepChanged final
{
public:
	class UPrimitiveComponent*                    SleepingComponent;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PhysicalActor_C_SleepChanged) == 0x000008, "Wrong alignment on BP_PhysicalActor_C_SleepChanged");
static_assert(sizeof(BP_PhysicalActor_C_SleepChanged) == 0x000010, "Wrong size on BP_PhysicalActor_C_SleepChanged");
static_assert(offsetof(BP_PhysicalActor_C_SleepChanged, SleepingComponent) == 0x000000, "Member 'BP_PhysicalActor_C_SleepChanged::SleepingComponent' has a wrong offset!");
static_assert(offsetof(BP_PhysicalActor_C_SleepChanged, BoneName) == 0x000008, "Member 'BP_PhysicalActor_C_SleepChanged::BoneName' has a wrong offset!");

// Function BP_PhysicalActor.BP_PhysicalActor_C.HasKilled (All)
// 0x0010 (0x0010 - 0x0000)
struct BP_PhysicalActor_C_HasKilled__All_ final
{
public:
	TScriptInterface<class IBPI_Killable_C>       KilledActor;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PhysicalActor_C_HasKilled__All_) == 0x000008, "Wrong alignment on BP_PhysicalActor_C_HasKilled__All_");
static_assert(sizeof(BP_PhysicalActor_C_HasKilled__All_) == 0x000010, "Wrong size on BP_PhysicalActor_C_HasKilled__All_");
static_assert(offsetof(BP_PhysicalActor_C_HasKilled__All_, KilledActor) == 0x000000, "Member 'BP_PhysicalActor_C_HasKilled__All_::KilledActor' has a wrong offset!");

// Function BP_PhysicalActor.BP_PhysicalActor_C.HasKilled (Server)
// 0x0010 (0x0010 - 0x0000)
struct BP_PhysicalActor_C_HasKilled__Server_ final
{
public:
	TScriptInterface<class IBPI_Killable_C>       KilledActor;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PhysicalActor_C_HasKilled__Server_) == 0x000008, "Wrong alignment on BP_PhysicalActor_C_HasKilled__Server_");
static_assert(sizeof(BP_PhysicalActor_C_HasKilled__Server_) == 0x000010, "Wrong size on BP_PhysicalActor_C_HasKilled__Server_");
static_assert(offsetof(BP_PhysicalActor_C_HasKilled__Server_, KilledActor) == 0x000000, "Member 'BP_PhysicalActor_C_HasKilled__Server_::KilledActor' has a wrong offset!");

}

