#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Portal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Portal.BP_Portal_C
// 0x0040 (0x02D8 - 0x0298)
class ABP_Portal_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        CloseAudio;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        OpenAudio;                                         // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Spawn;                                             // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_Portal_C*                           LinkedPortal;                                      // 0x02C8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          IsExteriorPortal;                                  // 0x02D0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CloseEffects();
	void CreatePlayerStart(class APlayerStart** PlayerSart);
	void ExecuteUbergraph_BP_Portal(int32 EntryPoint);
	void GetInteractDistance(double* Distance);
	void GetInteractDuration(double* Duration);
	void GetInteractNoise(bool* NoiseOnInteract, double* NoiseRange);
	void GetInteractText(class FText* Text);
	void Init(bool IsExteriorPortal_0, class ABP_Portal_C* LinkedPortal_0);
	void Interact(class ABP_UPPlayerCharacter_C* Player);
	void InteractionStarted();
	void InteractionStopped();
	void OpenEffects();
	void ReceiveBeginPlay();
	void RenderInteriorCubemap();
	void StopOpenEffects();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Portal_C">();
	}
	static class ABP_Portal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Portal_C>();
	}
};
static_assert(alignof(ABP_Portal_C) == 0x000008, "Wrong alignment on ABP_Portal_C");
static_assert(sizeof(ABP_Portal_C) == 0x0002D8, "Wrong size on ABP_Portal_C");
static_assert(offsetof(ABP_Portal_C, UberGraphFrame) == 0x000298, "Member 'ABP_Portal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, CloseAudio) == 0x0002A0, "Member 'ABP_Portal_C::CloseAudio' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, OpenAudio) == 0x0002A8, "Member 'ABP_Portal_C::OpenAudio' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, Spawn) == 0x0002B0, "Member 'ABP_Portal_C::Spawn' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, Box) == 0x0002B8, "Member 'ABP_Portal_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, DefaultSceneRoot) == 0x0002C0, "Member 'ABP_Portal_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, LinkedPortal) == 0x0002C8, "Member 'ABP_Portal_C::LinkedPortal' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, IsExteriorPortal) == 0x0002D0, "Member 'ABP_Portal_C::IsExteriorPortal' has a wrong offset!");

}

