#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Parasite

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Parasite.BP_Parasite_C.ExecuteUbergraph_BP_Parasite
// 0x02C0 (0x02C0 - 0x0000)
struct BP_Parasite_C_ExecuteUbergraph_BP_Parasite final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RandomRotator_ReturnValue;                // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_2;        // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0160(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ParasiteProjectile_C*               CallFunc_FinishSpawningActor_ReturnValue;          // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x01D0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Parasite_C_ExecuteUbergraph_BP_Parasite) == 0x000010, "Wrong alignment on BP_Parasite_C_ExecuteUbergraph_BP_Parasite");
static_assert(sizeof(BP_Parasite_C_ExecuteUbergraph_BP_Parasite) == 0x0002C0, "Wrong size on BP_Parasite_C_ExecuteUbergraph_BP_Parasite");
static_assert(offsetof(BP_Parasite_C_ExecuteUbergraph_BP_Parasite, EntryPoint) == 0x000000, "Member 'BP_Parasite_C_ExecuteUbergraph_BP_Parasite::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Parasite_C_ExecuteUbergraph_BP_Parasite, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000008, "Member 'BP_Parasite_C_ExecuteUbergraph_BP_Parasite::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parasite_C_ExecuteUbergraph_BP_Parasite, CallFunc_HasAuthority_ReturnValue) == 0x000020, "Member 'BP_Parasite_C_ExecuteUbergraph_BP_Parasite::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parasite_C_ExecuteUbergraph_BP_Parasite, CallFunc_GetActorForwardVector_ReturnValue) == 0x000028, "Member 'BP_Parasite_C_ExecuteUbergraph_BP_Parasite::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parasite_C_ExecuteUbergraph_BP_Parasite, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000040, "Member 'BP_Parasite_C_ExecuteUbergraph_BP_Parasite::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parasite_C_ExecuteUbergraph_BP_Parasite, CallFunc_RandomRotator_ReturnValue) == 0x000058, "Member 'BP_Parasite_C_ExecuteUbergraph_BP_Parasite::CallFunc_RandomRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parasite_C_ExecuteUbergraph_BP_Parasite, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000070, "Member 'BP_Parasite_C_ExecuteUbergraph_BP_Parasite::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Parasite_C_ExecuteUbergraph_BP_Parasite, CallFunc_GetForwardVector_ReturnValue) == 0x000088, "Member 'BP_Parasite_C_ExecuteUbergraph_BP_Parasite::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parasite_C_ExecuteUbergraph_BP_Parasite, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000A0, "Member 'BP_Parasite_C_ExecuteUbergraph_BP_Parasite::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parasite_C_ExecuteUbergraph_BP_Parasite, CallFunc_BreakVector_X) == 0x0000B8, "Member 'BP_Parasite_C_ExecuteUbergraph_BP_Parasite::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Parasite_C_ExecuteUbergraph_BP_Parasite, CallFunc_BreakVector_Y) == 0x0000C0, "Member 'BP_Parasite_C_ExecuteUbergraph_BP_Parasite::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Parasite_C_ExecuteUbergraph_BP_Parasite, CallFunc_BreakVector_Z) == 0x0000C8, "Member 'BP_Parasite_C_ExecuteUbergraph_BP_Parasite::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Parasite_C_ExecuteUbergraph_BP_Parasite, CallFunc_Conv_DoubleToVector_ReturnValue_2) == 0x0000D0, "Member 'BP_Parasite_C_ExecuteUbergraph_BP_Parasite::CallFunc_Conv_DoubleToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Parasite_C_ExecuteUbergraph_BP_Parasite, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0000E8, "Member 'BP_Parasite_C_ExecuteUbergraph_BP_Parasite::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Parasite_C_ExecuteUbergraph_BP_Parasite, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000100, "Member 'BP_Parasite_C_ExecuteUbergraph_BP_Parasite::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Parasite_C_ExecuteUbergraph_BP_Parasite, CallFunc_Add_VectorVector_ReturnValue) == 0x000118, "Member 'BP_Parasite_C_ExecuteUbergraph_BP_Parasite::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parasite_C_ExecuteUbergraph_BP_Parasite, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000130, "Member 'BP_Parasite_C_ExecuteUbergraph_BP_Parasite::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parasite_C_ExecuteUbergraph_BP_Parasite, CallFunc_VLerp_ReturnValue) == 0x000148, "Member 'BP_Parasite_C_ExecuteUbergraph_BP_Parasite::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parasite_C_ExecuteUbergraph_BP_Parasite, CallFunc_MakeTransform_ReturnValue) == 0x000160, "Member 'BP_Parasite_C_ExecuteUbergraph_BP_Parasite::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parasite_C_ExecuteUbergraph_BP_Parasite, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001C0, "Member 'BP_Parasite_C_ExecuteUbergraph_BP_Parasite::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parasite_C_ExecuteUbergraph_BP_Parasite, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001C8, "Member 'BP_Parasite_C_ExecuteUbergraph_BP_Parasite::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parasite_C_ExecuteUbergraph_BP_Parasite, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0001D0, "Member 'BP_Parasite_C_ExecuteUbergraph_BP_Parasite::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

}

