#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PickupCameroid

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PickupCameroid.BP_PickupCameroid_C.ExecuteUbergraph_BP_PickupCameroid
// 0x0040 (0x0040 - 0x0000)
struct BP_PickupCameroid_C_ExecuteUbergraph_BP_PickupCameroid final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_CreateSave_Save;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadSaveObject_Save;                      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetInventoryItemSaveSlot_Slot;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickupCameroid_C_ExecuteUbergraph_BP_PickupCameroid) == 0x000008, "Wrong alignment on BP_PickupCameroid_C_ExecuteUbergraph_BP_PickupCameroid");
static_assert(sizeof(BP_PickupCameroid_C_ExecuteUbergraph_BP_PickupCameroid) == 0x000040, "Wrong size on BP_PickupCameroid_C_ExecuteUbergraph_BP_PickupCameroid");
static_assert(offsetof(BP_PickupCameroid_C_ExecuteUbergraph_BP_PickupCameroid, EntryPoint) == 0x000000, "Member 'BP_PickupCameroid_C_ExecuteUbergraph_BP_PickupCameroid::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PickupCameroid_C_ExecuteUbergraph_BP_PickupCameroid, CallFunc_CreateSave_Save) == 0x000008, "Member 'BP_PickupCameroid_C_ExecuteUbergraph_BP_PickupCameroid::CallFunc_CreateSave_Save' has a wrong offset!");
static_assert(offsetof(BP_PickupCameroid_C_ExecuteUbergraph_BP_PickupCameroid, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000010, "Member 'BP_PickupCameroid_C_ExecuteUbergraph_BP_PickupCameroid::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupCameroid_C_ExecuteUbergraph_BP_PickupCameroid, CallFunc_LoadSaveObject_Save) == 0x000018, "Member 'BP_PickupCameroid_C_ExecuteUbergraph_BP_PickupCameroid::CallFunc_LoadSaveObject_Save' has a wrong offset!");
static_assert(offsetof(BP_PickupCameroid_C_ExecuteUbergraph_BP_PickupCameroid, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_PickupCameroid_C_ExecuteUbergraph_BP_PickupCameroid::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupCameroid_C_ExecuteUbergraph_BP_PickupCameroid, CallFunc_GetInventoryItemSaveSlot_Slot) == 0x000028, "Member 'BP_PickupCameroid_C_ExecuteUbergraph_BP_PickupCameroid::CallFunc_GetInventoryItemSaveSlot_Slot' has a wrong offset!");
static_assert(offsetof(BP_PickupCameroid_C_ExecuteUbergraph_BP_PickupCameroid, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000038, "Member 'BP_PickupCameroid_C_ExecuteUbergraph_BP_PickupCameroid::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PickupCameroid_C_ExecuteUbergraph_BP_PickupCameroid, CallFunc_SaveGameToSlot_ReturnValue) == 0x000039, "Member 'BP_PickupCameroid_C_ExecuteUbergraph_BP_PickupCameroid::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");

}

