#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResultMosaicElement

#include "Basic.hpp"

#include "E_Buttons_Newsvan_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_CameroidCapture_structs.hpp"


namespace SDK::Params
{

// Function BP_ResultMosaicElement.BP_ResultMosaicElement_C.SelectionChanged
// 0x0040 (0x0040 - 0x0000)
struct BP_ResultMosaicElement_C_SelectionChanged final
{
public:
	struct FS_CameroidCapture                     Capture_0;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultMosaicElement_C_SelectionChanged) == 0x000008, "Wrong alignment on BP_ResultMosaicElement_C_SelectionChanged");
static_assert(sizeof(BP_ResultMosaicElement_C_SelectionChanged) == 0x000040, "Wrong size on BP_ResultMosaicElement_C_SelectionChanged");
static_assert(offsetof(BP_ResultMosaicElement_C_SelectionChanged, Capture_0) == 0x000000, "Member 'BP_ResultMosaicElement_C_SelectionChanged::Capture_0' has a wrong offset!");

// Function BP_ResultMosaicElement.BP_ResultMosaicElement_C.GetInteractDuration
// 0x0008 (0x0008 - 0x0000)
struct BP_ResultMosaicElement_C_GetInteractDuration final
{
public:
	double                                        Duration;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultMosaicElement_C_GetInteractDuration) == 0x000008, "Wrong alignment on BP_ResultMosaicElement_C_GetInteractDuration");
static_assert(sizeof(BP_ResultMosaicElement_C_GetInteractDuration) == 0x000008, "Wrong size on BP_ResultMosaicElement_C_GetInteractDuration");
static_assert(offsetof(BP_ResultMosaicElement_C_GetInteractDuration, Duration) == 0x000000, "Member 'BP_ResultMosaicElement_C_GetInteractDuration::Duration' has a wrong offset!");

// Function BP_ResultMosaicElement.BP_ResultMosaicElement_C.GetInteractDistance
// 0x0008 (0x0008 - 0x0000)
struct BP_ResultMosaicElement_C_GetInteractDistance final
{
public:
	double                                        Distance;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultMosaicElement_C_GetInteractDistance) == 0x000008, "Wrong alignment on BP_ResultMosaicElement_C_GetInteractDistance");
static_assert(sizeof(BP_ResultMosaicElement_C_GetInteractDistance) == 0x000008, "Wrong size on BP_ResultMosaicElement_C_GetInteractDistance");
static_assert(offsetof(BP_ResultMosaicElement_C_GetInteractDistance, Distance) == 0x000000, "Member 'BP_ResultMosaicElement_C_GetInteractDistance::Distance' has a wrong offset!");

// Function BP_ResultMosaicElement.BP_ResultMosaicElement_C.GetInteractText
// 0x0018 (0x0018 - 0x0000)
struct BP_ResultMosaicElement_C_GetInteractText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(Parm, OutParm)
};
static_assert(alignof(BP_ResultMosaicElement_C_GetInteractText) == 0x000008, "Wrong alignment on BP_ResultMosaicElement_C_GetInteractText");
static_assert(sizeof(BP_ResultMosaicElement_C_GetInteractText) == 0x000018, "Wrong size on BP_ResultMosaicElement_C_GetInteractText");
static_assert(offsetof(BP_ResultMosaicElement_C_GetInteractText, Text) == 0x000000, "Member 'BP_ResultMosaicElement_C_GetInteractText::Text' has a wrong offset!");

// Function BP_ResultMosaicElement.BP_ResultMosaicElement_C.GetInteractNoise
// 0x0010 (0x0010 - 0x0000)
struct BP_ResultMosaicElement_C_GetInteractNoise final
{
public:
	bool                                          NoiseOnInteract;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NoiseRange;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultMosaicElement_C_GetInteractNoise) == 0x000008, "Wrong alignment on BP_ResultMosaicElement_C_GetInteractNoise");
static_assert(sizeof(BP_ResultMosaicElement_C_GetInteractNoise) == 0x000010, "Wrong size on BP_ResultMosaicElement_C_GetInteractNoise");
static_assert(offsetof(BP_ResultMosaicElement_C_GetInteractNoise, NoiseOnInteract) == 0x000000, "Member 'BP_ResultMosaicElement_C_GetInteractNoise::NoiseOnInteract' has a wrong offset!");
static_assert(offsetof(BP_ResultMosaicElement_C_GetInteractNoise, NoiseRange) == 0x000008, "Member 'BP_ResultMosaicElement_C_GetInteractNoise::NoiseRange' has a wrong offset!");

// Function BP_ResultMosaicElement.BP_ResultMosaicElement_C.UpdateScreenSize
// 0x0070 (0x0070 - 0x0000)
struct BP_ResultMosaicElement_C_UpdateScreenSize final
{
public:
	class UStaticMeshComponent*                   Screen_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Texture;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Blueprint_GetSizeX_ReturnValue;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Blueprint_GetSizeY_ReturnValue;           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultMosaicElement_C_UpdateScreenSize) == 0x000008, "Wrong alignment on BP_ResultMosaicElement_C_UpdateScreenSize");
static_assert(sizeof(BP_ResultMosaicElement_C_UpdateScreenSize) == 0x000070, "Wrong size on BP_ResultMosaicElement_C_UpdateScreenSize");
static_assert(offsetof(BP_ResultMosaicElement_C_UpdateScreenSize, Screen_0) == 0x000000, "Member 'BP_ResultMosaicElement_C_UpdateScreenSize::Screen_0' has a wrong offset!");
static_assert(offsetof(BP_ResultMosaicElement_C_UpdateScreenSize, Texture) == 0x000008, "Member 'BP_ResultMosaicElement_C_UpdateScreenSize::Texture' has a wrong offset!");
static_assert(offsetof(BP_ResultMosaicElement_C_UpdateScreenSize, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_ResultMosaicElement_C_UpdateScreenSize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMosaicElement_C_UpdateScreenSize, CallFunc_BreakVector_X) == 0x000018, "Member 'BP_ResultMosaicElement_C_UpdateScreenSize::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_ResultMosaicElement_C_UpdateScreenSize, CallFunc_BreakVector_Y) == 0x000020, "Member 'BP_ResultMosaicElement_C_UpdateScreenSize::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_ResultMosaicElement_C_UpdateScreenSize, CallFunc_BreakVector_Z) == 0x000028, "Member 'BP_ResultMosaicElement_C_UpdateScreenSize::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_ResultMosaicElement_C_UpdateScreenSize, CallFunc_Blueprint_GetSizeX_ReturnValue) == 0x000030, "Member 'BP_ResultMosaicElement_C_UpdateScreenSize::CallFunc_Blueprint_GetSizeX_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMosaicElement_C_UpdateScreenSize, CallFunc_Blueprint_GetSizeY_ReturnValue) == 0x000034, "Member 'BP_ResultMosaicElement_C_UpdateScreenSize::CallFunc_Blueprint_GetSizeY_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMosaicElement_C_UpdateScreenSize, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000038, "Member 'BP_ResultMosaicElement_C_UpdateScreenSize::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMosaicElement_C_UpdateScreenSize, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000040, "Member 'BP_ResultMosaicElement_C_UpdateScreenSize::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResultMosaicElement_C_UpdateScreenSize, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000048, "Member 'BP_ResultMosaicElement_C_UpdateScreenSize::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMosaicElement_C_UpdateScreenSize, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_ResultMosaicElement_C_UpdateScreenSize::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMosaicElement_C_UpdateScreenSize, CallFunc_MakeVector_ReturnValue) == 0x000058, "Member 'BP_ResultMosaicElement_C_UpdateScreenSize::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function BP_ResultMosaicElement.BP_ResultMosaicElement_C.GetCaptureTexture
// 0x0058 (0x0058 - 0x0000)
struct BP_ResultMosaicElement_C_GetCaptureTexture final
{
public:
	struct FS_CameroidCapture                     Capture_0;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UTexture2D*                             Texture;                                           // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Map_Find_Value;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultMosaicElement_C_GetCaptureTexture) == 0x000008, "Wrong alignment on BP_ResultMosaicElement_C_GetCaptureTexture");
static_assert(sizeof(BP_ResultMosaicElement_C_GetCaptureTexture) == 0x000058, "Wrong size on BP_ResultMosaicElement_C_GetCaptureTexture");
static_assert(offsetof(BP_ResultMosaicElement_C_GetCaptureTexture, Capture_0) == 0x000000, "Member 'BP_ResultMosaicElement_C_GetCaptureTexture::Capture_0' has a wrong offset!");
static_assert(offsetof(BP_ResultMosaicElement_C_GetCaptureTexture, Texture) == 0x000040, "Member 'BP_ResultMosaicElement_C_GetCaptureTexture::Texture' has a wrong offset!");
static_assert(offsetof(BP_ResultMosaicElement_C_GetCaptureTexture, CallFunc_Map_Find_Value) == 0x000048, "Member 'BP_ResultMosaicElement_C_GetCaptureTexture::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_ResultMosaicElement_C_GetCaptureTexture, CallFunc_Map_Find_ReturnValue) == 0x000050, "Member 'BP_ResultMosaicElement_C_GetCaptureTexture::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function BP_ResultMosaicElement.BP_ResultMosaicElement_C.ShowOnScreen
// 0x0001 (0x0001 - 0x0000)
struct BP_ResultMosaicElement_C_ShowOnScreen final
{
public:
	E_Buttons_Newsvan                             ButtonPressed;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultMosaicElement_C_ShowOnScreen) == 0x000001, "Wrong alignment on BP_ResultMosaicElement_C_ShowOnScreen");
static_assert(sizeof(BP_ResultMosaicElement_C_ShowOnScreen) == 0x000001, "Wrong size on BP_ResultMosaicElement_C_ShowOnScreen");
static_assert(offsetof(BP_ResultMosaicElement_C_ShowOnScreen, ButtonPressed) == 0x000000, "Member 'BP_ResultMosaicElement_C_ShowOnScreen::ButtonPressed' has a wrong offset!");

// Function BP_ResultMosaicElement.BP_ResultMosaicElement_C.SelectScreenShot
// 0x0010 (0x0010 - 0x0000)
struct BP_ResultMosaicElement_C_SelectScreenShot final
{
public:
	class UTexture2D*                             Screenshot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Score;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultMosaicElement_C_SelectScreenShot) == 0x000008, "Wrong alignment on BP_ResultMosaicElement_C_SelectScreenShot");
static_assert(sizeof(BP_ResultMosaicElement_C_SelectScreenShot) == 0x000010, "Wrong size on BP_ResultMosaicElement_C_SelectScreenShot");
static_assert(offsetof(BP_ResultMosaicElement_C_SelectScreenShot, Screenshot) == 0x000000, "Member 'BP_ResultMosaicElement_C_SelectScreenShot::Screenshot' has a wrong offset!");
static_assert(offsetof(BP_ResultMosaicElement_C_SelectScreenShot, Score) == 0x000008, "Member 'BP_ResultMosaicElement_C_SelectScreenShot::Score' has a wrong offset!");
static_assert(offsetof(BP_ResultMosaicElement_C_SelectScreenShot, Index_0) == 0x00000C, "Member 'BP_ResultMosaicElement_C_SelectScreenShot::Index_0' has a wrong offset!");

// Function BP_ResultMosaicElement.BP_ResultMosaicElement_C.Interact
// 0x0008 (0x0008 - 0x0000)
struct BP_ResultMosaicElement_C_Interact final
{
public:
	class ABP_UPPlayerCharacter_C*                Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultMosaicElement_C_Interact) == 0x000008, "Wrong alignment on BP_ResultMosaicElement_C_Interact");
static_assert(sizeof(BP_ResultMosaicElement_C_Interact) == 0x000008, "Wrong size on BP_ResultMosaicElement_C_Interact");
static_assert(offsetof(BP_ResultMosaicElement_C_Interact, Player) == 0x000000, "Member 'BP_ResultMosaicElement_C_Interact::Player' has a wrong offset!");

// Function BP_ResultMosaicElement.BP_ResultMosaicElement_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ResultMosaicElement_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultMosaicElement_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ResultMosaicElement_C_ReceiveTick");
static_assert(sizeof(BP_ResultMosaicElement_C_ReceiveTick) == 0x000004, "Wrong size on BP_ResultMosaicElement_C_ReceiveTick");
static_assert(offsetof(BP_ResultMosaicElement_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ResultMosaicElement_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ResultMosaicElement.BP_ResultMosaicElement_C.SetCapture
// 0x0040 (0x0040 - 0x0000)
struct BP_ResultMosaicElement_C_SetCapture final
{
public:
	struct FS_CameroidCapture                     Capture_0;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultMosaicElement_C_SetCapture) == 0x000008, "Wrong alignment on BP_ResultMosaicElement_C_SetCapture");
static_assert(sizeof(BP_ResultMosaicElement_C_SetCapture) == 0x000040, "Wrong size on BP_ResultMosaicElement_C_SetCapture");
static_assert(offsetof(BP_ResultMosaicElement_C_SetCapture, Capture_0) == 0x000000, "Member 'BP_ResultMosaicElement_C_SetCapture::Capture_0' has a wrong offset!");

// Function BP_ResultMosaicElement.BP_ResultMosaicElement_C.SetVisibility
// 0x0001 (0x0001 - 0x0000)
struct BP_ResultMosaicElement_C_SetVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultMosaicElement_C_SetVisibility) == 0x000001, "Wrong alignment on BP_ResultMosaicElement_C_SetVisibility");
static_assert(sizeof(BP_ResultMosaicElement_C_SetVisibility) == 0x000001, "Wrong size on BP_ResultMosaicElement_C_SetVisibility");
static_assert(offsetof(BP_ResultMosaicElement_C_SetVisibility, Visible) == 0x000000, "Member 'BP_ResultMosaicElement_C_SetVisibility::Visible' has a wrong offset!");

// Function BP_ResultMosaicElement.BP_ResultMosaicElement_C.ExecuteUbergraph_BP_ResultMosaicElement
// 0x0130 (0x0130 - 0x0000)
struct BP_ResultMosaicElement_C_ExecuteUbergraph_BP_ResultMosaicElement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Event_Screenshot;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Score;                                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Buttons_Newsvan                             K2Node_Event_ButtonPressed;                        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                K2Node_Event_Player;                               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetCaptureTexture_Texture;                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0060(0x0018)()
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0080(0x0018)()
	struct FS_CameroidCapture                     K2Node_CustomEvent_Capture_1;                      // 0x0098(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Visible;                        // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_3;        // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FS_CameroidCapture& Capture)> K2Node_CreateDelegate_OutputDelegate;  // 0x00E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_CameroidCapture                     K2Node_CustomEvent_Capture;                        // 0x00F0(0x0040)(HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultMosaicElement_C_ExecuteUbergraph_BP_ResultMosaicElement) == 0x000008, "Wrong alignment on BP_ResultMosaicElement_C_ExecuteUbergraph_BP_ResultMosaicElement");
static_assert(sizeof(BP_ResultMosaicElement_C_ExecuteUbergraph_BP_ResultMosaicElement) == 0x000130, "Wrong size on BP_ResultMosaicElement_C_ExecuteUbergraph_BP_ResultMosaicElement");
static_assert(offsetof(BP_ResultMosaicElement_C_ExecuteUbergraph_BP_ResultMosaicElement, EntryPoint) == 0x000000, "Member 'BP_ResultMosaicElement_C_ExecuteUbergraph_BP_ResultMosaicElement::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ResultMosaicElement_C_ExecuteUbergraph_BP_ResultMosaicElement, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000004, "Member 'BP_ResultMosaicElement_C_ExecuteUbergraph_BP_ResultMosaicElement::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
