#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Rattler

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Rattler.BP_Rattler_C.BndEvt__BP_Rat_Push_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_Rattler_C_BndEvt__BP_Rat_Push_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Rattler_C_BndEvt__BP_Rat_Push_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Rattler_C_BndEvt__BP_Rat_Push_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Rattler_C_BndEvt__BP_Rat_Push_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_Rattler_C_BndEvt__BP_Rat_Push_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Rattler_C_BndEvt__BP_Rat_Push_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Rattler_C_BndEvt__BP_Rat_Push_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Rattler_C_BndEvt__BP_Rat_Push_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Rattler_C_BndEvt__BP_Rat_Push_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Rattler_C_BndEvt__BP_Rat_Push_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Rattler_C_BndEvt__BP_Rat_Push_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Rattler_C_BndEvt__BP_Rat_Push_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Rattler_C_BndEvt__BP_Rat_Push_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Rattler_C_BndEvt__BP_Rat_Push_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_Rattler_C_BndEvt__BP_Rat_Push_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Rattler_C_BndEvt__BP_Rat_Push_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_Rattler_C_BndEvt__BP_Rat_Push_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_Rattler.BP_Rattler_C.ExecuteUbergraph_BP_Rattler
// 0x0138 (0x0138 - 0x0000)
struct BP_Rattler_C_ExecuteUbergraph_BP_Rattler final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0040(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ABP_KillableCharacter_C*                K2Node_DynamicCast_AsBP_Killable_Character;        // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAffinity_Affinity;                     // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0133(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Rattler_C_ExecuteUbergraph_BP_Rattler) == 0x000008, "Wrong alignment on BP_Rattler_C_ExecuteUbergraph_BP_Rattler");
static_assert(sizeof(BP_Rattler_C_ExecuteUbergraph_BP_Rattler) == 0x000138, "Wrong size on BP_Rattler_C_ExecuteUbergraph_BP_Rattler");
static_assert(offsetof(BP_Rattler_C_ExecuteUbergraph_BP_Rattler, EntryPoint) == 0x000000, "Member 'BP_Rattler_C_ExecuteUbergraph_BP_Rattler::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Rattler_C_ExecuteUbergraph_BP_Rattler, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_Rattler_C_ExecuteUbergraph_BP_Rattler::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Rattler_C_ExecuteUbergraph_BP_Rattler, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000020, "Member 'BP_Rattler_C_ExecuteUbergraph_BP_Rattler::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Rattler_C_ExecuteUbergraph_BP_Rattler, K2Node_ComponentBoundEvent_OtherActor) == 0x000028, "Member 'BP_Rattler_C_ExecuteUbergraph_BP_Rattler::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Rattler_C_ExecuteUbergraph_BP_Rattler, K2Node_ComponentBoundEvent_OtherComp) == 0x000030, "Member 'BP_Rattler_C_ExecuteUbergraph_BP_Rattler::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Rattler_C_ExecuteUbergraph_BP_Rattler, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000038, "Member 'BP_Rattler_C_ExecuteUbergraph_BP_Rattler::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Rattler_C_ExecuteUbergraph_BP_Rattler, K2Node_ComponentBoundEvent_bFromSweep) == 0x00003C, "Member 'BP_Rattler_C_ExecuteUbergraph_BP_Rattler::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Rattler_C_ExecuteUbergraph_BP_Rattler, K2Node_ComponentBoundEvent_SweepResult) == 0x000040, "Member 'BP_Rattler_C_ExecuteUbergraph_BP_Rattler::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_Rattler_C_ExecuteUbergraph_BP_Rattler, K2Node_DynamicCast_AsBP_Killable_Character) == 0x000128, "Member 'BP_Rattler_C_ExecuteUbergraph_BP_Rattler::K2Node_DynamicCast_AsBP_Killable_Character' has a wrong offset!");
static_assert(offsetof(BP_Rattler_C_ExecuteUbergraph_BP_Rattler, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'BP_Rattler_C_ExecuteUbergraph_BP_Rattler::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Rattler_C_ExecuteUbergraph_BP_Rattler, CallFunc_IsValid_ReturnValue) == 0x000131, "Member 'BP_Rattler_C_ExecuteUbergraph_BP_Rattler::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Rattler_C_ExecuteUbergraph_BP_Rattler, CallFunc_GetAffinity_Affinity) == 0x000132, "Member 'BP_Rattler_C_ExecuteUbergraph_BP_Rattler::CallFunc_GetAffinity_Affinity' has a wrong offset!");
static_assert(offsetof(BP_Rattler_C_ExecuteUbergraph_BP_Rattler, CallFunc_HasAuthority_ReturnValue) == 0x000133, "Member 'BP_Rattler_C_ExecuteUbergraph_BP_Rattler::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

}

