#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResultTopPicture

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ResultTopPicture.BP_ResultTopPicture_C.AskForCapture
// 0x0004 (0x0004 - 0x0000)
struct BP_ResultTopPicture_C_AskForCapture final
{
public:
	int32                                         CaptureId;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultTopPicture_C_AskForCapture) == 0x000004, "Wrong alignment on BP_ResultTopPicture_C_AskForCapture");
static_assert(sizeof(BP_ResultTopPicture_C_AskForCapture) == 0x000004, "Wrong size on BP_ResultTopPicture_C_AskForCapture");
static_assert(offsetof(BP_ResultTopPicture_C_AskForCapture, CaptureId) == 0x000000, "Member 'BP_ResultTopPicture_C_AskForCapture::CaptureId' has a wrong offset!");

// Function BP_ResultTopPicture.BP_ResultTopPicture_C.ExecuteUbergraph_BP_ResultTopPicture
// 0x0080 (0x0080 - 0x0000)
struct BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPGameState_C*                      K2Node_DynamicCast_AsBP_UPGame_State;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Map_Find_Value;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_CaptureId;                      // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerController_C*               K2Node_DynamicCast_AsBP_UPPlayer_Controller;       // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Visible;                        // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture) == 0x000008, "Wrong alignment on BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture");
static_assert(sizeof(BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture) == 0x000080, "Wrong size on BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture");
static_assert(offsetof(BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture, EntryPoint) == 0x000000, "Member 'BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture, K2Node_DynamicCast_AsBP_UPGame_Instance) == 0x000010, "Member 'BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture::K2Node_DynamicCast_AsBP_UPGame_Instance' has a wrong offset!");
static_assert(offsetof(BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture, CallFunc_GetGameState_ReturnValue) == 0x000020, "Member 'BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture, CallFunc_GetMaterial_ReturnValue) == 0x000028, "Member 'BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture, K2Node_DynamicCast_AsBP_UPGame_State) == 0x000030, "Member 'BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture::K2Node_DynamicCast_AsBP_UPGame_State' has a wrong offset!");
static_assert(offsetof(BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000040, "Member 'BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture, K2Node_Event_DeltaSeconds) == 0x000048, "Member 'BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00004C, "Member 'BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture, CallFunc_Map_Find_Value) == 0x000050, "Member 'BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture, CallFunc_Map_Find_ReturnValue) == 0x000058, "Member 'BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture, Temp_bool_IsClosed_Variable) == 0x000059, "Member 'BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture, K2Node_CustomEvent_CaptureId) == 0x00005C, "Member 'BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture::K2Node_CustomEvent_CaptureId' has a wrong offset!");
static_assert(offsetof(BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture, CallFunc_GetPlayerController_ReturnValue) == 0x000060, "Member 'BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000068, "Member 'BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture, K2Node_DynamicCast_AsBP_UPPlayer_Controller) == 0x000070, "Member 'BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture::K2Node_DynamicCast_AsBP_UPPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture, K2Node_DynamicCast_bSuccess_2) == 0x000078, "Member 'BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture, Temp_bool_Has_Been_Initd_Variable) == 0x000079, "Member 'BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture, K2Node_CustomEvent_Visible) == 0x00007A, "Member 'BP_ResultTopPicture_C_ExecuteUbergraph_BP_ResultTopPicture::K2Node_CustomEvent_Visible' has a wrong offset!");

// Function BP_ResultTopPicture.BP_ResultTopPicture_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ResultTopPicture_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultTopPicture_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ResultTopPicture_C_ReceiveTick");
static_assert(sizeof(BP_ResultTopPicture_C_ReceiveTick) == 0x000004, "Wrong size on BP_ResultTopPicture_C_ReceiveTick");
static_assert(offsetof(BP_ResultTopPicture_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ResultTopPicture_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ResultTopPicture.BP_ResultTopPicture_C.SetVisibility
// 0x0001 (0x0001 - 0x0000)
struct BP_ResultTopPicture_C_SetVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultTopPicture_C_SetVisibility) == 0x000001, "Wrong alignment on BP_ResultTopPicture_C_SetVisibility");
static_assert(sizeof(BP_ResultTopPicture_C_SetVisibility) == 0x000001, "Wrong size on BP_ResultTopPicture_C_SetVisibility");
static_assert(offsetof(BP_ResultTopPicture_C_SetVisibility, Visible) == 0x000000, "Member 'BP_ResultTopPicture_C_SetVisibility::Visible' has a wrong offset!");

}

