#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResultMosaicSelection

#include "Basic.hpp"

#include "S_CameroidCapture_structs.hpp"


namespace SDK::Params
{

// Function BP_ResultMosaicSelection.BP_ResultMosaicSelection_C.ExecuteUbergraph_BP_ResultMosaicSelection
// 0x0050 (0x0050 - 0x0000)
struct BP_ResultMosaicSelection_C_ExecuteUbergraph_BP_ResultMosaicSelection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ResultSelectionDetails_C*            CallFunc_GetWidget_Widget;                         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FS_CameroidCapture                     K2Node_Event_Capture;                              // 0x0010(0x0040)(HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultMosaicSelection_C_ExecuteUbergraph_BP_ResultMosaicSelection) == 0x000008, "Wrong alignment on BP_ResultMosaicSelection_C_ExecuteUbergraph_BP_ResultMosaicSelection");
static_assert(sizeof(BP_ResultMosaicSelection_C_ExecuteUbergraph_BP_ResultMosaicSelection) == 0x000050, "Wrong size on BP_ResultMosaicSelection_C_ExecuteUbergraph_BP_ResultMosaicSelection");
static_assert(offsetof(BP_ResultMosaicSelection_C_ExecuteUbergraph_BP_ResultMosaicSelection, EntryPoint) == 0x000000, "Member 'BP_ResultMosaicSelection_C_ExecuteUbergraph_BP_ResultMosaicSelection::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ResultMosaicSelection_C_ExecuteUbergraph_BP_ResultMosaicSelection, CallFunc_GetWidget_Widget) == 0x000008, "Member 'BP_ResultMosaicSelection_C_ExecuteUbergraph_BP_ResultMosaicSelection::CallFunc_GetWidget_Widget' has a wrong offset!");
static_assert(offsetof(BP_ResultMosaicSelection_C_ExecuteUbergraph_BP_ResultMosaicSelection, K2Node_Event_Capture) == 0x000010, "Member 'BP_ResultMosaicSelection_C_ExecuteUbergraph_BP_ResultMosaicSelection::K2Node_Event_Capture' has a wrong offset!");

// Function BP_ResultMosaicSelection.BP_ResultMosaicSelection_C.GetWidget
// 0x0028 (0x0028 - 0x0000)
struct BP_ResultMosaicSelection_C_GetWidget final
{
public:
	class UW_ResultSelectionDetails_C*            Widget_0;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ResultSelectionDetails_C*            K2Node_DynamicCast_AsW_Result_Selection_Details;   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultMosaicSelection_C_GetWidget) == 0x000008, "Wrong alignment on BP_ResultMosaicSelection_C_GetWidget");
static_assert(sizeof(BP_ResultMosaicSelection_C_GetWidget) == 0x000028, "Wrong size on BP_ResultMosaicSelection_C_GetWidget");
static_assert(offsetof(BP_ResultMosaicSelection_C_GetWidget, Widget_0) == 0x000000, "Member 'BP_ResultMosaicSelection_C_GetWidget::Widget_0' has a wrong offset!");
static_assert(offsetof(BP_ResultMosaicSelection_C_GetWidget, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_ResultMosaicSelection_C_GetWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMosaicSelection_C_GetWidget, CallFunc_GetWidget_ReturnValue) == 0x000010, "Member 'BP_ResultMosaicSelection_C_GetWidget::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultMosaicSelection_C_GetWidget, K2Node_DynamicCast_AsW_Result_Selection_Details) == 0x000018, "Member 'BP_ResultMosaicSelection_C_GetWidget::K2Node_DynamicCast_AsW_Result_Selection_Details' has a wrong offset!");
static_assert(offsetof(BP_ResultMosaicSelection_C_GetWidget, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_ResultMosaicSelection_C_GetWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_ResultMosaicSelection.BP_ResultMosaicSelection_C.SelectionChanged
// 0x0040 (0x0040 - 0x0000)
struct BP_ResultMosaicSelection_C_SelectionChanged final
{
public:
	struct FS_CameroidCapture                     Capture_0;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultMosaicSelection_C_SelectionChanged) == 0x000008, "Wrong alignment on BP_ResultMosaicSelection_C_SelectionChanged");
static_assert(sizeof(BP_ResultMosaicSelection_C_SelectionChanged) == 0x000040, "Wrong size on BP_ResultMosaicSelection_C_SelectionChanged");
static_assert(offsetof(BP_ResultMosaicSelection_C_SelectionChanged, Capture_0) == 0x000000, "Member 'BP_ResultMosaicSelection_C_SelectionChanged::Capture_0' has a wrong offset!");

}

