#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResultNeonSign

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ResultNeonSign.BP_ResultNeonSign_C
// 0x0098 (0x0330 - 0x0298)
class ABP_ResultNeonSign_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       Widget;                                            // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            TextColor;                                         // 0x02A8(0x0014)(Edit, BlueprintVisible)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         TextFont;                                          // 0x02C0(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0318(0x0018)(Edit, BlueprintVisible)

public:
	void UserConstructionScript();
	void UpdateNeonWidgetSettings();
	void UpdateDelayed();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_ResultNeonSign(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ResultNeonSign_C">();
	}
	static class ABP_ResultNeonSign_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ResultNeonSign_C>();
	}
};
static_assert(alignof(ABP_ResultNeonSign_C) == 0x000008, "Wrong alignment on ABP_ResultNeonSign_C");
static_assert(sizeof(ABP_ResultNeonSign_C) == 0x000330, "Wrong size on ABP_ResultNeonSign_C");
static_assert(offsetof(ABP_ResultNeonSign_C, UberGraphFrame) == 0x000298, "Member 'ABP_ResultNeonSign_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ResultNeonSign_C, Widget) == 0x0002A0, "Member 'ABP_ResultNeonSign_C::Widget' has a wrong offset!");
static_assert(offsetof(ABP_ResultNeonSign_C, TextColor) == 0x0002A8, "Member 'ABP_ResultNeonSign_C::TextColor' has a wrong offset!");
static_assert(offsetof(ABP_ResultNeonSign_C, TextFont) == 0x0002C0, "Member 'ABP_ResultNeonSign_C::TextFont' has a wrong offset!");
static_assert(offsetof(ABP_ResultNeonSign_C, Text) == 0x000318, "Member 'ABP_ResultNeonSign_C::Text' has a wrong offset!");

}

