#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RadioItem

#include "Basic.hpp"

#include "BP_InventoryItem_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RadioItem.BP_RadioItem_C
// 0x0030 (0x03A0 - 0x0370)
class ABP_RadioItem_C final : public ABP_InventoryItem_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_RadioItem_C;                     // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   GreenLed;                                          // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_VoiceChat_C*                        VoiceChat;                                         // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Connected;                                         // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundCue*                              OnSfx;                                             // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              OffSfx;                                            // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ConnectToRadio();
	void ExecuteUbergraph_BP_RadioItem(int32 EntryPoint);
	void GetVoiceChat(bool* IsReady, class ABP_VoiceChat_C** VoiceChat_0);
	void OnRep_IsEquipped();
	void OnRep_IsInFocus();
	void OnRep_Player();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void UpdateLed(bool LedVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RadioItem_C">();
	}
	static class ABP_RadioItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RadioItem_C>();
	}
};
static_assert(alignof(ABP_RadioItem_C) == 0x000008, "Wrong alignment on ABP_RadioItem_C");
static_assert(sizeof(ABP_RadioItem_C) == 0x0003A0, "Wrong size on ABP_RadioItem_C");
static_assert(offsetof(ABP_RadioItem_C, UberGraphFrame_BP_RadioItem_C) == 0x000370, "Member 'ABP_RadioItem_C::UberGraphFrame_BP_RadioItem_C' has a wrong offset!");
static_assert(offsetof(ABP_RadioItem_C, GreenLed) == 0x000378, "Member 'ABP_RadioItem_C::GreenLed' has a wrong offset!");
static_assert(offsetof(ABP_RadioItem_C, VoiceChat) == 0x000380, "Member 'ABP_RadioItem_C::VoiceChat' has a wrong offset!");
static_assert(offsetof(ABP_RadioItem_C, Connected) == 0x000388, "Member 'ABP_RadioItem_C::Connected' has a wrong offset!");
static_assert(offsetof(ABP_RadioItem_C, OnSfx) == 0x000390, "Member 'ABP_RadioItem_C::OnSfx' has a wrong offset!");
static_assert(offsetof(ABP_RadioItem_C, OffSfx) == 0x000398, "Member 'ABP_RadioItem_C::OffSfx' has a wrong offset!");

}

