#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResultSaveBtn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_InteractableActor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ResultSaveBtn.BP_ResultSaveBtn_C
// 0x0020 (0x0300 - 0x02E0)
class ABP_ResultSaveBtn_C final : public ABP_InteractableActor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_ResultSaveBtn_C;                 // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Icon;                                              // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_ResultTV_C*                         ResultTV;                                          // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ABP_ResultMosaicSelection_C*            Selection;                                         // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds);
	void Interact(class ABP_UPPlayerCharacter_C* Player);
	void GetInteractText(class FText* Text);
	void ExecuteUbergraph_BP_ResultSaveBtn(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ResultSaveBtn_C">();
	}
	static class ABP_ResultSaveBtn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ResultSaveBtn_C>();
	}
};
static_assert(alignof(ABP_ResultSaveBtn_C) == 0x000008, "Wrong alignment on ABP_ResultSaveBtn_C");
static_assert(sizeof(ABP_ResultSaveBtn_C) == 0x000300, "Wrong size on ABP_ResultSaveBtn_C");
static_assert(offsetof(ABP_ResultSaveBtn_C, UberGraphFrame_BP_ResultSaveBtn_C) == 0x0002E0, "Member 'ABP_ResultSaveBtn_C::UberGraphFrame_BP_ResultSaveBtn_C' has a wrong offset!");
static_assert(offsetof(ABP_ResultSaveBtn_C, Icon) == 0x0002E8, "Member 'ABP_ResultSaveBtn_C::Icon' has a wrong offset!");
static_assert(offsetof(ABP_ResultSaveBtn_C, ResultTV) == 0x0002F0, "Member 'ABP_ResultSaveBtn_C::ResultTV' has a wrong offset!");
static_assert(offsetof(ABP_ResultSaveBtn_C, Selection) == 0x0002F8, "Member 'ABP_ResultSaveBtn_C::Selection' has a wrong offset!");

}

