#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Reaper

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Reaper.BP_Reaper_C.ExecuteUbergraph_BP_Reaper
// 0x0088 (0x0088 - 0x0000)
struct BP_Reaper_C_ExecuteUbergraph_BP_Reaper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_KillableCharacter_C*                K2Node_CustomEvent_Character;                      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_KillableCharacter_C*                CallFunc_GetTargetInRange_Character;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SetAudioAttachedEnabled_OutAudio;         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Reaper_C_ExecuteUbergraph_BP_Reaper) == 0x000008, "Wrong alignment on BP_Reaper_C_ExecuteUbergraph_BP_Reaper");
static_assert(sizeof(BP_Reaper_C_ExecuteUbergraph_BP_Reaper) == 0x000088, "Wrong size on BP_Reaper_C_ExecuteUbergraph_BP_Reaper");
static_assert(offsetof(BP_Reaper_C_ExecuteUbergraph_BP_Reaper, EntryPoint) == 0x000000, "Member 'BP_Reaper_C_ExecuteUbergraph_BP_Reaper::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Reaper_C_ExecuteUbergraph_BP_Reaper, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'BP_Reaper_C_ExecuteUbergraph_BP_Reaper::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Reaper_C_ExecuteUbergraph_BP_Reaper, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_Reaper_C_ExecuteUbergraph_BP_Reaper::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Reaper_C_ExecuteUbergraph_BP_Reaper, K2Node_CustomEvent_Character) == 0x000028, "Member 'BP_Reaper_C_ExecuteUbergraph_BP_Reaper::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(BP_Reaper_C_ExecuteUbergraph_BP_Reaper, CallFunc_GetTargetInRange_Character) == 0x000030, "Member 'BP_Reaper_C_ExecuteUbergraph_BP_Reaper::CallFunc_GetTargetInRange_Character' has a wrong offset!");
static_assert(offsetof(BP_Reaper_C_ExecuteUbergraph_BP_Reaper, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'BP_Reaper_C_ExecuteUbergraph_BP_Reaper::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Reaper_C_ExecuteUbergraph_BP_Reaper, CallFunc_RandomFloatInRange_ReturnValue) == 0x000040, "Member 'BP_Reaper_C_ExecuteUbergraph_BP_Reaper::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Reaper_C_ExecuteUbergraph_BP_Reaper, K2Node_Event_DeltaSeconds) == 0x000048, "Member 'BP_Reaper_C_ExecuteUbergraph_BP_Reaper::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Reaper_C_ExecuteUbergraph_BP_Reaper, CallFunc_SetAudioAttachedEnabled_OutAudio) == 0x000050, "Member 'BP_Reaper_C_ExecuteUbergraph_BP_Reaper::CallFunc_SetAudioAttachedEnabled_OutAudio' has a wrong offset!");
static_assert(offsetof(BP_Reaper_C_ExecuteUbergraph_BP_Reaper, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000058, "Member 'BP_Reaper_C_ExecuteUbergraph_BP_Reaper::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Reaper_C_ExecuteUbergraph_BP_Reaper, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000070, "Member 'BP_Reaper_C_ExecuteUbergraph_BP_Reaper::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Reaper_C_ExecuteUbergraph_BP_Reaper, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x000078, "Member 'BP_Reaper_C_ExecuteUbergraph_BP_Reaper::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Reaper_C_ExecuteUbergraph_BP_Reaper, CallFunc_Delay_Duration_ImplicitCast) == 0x000080, "Member 'BP_Reaper_C_ExecuteUbergraph_BP_Reaper::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function BP_Reaper.BP_Reaper_C.GetTargetInRange
// 0x0050 (0x0050 - 0x0000)
struct BP_Reaper_C_GetTargetInRange final
{
public:
	class ABP_KillableCharacter_C*                Character;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_KillableCharacter_C*                K2Node_DynamicCast_AsBP_Killable_Character;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Reaper_C_GetTargetInRange) == 0x000008, "Wrong alignment on BP_Reaper_C_GetTargetInRange");
static_assert(sizeof(BP_Reaper_C_GetTargetInRange) == 0x000050, "Wrong size on BP_Reaper_C_GetTargetInRange");
static_assert(offsetof(BP_Reaper_C_GetTargetInRange, Character) == 0x000000, "Member 'BP_Reaper_C_GetTargetInRange::Character' has a wrong offset!");
static_assert(offsetof(BP_Reaper_C_GetTargetInRange, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_Reaper_C_GetTargetInRange::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Reaper_C_GetTargetInRange, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_Reaper_C_GetTargetInRange::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Reaper_C_GetTargetInRange, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_Reaper_C_GetTargetInRange::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Reaper_C_GetTargetInRange, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000018, "Member 'BP_Reaper_C_GetTargetInRange::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_Reaper_C_GetTargetInRange, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_Reaper_C_GetTargetInRange::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Reaper_C_GetTargetInRange, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_Reaper_C_GetTargetInRange::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Reaper_C_GetTargetInRange, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_Reaper_C_GetTargetInRange::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Reaper_C_GetTargetInRange, K2Node_DynamicCast_AsBP_Killable_Character) == 0x000040, "Member 'BP_Reaper_C_GetTargetInRange::K2Node_DynamicCast_AsBP_Killable_Character' has a wrong offset!");
static_assert(offsetof(BP_Reaper_C_GetTargetInRange, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_Reaper_C_GetTargetInRange::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_Reaper.BP_Reaper_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Reaper_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Reaper_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Reaper_C_ReceiveTick");
static_assert(sizeof(BP_Reaper_C_ReceiveTick) == 0x000004, "Wrong size on BP_Reaper_C_ReceiveTick");
static_assert(offsetof(BP_Reaper_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Reaper_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Reaper.BP_Reaper_C.ReleaseTarget
// 0x0008 (0x0008 - 0x0000)
struct BP_Reaper_C_ReleaseTarget final
{
public:
	class ABP_KillableCharacter_C*                Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Reaper_C_ReleaseTarget) == 0x000008, "Wrong alignment on BP_Reaper_C_ReleaseTarget");
static_assert(sizeof(BP_Reaper_C_ReleaseTarget) == 0x000008, "Wrong size on BP_Reaper_C_ReleaseTarget");
static_assert(offsetof(BP_Reaper_C_ReleaseTarget, Character) == 0x000000, "Member 'BP_Reaper_C_ReleaseTarget::Character' has a wrong offset!");

// Function BP_Reaper.BP_Reaper_C.SetAudioAttachedEnabled
// 0x0030 (0x0030 - 0x0000)
struct BP_Reaper_C_SetAudioAttachedEnabled final
{
public:
	class UAudioComponent*                        InAudio;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Sound;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Enabled;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        OutAudio;                                          // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Reaper_C_SetAudioAttachedEnabled) == 0x000008, "Wrong alignment on BP_Reaper_C_SetAudioAttachedEnabled");
static_assert(sizeof(BP_Reaper_C_SetAudioAttachedEnabled) == 0x000030, "Wrong size on BP_Reaper_C_SetAudioAttachedEnabled");
static_assert(offsetof(BP_Reaper_C_SetAudioAttachedEnabled, InAudio) == 0x000000, "Member 'BP_Reaper_C_SetAudioAttachedEnabled::InAudio' has a wrong offset!");
static_assert(offsetof(BP_Reaper_C_SetAudioAttachedEnabled, Sound) == 0x000008, "Member 'BP_Reaper_C_SetAudioAttachedEnabled::Sound' has a wrong offset!");
static_assert(offsetof(BP_Reaper_C_SetAudioAttachedEnabled, Enabled) == 0x000010, "Member 'BP_Reaper_C_SetAudioAttachedEnabled::Enabled' has a wrong offset!");
static_assert(offsetof(BP_Reaper_C_SetAudioAttachedEnabled, OutAudio) == 0x000018, "Member 'BP_Reaper_C_SetAudioAttachedEnabled::OutAudio' has a wrong offset!");
static_assert(offsetof(BP_Reaper_C_SetAudioAttachedEnabled, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000020, "Member 'BP_Reaper_C_SetAudioAttachedEnabled::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Reaper_C_SetAudioAttachedEnabled, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_Reaper_C_SetAudioAttachedEnabled::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Reaper_C_SetAudioAttachedEnabled, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000029, "Member 'BP_Reaper_C_SetAudioAttachedEnabled::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

}

