#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResultTV

#include "Basic.hpp"

#include "S_CameroidCapture_structs.hpp"
#include "S_CameroidCaptureGroup_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ResultTV.BP_ResultTV_C.AreAllSessionPlayersConnected
// 0x0038 (0x0038 - 0x0000)
struct BP_ResultTV_C_AreAllSessionPlayersConnected final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerState_C*                    CallFunc_GetPlayerStateById_PlayerState;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultTV_C_AreAllSessionPlayersConnected) == 0x000008, "Wrong alignment on BP_ResultTV_C_AreAllSessionPlayersConnected");
static_assert(sizeof(BP_ResultTV_C_AreAllSessionPlayersConnected) == 0x000038, "Wrong size on BP_ResultTV_C_AreAllSessionPlayersConnected");
static_assert(offsetof(BP_ResultTV_C_AreAllSessionPlayersConnected, Result) == 0x000000, "Member 'BP_ResultTV_C_AreAllSessionPlayersConnected::Result' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_AreAllSessionPlayersConnected, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_ResultTV_C_AreAllSessionPlayersConnected::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_AreAllSessionPlayersConnected, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_ResultTV_C_AreAllSessionPlayersConnected::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_AreAllSessionPlayersConnected, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_ResultTV_C_AreAllSessionPlayersConnected::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_AreAllSessionPlayersConnected, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_ResultTV_C_AreAllSessionPlayersConnected::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_AreAllSessionPlayersConnected, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_ResultTV_C_AreAllSessionPlayersConnected::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_AreAllSessionPlayersConnected, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'BP_ResultTV_C_AreAllSessionPlayersConnected::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_AreAllSessionPlayersConnected, CallFunc_GetPlayerStateById_PlayerState) == 0x000028, "Member 'BP_ResultTV_C_AreAllSessionPlayersConnected::CallFunc_GetPlayerStateById_PlayerState' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_AreAllSessionPlayersConnected, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_ResultTV_C_AreAllSessionPlayersConnected::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_ResultTV.BP_ResultTV_C.ExecuteUbergraph_BP_ResultTV
// 0x0268 (0x0268 - 0x0000)
struct BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_CameroidCapture                     CallFunc_GetCapture_Capture;                       // 0x0008(0x0040)(HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPGameState_C*                      K2Node_DynamicCast_AsBP_UPGame_State;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                K2Node_Event_Player;                               // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_CameroidCapture                     K2Node_CustomEvent_Capture;                        // 0x0080(0x0040)(HasGetValueTypeHash)
	class ABP_ResultMosaicElement_C*              CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_CameroidCapture                     CallFunc_GetCapture_Capture_1;                     // 0x00E0(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_Episodes_C*                         CallFunc_GetActorOfClass_ReturnValue;              // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_ResultRecap_C*                       K2Node_DynamicCast_AsW_Result_Recap;               // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTotalPoints_Points;                    // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0170(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01C0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0210(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0220(0x0018)()
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasInSession_Result;                      // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x023A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x023B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0240(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Episodes_C*                         CallFunc_GetActorOfClass_ReturnValue_1;            // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AllPlayersDiedLastSession_AllPlayersDied; // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV) == 0x000008, "Wrong alignment on BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV");
static_assert(sizeof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV) == 0x000268, "Wrong size on BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, EntryPoint) == 0x000000, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_GetCapture_Capture) == 0x000008, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_GetCapture_Capture' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_HasAuthority_ReturnValue) == 0x000054, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_GetGameState_ReturnValue) == 0x000058, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_HasAuthority_ReturnValue_1) == 0x000060, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, K2Node_DynamicCast_AsBP_UPGame_State) == 0x000068, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::K2Node_DynamicCast_AsBP_UPGame_State' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, K2Node_Event_Player) == 0x000078, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, K2Node_CustomEvent_Capture) == 0x000080, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::K2Node_CustomEvent_Capture' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_Array_Length_ReturnValue) == 0x0000C8, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_Array_Length_ReturnValue_1) == 0x0000CC, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_Less_IntInt_ReturnValue) == 0x0000D0, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_Multiply_IntInt_ReturnValue) == 0x0000D4, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000D8, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_GetCapture_Capture_1) == 0x0000E0, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_GetCapture_Capture_1' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000120, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_GetWidget_ReturnValue) == 0x000128, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_GetActorOfClass_ReturnValue) == 0x000130, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, K2Node_DynamicCast_AsW_Result_Recap) == 0x000138, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::K2Node_DynamicCast_AsW_Result_Recap' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, K2Node_DynamicCast_bSuccess_1) == 0x000140, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_GetTotalPoints_Points) == 0x000144, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_GetTotalPoints_Points' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_Add_IntInt_ReturnValue_2) == 0x000148, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_Greater_IntInt_ReturnValue) == 0x00014C, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_Subtract_IntInt_ReturnValue) == 0x000150, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_Less_IntInt_ReturnValue_1) == 0x000154, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_Add_IntInt_ReturnValue_3) == 0x000158, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_Add_IntInt_ReturnValue_4) == 0x00015C, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000160, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000168, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, K2Node_MakeStruct_FormatArgumentData) == 0x000170, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001C0, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, K2Node_MakeArray_Array) == 0x000210, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_Format_ReturnValue) == 0x000220, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000238, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_WasInSession_Result) == 0x000239, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_WasInSession_Result' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_Not_PreBool_ReturnValue) == 0x00023A, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_BooleanAND_ReturnValue) == 0x00023B, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00023C, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, K2Node_CreateDelegate_OutputDelegate) == 0x000240, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_BooleanAND_ReturnValue_1) == 0x000250, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_GetActorOfClass_ReturnValue_1) == 0x000258, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_GetActorOfClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV, CallFunc_AllPlayersDiedLastSession_AllPlayersDied) == 0x000260, "Member 'BP_ResultTV_C_ExecuteUbergraph_BP_ResultTV::CallFunc_AllPlayersDiedLastSession_AllPlayersDied' has a wrong offset!");

// Function BP_ResultTV.BP_ResultTV_C.FetchAllCaptures
// 0x00D8 (0x00D8 - 0x0000)
struct BP_ResultTV_C_FetchAllCaptures final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_CameroidCaptureGroup                CallFunc_Array_Get_Item;                           // 0x0028(0x0010)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_CameroidCapture                     CallFunc_Array_Get_Item_1;                         // 0x0040(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_CameroidCapture                     K2Node_SetFieldsInStruct_StructOut;                // 0x0088(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultTV_C_FetchAllCaptures) == 0x000008, "Wrong alignment on BP_ResultTV_C_FetchAllCaptures");
static_assert(sizeof(BP_ResultTV_C_FetchAllCaptures) == 0x0000D8, "Wrong size on BP_ResultTV_C_FetchAllCaptures");
static_assert(offsetof(BP_ResultTV_C_FetchAllCaptures, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_ResultTV_C_FetchAllCaptures::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_FetchAllCaptures, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_ResultTV_C_FetchAllCaptures::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_FetchAllCaptures, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_ResultTV_C_FetchAllCaptures::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_FetchAllCaptures, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BP_ResultTV_C_FetchAllCaptures::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_FetchAllCaptures, CallFunc_Array_Length_ReturnValue_1) == 0x000010, "Member 'BP_ResultTV_C_FetchAllCaptures::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_FetchAllCaptures, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'BP_ResultTV_C_FetchAllCaptures::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_FetchAllCaptures, CallFunc_Divide_IntInt_ReturnValue) == 0x000018, "Member 'BP_ResultTV_C_FetchAllCaptures::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_FetchAllCaptures, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00001C, "Member 'BP_ResultTV_C_FetchAllCaptures::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_FetchAllCaptures, Temp_int_Loop_Counter_Variable_1) == 0x000020, "Member 'BP_ResultTV_C_FetchAllCaptures::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_FetchAllCaptures, CallFunc_Add_IntInt_ReturnValue_1) == 0x000024, "Member 'BP_ResultTV_C_FetchAllCaptures::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_FetchAllCaptures, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_ResultTV_C_FetchAllCaptures::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_FetchAllCaptures, CallFunc_Array_Length_ReturnValue_2) == 0x000038, "Member 'BP_ResultTV_C_FetchAllCaptures::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_FetchAllCaptures, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'BP_ResultTV_C_FetchAllCaptures::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_FetchAllCaptures, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'BP_ResultTV_C_FetchAllCaptures::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_FetchAllCaptures, CallFunc_Array_Add_ReturnValue) == 0x000084, "Member 'BP_ResultTV_C_FetchAllCaptures::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_FetchAllCaptures, K2Node_SetFieldsInStruct_StructOut) == 0x000088, "Member 'BP_ResultTV_C_FetchAllCaptures::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_FetchAllCaptures, CallFunc_Array_Length_ReturnValue_3) == 0x0000C8, "Member 'BP_ResultTV_C_FetchAllCaptures::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_FetchAllCaptures, CallFunc_Array_Add_ReturnValue_1) == 0x0000CC, "Member 'BP_ResultTV_C_FetchAllCaptures::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_FetchAllCaptures, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000D0, "Member 'BP_ResultTV_C_FetchAllCaptures::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_ResultTV.BP_ResultTV_C.GetCapture
// 0x0050 (0x0050 - 0x0000)
struct BP_ResultTV_C_GetCapture final
{
public:
	int32                                         CaptureIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_CameroidCapture                     Capture;                                           // 0x0008(0x0040)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultTV_C_GetCapture) == 0x000008, "Wrong alignment on BP_ResultTV_C_GetCapture");
static_assert(sizeof(BP_ResultTV_C_GetCapture) == 0x000050, "Wrong size on BP_ResultTV_C_GetCapture");
static_assert(offsetof(BP_ResultTV_C_GetCapture, CaptureIndex) == 0x000000, "Member 'BP_ResultTV_C_GetCapture::CaptureIndex' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_GetCapture, Capture) == 0x000008, "Member 'BP_ResultTV_C_GetCapture::Capture' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_GetCapture, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000048, "Member 'BP_ResultTV_C_GetCapture::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function BP_ResultTV.BP_ResultTV_C.GetInteractDistance
// 0x0010 (0x0010 - 0x0000)
struct BP_ResultTV_C_GetInteractDistance final
{
public:
	double                                        Distance;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultTV_C_GetInteractDistance) == 0x000008, "Wrong alignment on BP_ResultTV_C_GetInteractDistance");
static_assert(sizeof(BP_ResultTV_C_GetInteractDistance) == 0x000010, "Wrong size on BP_ResultTV_C_GetInteractDistance");
static_assert(offsetof(BP_ResultTV_C_GetInteractDistance, Distance) == 0x000000, "Member 'BP_ResultTV_C_GetInteractDistance::Distance' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_GetInteractDistance, CallFunc_BooleanOR_ReturnValue) == 0x000008, "Member 'BP_ResultTV_C_GetInteractDistance::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_ResultTV.BP_ResultTV_C.GetInteractDuration
// 0x0008 (0x0008 - 0x0000)
struct BP_ResultTV_C_GetInteractDuration final
{
public:
	double                                        Duration;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultTV_C_GetInteractDuration) == 0x000008, "Wrong alignment on BP_ResultTV_C_GetInteractDuration");
static_assert(sizeof(BP_ResultTV_C_GetInteractDuration) == 0x000008, "Wrong size on BP_ResultTV_C_GetInteractDuration");
static_assert(offsetof(BP_ResultTV_C_GetInteractDuration, Duration) == 0x000000, "Member 'BP_ResultTV_C_GetInteractDuration::Duration' has a wrong offset!");

// Function BP_ResultTV.BP_ResultTV_C.GetInteractNoise
// 0x0010 (0x0010 - 0x0000)
struct BP_ResultTV_C_GetInteractNoise final
{
public:
	bool                                          NoiseOnInteract;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NoiseRange;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultTV_C_GetInteractNoise) == 0x000008, "Wrong alignment on BP_ResultTV_C_GetInteractNoise");
static_assert(sizeof(BP_ResultTV_C_GetInteractNoise) == 0x000010, "Wrong size on BP_ResultTV_C_GetInteractNoise");
static_assert(offsetof(BP_ResultTV_C_GetInteractNoise, NoiseOnInteract) == 0x000000, "Member 'BP_ResultTV_C_GetInteractNoise::NoiseOnInteract' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_GetInteractNoise, NoiseRange) == 0x000008, "Member 'BP_ResultTV_C_GetInteractNoise::NoiseRange' has a wrong offset!");

// Function BP_ResultTV.BP_ResultTV_C.GetInteractText
// 0x0018 (0x0018 - 0x0000)
struct BP_ResultTV_C_GetInteractText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(Parm, OutParm)
};
static_assert(alignof(BP_ResultTV_C_GetInteractText) == 0x000008, "Wrong alignment on BP_ResultTV_C_GetInteractText");
static_assert(sizeof(BP_ResultTV_C_GetInteractText) == 0x000018, "Wrong size on BP_ResultTV_C_GetInteractText");
static_assert(offsetof(BP_ResultTV_C_GetInteractText, Text) == 0x000000, "Member 'BP_ResultTV_C_GetInteractText::Text' has a wrong offset!");

// Function BP_ResultTV.BP_ResultTV_C.GetTotalPoints
// 0x0038 (0x0038 - 0x0000)
struct BP_ResultTV_C_GetTotalPoints final
{
public:
	int32                                         Points;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _Points;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_CameroidCaptureGroup                CallFunc_Array_Get_Item;                           // 0x0018(0x0010)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultTV_C_GetTotalPoints) == 0x000008, "Wrong alignment on BP_ResultTV_C_GetTotalPoints");
static_assert(sizeof(BP_ResultTV_C_GetTotalPoints) == 0x000038, "Wrong size on BP_ResultTV_C_GetTotalPoints");
static_assert(offsetof(BP_ResultTV_C_GetTotalPoints, Points) == 0x000000, "Member 'BP_ResultTV_C_GetTotalPoints::Points' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_GetTotalPoints, _Points) == 0x000004, "Member 'BP_ResultTV_C_GetTotalPoints::_Points' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_GetTotalPoints, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_ResultTV_C_GetTotalPoints::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_GetTotalPoints, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_ResultTV_C_GetTotalPoints::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_GetTotalPoints, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_ResultTV_C_GetTotalPoints::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_GetTotalPoints, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_ResultTV_C_GetTotalPoints::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_GetTotalPoints, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_ResultTV_C_GetTotalPoints::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_GetTotalPoints, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_ResultTV_C_GetTotalPoints::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_GetTotalPoints, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'BP_ResultTV_C_GetTotalPoints::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_ResultTV.BP_ResultTV_C.Interact
// 0x0008 (0x0008 - 0x0000)
struct BP_ResultTV_C_Interact final
{
public:
	class ABP_UPPlayerCharacter_C*                Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultTV_C_Interact) == 0x000008, "Wrong alignment on BP_ResultTV_C_Interact");
static_assert(sizeof(BP_ResultTV_C_Interact) == 0x000008, "Wrong size on BP_ResultTV_C_Interact");
static_assert(offsetof(BP_ResultTV_C_Interact, Player) == 0x000000, "Member 'BP_ResultTV_C_Interact::Player' has a wrong offset!");

// Function BP_ResultTV.BP_ResultTV_C.SelectMosaicCapture
// 0x0040 (0x0040 - 0x0000)
struct BP_ResultTV_C_SelectMosaicCapture final
{
public:
	struct FS_CameroidCapture                     Capture;                                           // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultTV_C_SelectMosaicCapture) == 0x000008, "Wrong alignment on BP_ResultTV_C_SelectMosaicCapture");
static_assert(sizeof(BP_ResultTV_C_SelectMosaicCapture) == 0x000040, "Wrong size on BP_ResultTV_C_SelectMosaicCapture");
static_assert(offsetof(BP_ResultTV_C_SelectMosaicCapture, Capture) == 0x000000, "Member 'BP_ResultTV_C_SelectMosaicCapture::Capture' has a wrong offset!");

// Function BP_ResultTV.BP_ResultTV_C.SetMosaicVisibility
// 0x0020 (0x0020 - 0x0000)
struct BP_ResultTV_C_SetMosaicVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ResultMosaicElement_C*              CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultTV_C_SetMosaicVisibility) == 0x000008, "Wrong alignment on BP_ResultTV_C_SetMosaicVisibility");
static_assert(sizeof(BP_ResultTV_C_SetMosaicVisibility) == 0x000020, "Wrong size on BP_ResultTV_C_SetMosaicVisibility");
static_assert(offsetof(BP_ResultTV_C_SetMosaicVisibility, Visible) == 0x000000, "Member 'BP_ResultTV_C_SetMosaicVisibility::Visible' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_SetMosaicVisibility, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_ResultTV_C_SetMosaicVisibility::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResultTV_C_SetMosaicVisibility, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_ResultTV_C_SetMosaicVisibility::Temp_int_Loop_Counter_Variable' has a wrong offset!");
