#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResultMosaicSelection

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ResultMosaicElement_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ResultMosaicSelection.BP_ResultMosaicSelection_C
// 0x0018 (0x0358 - 0x0340)
class ABP_ResultMosaicSelection_C final : public ABP_ResultMosaicElement_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_ResultMosaicSelection_C;         // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       DetailsWidget;                                     // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UW_ResultSelectionDetails_C*            Widget;                                            // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ResultMosaicSelection(int32 EntryPoint);
	void GetWidget(class UW_ResultSelectionDetails_C** Widget_0);
	void SelectionChanged(const struct FS_CameroidCapture& Capture_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ResultMosaicSelection_C">();
	}
	static class ABP_ResultMosaicSelection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ResultMosaicSelection_C>();
	}
};
static_assert(alignof(ABP_ResultMosaicSelection_C) == 0x000008, "Wrong alignment on ABP_ResultMosaicSelection_C");
static_assert(sizeof(ABP_ResultMosaicSelection_C) == 0x000358, "Wrong size on ABP_ResultMosaicSelection_C");
static_assert(offsetof(ABP_ResultMosaicSelection_C, UberGraphFrame_BP_ResultMosaicSelection_C) == 0x000340, "Member 'ABP_ResultMosaicSelection_C::UberGraphFrame_BP_ResultMosaicSelection_C' has a wrong offset!");
static_assert(offsetof(ABP_ResultMosaicSelection_C, DetailsWidget) == 0x000348, "Member 'ABP_ResultMosaicSelection_C::DetailsWidget' has a wrong offset!");
static_assert(offsetof(ABP_ResultMosaicSelection_C, Widget) == 0x000350, "Member 'ABP_ResultMosaicSelection_C::Widget' has a wrong offset!");

}

