#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResultSaveBtn

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ResultSaveBtn.BP_ResultSaveBtn_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ResultSaveBtn_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultSaveBtn_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ResultSaveBtn_C_ReceiveTick");
static_assert(sizeof(BP_ResultSaveBtn_C_ReceiveTick) == 0x000004, "Wrong size on BP_ResultSaveBtn_C_ReceiveTick");
static_assert(offsetof(BP_ResultSaveBtn_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ResultSaveBtn_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ResultSaveBtn.BP_ResultSaveBtn_C.Interact
// 0x0008 (0x0008 - 0x0000)
struct BP_ResultSaveBtn_C_Interact final
{
public:
	class ABP_UPPlayerCharacter_C*                Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultSaveBtn_C_Interact) == 0x000008, "Wrong alignment on BP_ResultSaveBtn_C_Interact");
static_assert(sizeof(BP_ResultSaveBtn_C_Interact) == 0x000008, "Wrong size on BP_ResultSaveBtn_C_Interact");
static_assert(offsetof(BP_ResultSaveBtn_C_Interact, Player) == 0x000000, "Member 'BP_ResultSaveBtn_C_Interact::Player' has a wrong offset!");

// Function BP_ResultSaveBtn.BP_ResultSaveBtn_C.GetInteractText
// 0x0018 (0x0018 - 0x0000)
struct BP_ResultSaveBtn_C_GetInteractText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(Parm, OutParm)
};
static_assert(alignof(BP_ResultSaveBtn_C_GetInteractText) == 0x000008, "Wrong alignment on BP_ResultSaveBtn_C_GetInteractText");
static_assert(sizeof(BP_ResultSaveBtn_C_GetInteractText) == 0x000018, "Wrong size on BP_ResultSaveBtn_C_GetInteractText");
static_assert(offsetof(BP_ResultSaveBtn_C_GetInteractText, Text) == 0x000000, "Member 'BP_ResultSaveBtn_C_GetInteractText::Text' has a wrong offset!");

// Function BP_ResultSaveBtn.BP_ResultSaveBtn_C.ExecuteUbergraph_BP_ResultSaveBtn
// 0x0018 (0x0018 - 0x0000)
struct BP_ResultSaveBtn_C_ExecuteUbergraph_BP_ResultSaveBtn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                K2Node_Event_Player;                               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResultSaveBtn_C_ExecuteUbergraph_BP_ResultSaveBtn) == 0x000008, "Wrong alignment on BP_ResultSaveBtn_C_ExecuteUbergraph_BP_ResultSaveBtn");
static_assert(sizeof(BP_ResultSaveBtn_C_ExecuteUbergraph_BP_ResultSaveBtn) == 0x000018, "Wrong size on BP_ResultSaveBtn_C_ExecuteUbergraph_BP_ResultSaveBtn");
static_assert(offsetof(BP_ResultSaveBtn_C_ExecuteUbergraph_BP_ResultSaveBtn, EntryPoint) == 0x000000, "Member 'BP_ResultSaveBtn_C_ExecuteUbergraph_BP_ResultSaveBtn::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ResultSaveBtn_C_ExecuteUbergraph_BP_ResultSaveBtn, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_ResultSaveBtn_C_ExecuteUbergraph_BP_ResultSaveBtn::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultSaveBtn_C_ExecuteUbergraph_BP_ResultSaveBtn, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'BP_ResultSaveBtn_C_ExecuteUbergraph_BP_ResultSaveBtn::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultSaveBtn_C_ExecuteUbergraph_BP_ResultSaveBtn, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000006, "Member 'BP_ResultSaveBtn_C_ExecuteUbergraph_BP_ResultSaveBtn::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResultSaveBtn_C_ExecuteUbergraph_BP_ResultSaveBtn, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_ResultSaveBtn_C_ExecuteUbergraph_BP_ResultSaveBtn::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ResultSaveBtn_C_ExecuteUbergraph_BP_ResultSaveBtn, K2Node_Event_Player) == 0x000010, "Member 'BP_ResultSaveBtn_C_ExecuteUbergraph_BP_ResultSaveBtn::K2Node_Event_Player' has a wrong offset!");

}

