#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SurvivorExitZone

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SurvivorExitZone.BP_SurvivorExitZone_C
// 0x0020 (0x02B8 - 0x0298)
class ABP_SurvivorExitZone_C final : public AActor
{
public:
	class USphereComponent*                       Sphere;                                            // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SurvivorExitZone_C">();
	}
	static class ABP_SurvivorExitZone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SurvivorExitZone_C>();
	}
};
static_assert(alignof(ABP_SurvivorExitZone_C) == 0x000008, "Wrong alignment on ABP_SurvivorExitZone_C");
static_assert(sizeof(ABP_SurvivorExitZone_C) == 0x0002B8, "Wrong size on ABP_SurvivorExitZone_C");
static_assert(offsetof(ABP_SurvivorExitZone_C, Sphere) == 0x000298, "Member 'ABP_SurvivorExitZone_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_SurvivorExitZone_C, Billboard) == 0x0002A0, "Member 'ABP_SurvivorExitZone_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_SurvivorExitZone_C, DefaultSceneRoot) == 0x0002A8, "Member 'ABP_SurvivorExitZone_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_SurvivorExitZone_C, Radius) == 0x0002B0, "Member 'ABP_SurvivorExitZone_C::Radius' has a wrong offset!");

}

