#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Scoring

#include "Basic.hpp"

#include "E_ScoringActorState_structs.hpp"
#include "E_ScoringActorVariant_structs.hpp"
#include "S_ScoringCombo_structs.hpp"
#include "E_ScoringCategory_structs.hpp"
#include "S_ScoringComboItem_structs.hpp"
#include "S_CameroidActorScore_structs.hpp"
#include "S_ScoringCategory_structs.hpp"
#include "E_ScoringTag_structs.hpp"
#include "E_ScoringActorGroup_structs.hpp"
#include "S_ScoringActorGroup_structs.hpp"
#include "E_ScoringActor_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "S_CameroidCapture_structs.hpp"


namespace SDK::Params
{

// Function BP_Scoring.BP_Scoring_C.CanCreateCapture
// 0x0018 (0x0018 - 0x0000)
struct BP_Scoring_C_CanCreateCapture final
{
public:
	class ABP_Cameroid_C*                         Cameroid;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCapturesLeft_CapturesLeft;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Scoring_C_CanCreateCapture) == 0x000008, "Wrong alignment on BP_Scoring_C_CanCreateCapture");
static_assert(sizeof(BP_Scoring_C_CanCreateCapture) == 0x000018, "Wrong size on BP_Scoring_C_CanCreateCapture");
static_assert(offsetof(BP_Scoring_C_CanCreateCapture, Cameroid) == 0x000000, "Member 'BP_Scoring_C_CanCreateCapture::Cameroid' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_CanCreateCapture, Result) == 0x000008, "Member 'BP_Scoring_C_CanCreateCapture::Result' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_CanCreateCapture, CallFunc_GetCapturesLeft_CapturesLeft) == 0x00000C, "Member 'BP_Scoring_C_CanCreateCapture::CallFunc_GetCapturesLeft_CapturesLeft' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_CanCreateCapture, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'BP_Scoring_C_CanCreateCapture::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_CanCreateCapture, CallFunc_BooleanAND_ReturnValue) == 0x000011, "Member 'BP_Scoring_C_CanCreateCapture::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_Scoring.BP_Scoring_C.ComputeActorScore
// 0x0188 (0x0188 - 0x0000)
struct BP_Scoring_C_ComputeActorScore final
{
public:
	class ABP_Cameroid_C*                         Cameroid;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CaptureLocation;                                   // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CaptureRotation;                                   // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        HorizontalHalfFov;                                 // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VerticalHalfFov;                                   // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HorizontalFov;                                     // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x0058(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsScoring;                                         // 0x0059(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_ScoringComponent_C*                Scoring;                                           // 0x0060(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        RelativeScore;                                     // 0x0068(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DirectionScore;                                    // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AngleScore;                                        // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VisibilityScore;                                   // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         VisiblePointsCount;                                // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  PointsVisibility;                                  // 0x0090(0x0010)(Edit, BlueprintVisible)
	TArray<struct FVector>                        SamplePoints;                                      // 0x00A0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         TotalScore;                                        // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidScoringActor_IsValid;              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_ScoringComponent_C*                CallFunc_IsValidScoringActor_ScoringComponent;     // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ComputeDirectionScore_Score;              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ComputeVisibilityScore_VisibilityScore;   // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        CallFunc_ComputeVisibilityScore_SamplePoints;      // 0x0118(0x0010)(ReferenceParm)
	TArray<bool>                                  CallFunc_ComputeVisibilityScore_PointsVisibility;  // 0x0128(0x0010)(ReferenceParm)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ComputeAngleScore_AngleScore;             // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_2;              // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast_1;      // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast_2;      // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1;   // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Scoring_C_ComputeActorScore) == 0x000008, "Wrong alignment on BP_Scoring_C_ComputeActorScore");
static_assert(sizeof(BP_Scoring_C_ComputeActorScore) == 0x000188, "Wrong size on BP_Scoring_C_ComputeActorScore");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, Cameroid) == 0x000000, "Member 'BP_Scoring_C_ComputeActorScore::Cameroid' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, Actor) == 0x000008, "Member 'BP_Scoring_C_ComputeActorScore::Actor' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, CaptureLocation) == 0x000010, "Member 'BP_Scoring_C_ComputeActorScore::CaptureLocation' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, CaptureRotation) == 0x000028, "Member 'BP_Scoring_C_ComputeActorScore::CaptureRotation' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, HorizontalHalfFov) == 0x000040, "Member 'BP_Scoring_C_ComputeActorScore::HorizontalHalfFov' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, VerticalHalfFov) == 0x000048, "Member 'BP_Scoring_C_ComputeActorScore::VerticalHalfFov' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, HorizontalFov) == 0x000050, "Member 'BP_Scoring_C_ComputeActorScore::HorizontalFov' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, Debug) == 0x000058, "Member 'BP_Scoring_C_ComputeActorScore::Debug' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, IsScoring) == 0x000059, "Member 'BP_Scoring_C_ComputeActorScore::IsScoring' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, Scoring) == 0x000060, "Member 'BP_Scoring_C_ComputeActorScore::Scoring' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, RelativeScore) == 0x000068, "Member 'BP_Scoring_C_ComputeActorScore::RelativeScore' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, DirectionScore) == 0x000070, "Member 'BP_Scoring_C_ComputeActorScore::DirectionScore' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, AngleScore) == 0x000078, "Member 'BP_Scoring_C_ComputeActorScore::AngleScore' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, VisibilityScore) == 0x000080, "Member 'BP_Scoring_C_ComputeActorScore::VisibilityScore' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, VisiblePointsCount) == 0x000088, "Member 'BP_Scoring_C_ComputeActorScore::VisiblePointsCount' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, PointsVisibility) == 0x000090, "Member 'BP_Scoring_C_ComputeActorScore::PointsVisibility' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, SamplePoints) == 0x0000A0, "Member 'BP_Scoring_C_ComputeActorScore::SamplePoints' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, TotalScore) == 0x0000B0, "Member 'BP_Scoring_C_ComputeActorScore::TotalScore' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000B8, "Member 'BP_Scoring_C_ComputeActorScore::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, CallFunc_IsValidScoringActor_IsValid) == 0x0000D0, "Member 'BP_Scoring_C_ComputeActorScore::CallFunc_IsValidScoringActor_IsValid' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, CallFunc_IsValidScoringActor_ScoringComponent) == 0x0000D8, "Member 'BP_Scoring_C_ComputeActorScore::CallFunc_IsValidScoringActor_ScoringComponent' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000E0, "Member 'BP_Scoring_C_ComputeActorScore::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, CallFunc_Vector_Distance_ReturnValue) == 0x0000F8, "Member 'BP_Scoring_C_ComputeActorScore::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, CallFunc_GetFloatValue_ReturnValue) == 0x000100, "Member 'BP_Scoring_C_ComputeActorScore::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, CallFunc_ComputeDirectionScore_Score) == 0x000108, "Member 'BP_Scoring_C_ComputeActorScore::CallFunc_ComputeDirectionScore_Score' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, CallFunc_ComputeVisibilityScore_VisibilityScore) == 0x000110, "Member 'BP_Scoring_C_ComputeActorScore::CallFunc_ComputeVisibilityScore_VisibilityScore' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, CallFunc_ComputeVisibilityScore_SamplePoints) == 0x000118, "Member 'BP_Scoring_C_ComputeActorScore::CallFunc_ComputeVisibilityScore_SamplePoints' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, CallFunc_ComputeVisibilityScore_PointsVisibility) == 0x000128, "Member 'BP_Scoring_C_ComputeActorScore::CallFunc_ComputeVisibilityScore_PointsVisibility' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000138, "Member 'BP_Scoring_C_ComputeActorScore::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x000139, "Member 'BP_Scoring_C_ComputeActorScore::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, CallFunc_ComputeAngleScore_AngleScore) == 0x000140, "Member 'BP_Scoring_C_ComputeActorScore::CallFunc_ComputeAngleScore_AngleScore' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, CallFunc_GetFloatValue_ReturnValue_1) == 0x000148, "Member 'BP_Scoring_C_ComputeActorScore::CallFunc_GetFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, CallFunc_GetFloatValue_ReturnValue_2) == 0x00014C, "Member 'BP_Scoring_C_ComputeActorScore::CallFunc_GetFloatValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000150, "Member 'BP_Scoring_C_ComputeActorScore::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000158, "Member 'BP_Scoring_C_ComputeActorScore::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x000160, "Member 'BP_Scoring_C_ComputeActorScore::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000168, "Member 'BP_Scoring_C_ComputeActorScore::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, CallFunc_GetFloatValue_InTime_ImplicitCast_1) == 0x000170, "Member 'BP_Scoring_C_ComputeActorScore::CallFunc_GetFloatValue_InTime_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, CallFunc_GetFloatValue_InTime_ImplicitCast_2) == 0x000174, "Member 'BP_Scoring_C_ComputeActorScore::CallFunc_GetFloatValue_InTime_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000178, "Member 'BP_Scoring_C_ComputeActorScore::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScore, CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1) == 0x000180, "Member 'BP_Scoring_C_ComputeActorScore::CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");

// Function BP_Scoring.BP_Scoring_C.ComputeActorScores
// 0x0130 (0x0130 - 0x0000)
struct BP_Scoring_C_ComputeActorScores final
{
public:
	class ABP_Cameroid_C*                         Cameroid;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CaptureLocation;                                   // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CaptureRotation;                                   // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        HorizontalFov;                                     // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_CameroidActorScore>          ActorsScores;                                      // 0x0048(0x0010)(Parm, OutParm)
	TArray<struct FS_CameroidActorScore>          _ActorsScores;                                     // 0x0058(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	double                                        _VerticalHalfFov;                                  // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _HorizontalHalfFov;                                // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _HorizontalFov;                                    // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               _CaptureRotation;                                  // 0x0078(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                _CaptureLocation;                                  // 0x0090(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsOfClass_OutActors;            // 0x00C8(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ComputeActorScore_IsScoring;              // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_ScoringComponent_C*                CallFunc_ComputeActorScore_Scoring;                // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ComputeActorScore_RelativeScore;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_CameroidActorScore                  CallFunc_CreateActorScore_ActorScore;              // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet__HorizontalHalfFov_ImplicitCast; // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ComputeActorScore_HorizontalHalfFov_ImplicitCast; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Scoring_C_ComputeActorScores) == 0x000008, "Wrong alignment on BP_Scoring_C_ComputeActorScores");
static_assert(sizeof(BP_Scoring_C_ComputeActorScores) == 0x000130, "Wrong size on BP_Scoring_C_ComputeActorScores");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, Cameroid) == 0x000000, "Member 'BP_Scoring_C_ComputeActorScores::Cameroid' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, CaptureLocation) == 0x000008, "Member 'BP_Scoring_C_ComputeActorScores::CaptureLocation' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, CaptureRotation) == 0x000020, "Member 'BP_Scoring_C_ComputeActorScores::CaptureRotation' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, HorizontalFov) == 0x000038, "Member 'BP_Scoring_C_ComputeActorScores::HorizontalFov' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, Debug) == 0x000040, "Member 'BP_Scoring_C_ComputeActorScores::Debug' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, ActorsScores) == 0x000048, "Member 'BP_Scoring_C_ComputeActorScores::ActorsScores' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, _ActorsScores) == 0x000058, "Member 'BP_Scoring_C_ComputeActorScores::_ActorsScores' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, _VerticalHalfFov) == 0x000068, "Member 'BP_Scoring_C_ComputeActorScores::_VerticalHalfFov' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, _HorizontalHalfFov) == 0x000070, "Member 'BP_Scoring_C_ComputeActorScores::_HorizontalHalfFov' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, _HorizontalFov) == 0x000074, "Member 'BP_Scoring_C_ComputeActorScores::_HorizontalFov' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, _CaptureRotation) == 0x000078, "Member 'BP_Scoring_C_ComputeActorScores::_CaptureRotation' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, _CaptureLocation) == 0x000090, "Member 'BP_Scoring_C_ComputeActorScores::_CaptureLocation' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, Temp_int_Loop_Counter_Variable) == 0x0000A8, "Member 'BP_Scoring_C_ComputeActorScores::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'BP_Scoring_C_ComputeActorScores::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, CallFunc_Add_IntInt_ReturnValue) == 0x0000B8, "Member 'BP_Scoring_C_ComputeActorScores::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, Temp_int_Array_Index_Variable) == 0x0000BC, "Member 'BP_Scoring_C_ComputeActorScores::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0000C0, "Member 'BP_Scoring_C_ComputeActorScores::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000C8, "Member 'BP_Scoring_C_ComputeActorScores::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'BP_Scoring_C_ComputeActorScores::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, CallFunc_Array_Length_ReturnValue) == 0x0000E0, "Member 'BP_Scoring_C_ComputeActorScores::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, CallFunc_ComputeActorScore_IsScoring) == 0x0000E4, "Member 'BP_Scoring_C_ComputeActorScores::CallFunc_ComputeActorScore_IsScoring' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, CallFunc_ComputeActorScore_Scoring) == 0x0000E8, "Member 'BP_Scoring_C_ComputeActorScores::CallFunc_ComputeActorScore_Scoring' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, CallFunc_ComputeActorScore_RelativeScore) == 0x0000F0, "Member 'BP_Scoring_C_ComputeActorScores::CallFunc_ComputeActorScore_RelativeScore' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, CallFunc_Less_IntInt_ReturnValue) == 0x0000F8, "Member 'BP_Scoring_C_ComputeActorScores::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, CallFunc_CreateActorScore_ActorScore) == 0x000100, "Member 'BP_Scoring_C_ComputeActorScores::CallFunc_CreateActorScore_ActorScore' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, CallFunc_Array_Add_ReturnValue) == 0x000118, "Member 'BP_Scoring_C_ComputeActorScores::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, K2Node_VariableSet__HorizontalHalfFov_ImplicitCast) == 0x00011C, "Member 'BP_Scoring_C_ComputeActorScores::K2Node_VariableSet__HorizontalHalfFov_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000120, "Member 'BP_Scoring_C_ComputeActorScores::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeActorScores, CallFunc_ComputeActorScore_HorizontalHalfFov_ImplicitCast) == 0x000128, "Member 'BP_Scoring_C_ComputeActorScores::CallFunc_ComputeActorScore_HorizontalHalfFov_ImplicitCast' has a wrong offset!");

// Function BP_Scoring.BP_Scoring_C.ComputeAngleScore
// 0x0108 (0x0108 - 0x0000)
struct BP_Scoring_C_ComputeAngleScore final
{
public:
	TArray<struct FVector>                        Points;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<bool>                                  PointsVisibility;                                  // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                CaptureLocation;                                   // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HorizontalFov;                                     // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AngleScore;                                        // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxAngle;                                          // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegAcos_ReturnValue;                      // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Scoring_C_ComputeAngleScore) == 0x000008, "Wrong alignment on BP_Scoring_C_ComputeAngleScore");
static_assert(sizeof(BP_Scoring_C_ComputeAngleScore) == 0x000108, "Wrong size on BP_Scoring_C_ComputeAngleScore");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, Points) == 0x000000, "Member 'BP_Scoring_C_ComputeAngleScore::Points' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, PointsVisibility) == 0x000010, "Member 'BP_Scoring_C_ComputeAngleScore::PointsVisibility' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, CaptureLocation) == 0x000020, "Member 'BP_Scoring_C_ComputeAngleScore::CaptureLocation' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, HorizontalFov) == 0x000038, "Member 'BP_Scoring_C_ComputeAngleScore::HorizontalFov' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, AngleScore) == 0x000040, "Member 'BP_Scoring_C_ComputeAngleScore::AngleScore' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, MaxAngle) == 0x000048, "Member 'BP_Scoring_C_ComputeAngleScore::MaxAngle' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_Scoring_C_ComputeAngleScore::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, CallFunc_Array_Length_ReturnValue_1) == 0x000054, "Member 'BP_Scoring_C_ComputeAngleScore::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, Temp_int_Array_Index_Variable) == 0x000058, "Member 'BP_Scoring_C_ComputeAngleScore::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'BP_Scoring_C_ComputeAngleScore::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, CallFunc_Array_Get_Item) == 0x000060, "Member 'BP_Scoring_C_ComputeAngleScore::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, CallFunc_Less_IntInt_ReturnValue) == 0x000061, "Member 'BP_Scoring_C_ComputeAngleScore::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'BP_Scoring_C_ComputeAngleScore::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000068, "Member 'BP_Scoring_C_ComputeAngleScore::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, CallFunc_Normal_ReturnValue) == 0x000080, "Member 'BP_Scoring_C_ComputeAngleScore::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, Temp_int_Array_Index_Variable_1) == 0x000098, "Member 'BP_Scoring_C_ComputeAngleScore::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, Temp_int_Loop_Counter_Variable_1) == 0x00009C, "Member 'BP_Scoring_C_ComputeAngleScore::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'BP_Scoring_C_ComputeAngleScore::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A1, "Member 'BP_Scoring_C_ComputeAngleScore::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A4, "Member 'BP_Scoring_C_ComputeAngleScore::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000A8, "Member 'BP_Scoring_C_ComputeAngleScore::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, CallFunc_BooleanAND_ReturnValue) == 0x0000A9, "Member 'BP_Scoring_C_ComputeAngleScore::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0000B0, "Member 'BP_Scoring_C_ComputeAngleScore::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, CallFunc_Normal_ReturnValue_1) == 0x0000C8, "Member 'BP_Scoring_C_ComputeAngleScore::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, CallFunc_Dot_VectorVector_ReturnValue) == 0x0000E0, "Member 'BP_Scoring_C_ComputeAngleScore::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, CallFunc_DegAcos_ReturnValue) == 0x0000E8, "Member 'BP_Scoring_C_ComputeAngleScore::CallFunc_DegAcos_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000F0, "Member 'BP_Scoring_C_ComputeAngleScore::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, CallFunc_Abs_ReturnValue) == 0x0000F8, "Member 'BP_Scoring_C_ComputeAngleScore::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeAngleScore, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000100, "Member 'BP_Scoring_C_ComputeAngleScore::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_Scoring.BP_Scoring_C.ComputeCaptureScore
// 0x0098 (0x0098 - 0x0000)
struct BP_Scoring_C_ComputeCaptureScore final
{
public:
	TArray<struct FS_CameroidActorScore>          ActorsScores;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<E_ScoringTag>                          Tags_0;                                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FS_ScoringCategory                     Category;                                          // 0x0020(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	int32                                         Score;                                             // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _Score;                                            // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_CameroidActorScore                  CallFunc_Array_Get_Item;                           // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Scoring_C_ComputeCaptureScore) == 0x000008, "Wrong alignment on BP_Scoring_C_ComputeCaptureScore");
static_assert(sizeof(BP_Scoring_C_ComputeCaptureScore) == 0x000098, "Wrong size on BP_Scoring_C_ComputeCaptureScore");
static_assert(offsetof(BP_Scoring_C_ComputeCaptureScore, ActorsScores) == 0x000000, "Member 'BP_Scoring_C_ComputeCaptureScore::ActorsScores' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeCaptureScore, Tags_0) == 0x000010, "Member 'BP_Scoring_C_ComputeCaptureScore::Tags_0' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeCaptureScore, Category) == 0x000020, "Member 'BP_Scoring_C_ComputeCaptureScore::Category' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeCaptureScore, Score) == 0x000048, "Member 'BP_Scoring_C_ComputeCaptureScore::Score' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeCaptureScore, _Score) == 0x00004C, "Member 'BP_Scoring_C_ComputeCaptureScore::_Score' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeCaptureScore, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'BP_Scoring_C_ComputeCaptureScore::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeCaptureScore, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'BP_Scoring_C_ComputeCaptureScore::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeCaptureScore, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_Scoring_C_ComputeCaptureScore::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeCaptureScore, Temp_int_Array_Index_Variable) == 0x00005C, "Member 'BP_Scoring_C_ComputeCaptureScore::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeCaptureScore, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'BP_Scoring_C_ComputeCaptureScore::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeCaptureScore, CallFunc_Array_Get_Item) == 0x000068, "Member 'BP_Scoring_C_ComputeCaptureScore::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeCaptureScore, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000080, "Member 'BP_Scoring_C_ComputeCaptureScore::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeCaptureScore, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000088, "Member 'BP_Scoring_C_ComputeCaptureScore::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeCaptureScore, CallFunc_Add_IntInt_ReturnValue_1) == 0x000090, "Member 'BP_Scoring_C_ComputeCaptureScore::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeCaptureScore, CallFunc_Round_ReturnValue) == 0x000094, "Member 'BP_Scoring_C_ComputeCaptureScore::CallFunc_Round_ReturnValue' has a wrong offset!");

// Function BP_Scoring.BP_Scoring_C.ComputeDirectionScore
// 0x0078 (0x0078 - 0x0000)
struct BP_Scoring_C_ComputeDirectionScore final
{
public:
	class UBPC_ScoringComponent_C*                Scoring;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CaptureRotation;                                   // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        Score;                                             // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Scoring_C_ComputeDirectionScore) == 0x000008, "Wrong alignment on BP_Scoring_C_ComputeDirectionScore");
static_assert(sizeof(BP_Scoring_C_ComputeDirectionScore) == 0x000078, "Wrong size on BP_Scoring_C_ComputeDirectionScore");
static_assert(offsetof(BP_Scoring_C_ComputeDirectionScore, Scoring) == 0x000000, "Member 'BP_Scoring_C_ComputeDirectionScore::Scoring' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeDirectionScore, CaptureRotation) == 0x000008, "Member 'BP_Scoring_C_ComputeDirectionScore::CaptureRotation' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeDirectionScore, Score) == 0x000020, "Member 'BP_Scoring_C_ComputeDirectionScore::Score' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeDirectionScore, CallFunc_GetForwardVector_ReturnValue) == 0x000028, "Member 'BP_Scoring_C_ComputeDirectionScore::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeDirectionScore, CallFunc_GetForwardVector_ReturnValue_1) == 0x000040, "Member 'BP_Scoring_C_ComputeDirectionScore::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeDirectionScore, CallFunc_Dot_VectorVector_ReturnValue) == 0x000058, "Member 'BP_Scoring_C_ComputeDirectionScore::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeDirectionScore, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000060, "Member 'BP_Scoring_C_ComputeDirectionScore::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeDirectionScore, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000068, "Member 'BP_Scoring_C_ComputeDirectionScore::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeDirectionScore, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000070, "Member 'BP_Scoring_C_ComputeDirectionScore::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_Scoring.BP_Scoring_C.ComputeVisibilityScore
// 0x00F8 (0x00F8 - 0x0000)
struct BP_Scoring_C_ComputeVisibilityScore final
{
public:
	class ABP_Cameroid_C*                         Cameroid;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBPC_ScoringComponent_C*                Scoring;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ScoringActor;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CaptureLocation;                                   // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CaptureRotation;                                   // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        HorizontalHalfFov;                                 // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VerticalHalfFov;                                   // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x0058(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        VisibilityScore;                                   // 0x0060(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        SamplePoints;                                      // 0x0068(0x0010)(Parm, OutParm)
	TArray<bool>                                  PointsVisibility;                                  // 0x0078(0x0010)(Parm, OutParm)
	struct FVector                                CallFunc_GetBounds_Origin;                         // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBounds_BoxExtent;                      // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        CallFunc_GetSamplePoints_SamplePoints;             // 0x00B8(0x0010)(ReferenceParm)
	TArray<bool>                                  CallFunc_GetPointsVisibility_PointsVisbility;      // 0x00C8(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetPointsVisibility_VisiblePointsCount;   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Scoring_C_ComputeVisibilityScore) == 0x000008, "Wrong alignment on BP_Scoring_C_ComputeVisibilityScore");
static_assert(sizeof(BP_Scoring_C_ComputeVisibilityScore) == 0x0000F8, "Wrong size on BP_Scoring_C_ComputeVisibilityScore");
static_assert(offsetof(BP_Scoring_C_ComputeVisibilityScore, Cameroid) == 0x000000, "Member 'BP_Scoring_C_ComputeVisibilityScore::Cameroid' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeVisibilityScore, Scoring) == 0x000008, "Member 'BP_Scoring_C_ComputeVisibilityScore::Scoring' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeVisibilityScore, ScoringActor) == 0x000010, "Member 'BP_Scoring_C_ComputeVisibilityScore::ScoringActor' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeVisibilityScore, CaptureLocation) == 0x000018, "Member 'BP_Scoring_C_ComputeVisibilityScore::CaptureLocation' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeVisibilityScore, CaptureRotation) == 0x000030, "Member 'BP_Scoring_C_ComputeVisibilityScore::CaptureRotation' has a wrong offset!");
static_assert(offsetof(BP_Scoring_C_ComputeVisibilityScore, HorizontalHalfFov) == 0x000048, "Member 'BP_Scoring_C_ComputeVisibilityScore::HorizontalHalfFov' has a wrong offset!");
