#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Sewer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Sewer.BP_Sewer_C.BndEvt__BP_Mine_MineRadius_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_Sewer_C_BndEvt__BP_Mine_MineRadius_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Sewer_C_BndEvt__BP_Mine_MineRadius_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Sewer_C_BndEvt__BP_Mine_MineRadius_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Sewer_C_BndEvt__BP_Mine_MineRadius_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_Sewer_C_BndEvt__BP_Mine_MineRadius_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Sewer_C_BndEvt__BP_Mine_MineRadius_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Sewer_C_BndEvt__BP_Mine_MineRadius_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_BndEvt__BP_Mine_MineRadius_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Sewer_C_BndEvt__BP_Mine_MineRadius_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_BndEvt__BP_Mine_MineRadius_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Sewer_C_BndEvt__BP_Mine_MineRadius_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_BndEvt__BP_Mine_MineRadius_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Sewer_C_BndEvt__BP_Mine_MineRadius_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_BndEvt__BP_Mine_MineRadius_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_Sewer_C_BndEvt__BP_Mine_MineRadius_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_BndEvt__BP_Mine_MineRadius_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_Sewer_C_BndEvt__BP_Mine_MineRadius_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_Sewer.BP_Sewer_C.ExecuteUbergraph_BP_Sewer
// 0x0688 (0x0688 - 0x0000)
struct BP_Sewer_C_ExecuteUbergraph_BP_Sewer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0048(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TScriptInterface<class IBPI_Killable_C>       K2Node_DynamicCast_AsBPI_Killable;                 // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCloseToPlayers_CloseToPlayers;          // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_KillableCharacter_C*>        CallFunc_GetKillablesInDanger_Killables;           // 0x0298(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_KillableCharacter_C*                CallFunc_Array_Get_Item;                           // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Killable_C>       CallFunc_Harm_self_CastInput;                      // 0x02C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_KillableCharacter_C*>        K2Node_CustomEvent_Killables_1;                    // 0x02F0(0x0010)(ConstParm, ReferenceParm)
	class ABP_KillableCharacter_C*                CallFunc_Array_Get_Item_1;                         // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0308(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerCharacter_C*                K2Node_DynamicCast_AsBP_UPPlayer_Character;        // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0328(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetEyesLocation_EyesLocation;             // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0360(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x037C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37D[0x3];                                      // 0x037D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_KillableCharacter_C*>        K2Node_CustomEvent_Killables;                      // 0x0380(0x0010)(ConstParm, ReferenceParm)
	class ABP_KillableCharacter_C*                CallFunc_Array_Get_Item_2;                         // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39D[0x3];                                      // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x03A0(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x03B0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x04A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x04C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C2[0x2];                                      // 0x04C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CC[0x4];                                      // 0x04CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x04D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x04E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0500(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0518(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0530(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0538(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0540(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x055C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_564[0x4];                                      // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0568(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0580(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0598(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_681[0x3];                                      // 0x0681(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0684(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer) == 0x000008, "Wrong alignment on BP_Sewer_C_ExecuteUbergraph_BP_Sewer");
static_assert(sizeof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer) == 0x000688, "Wrong size on BP_Sewer_C_ExecuteUbergraph_BP_Sewer");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, EntryPoint) == 0x000000, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, Temp_int_Loop_Counter_Variable_1) == 0x00001C, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000028, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, K2Node_ComponentBoundEvent_OtherActor) == 0x000030, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, K2Node_ComponentBoundEvent_OtherComp) == 0x000038, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000040, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, K2Node_ComponentBoundEvent_bFromSweep) == 0x000044, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, K2Node_ComponentBoundEvent_SweepResult) == 0x000048, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, K2Node_DynamicCast_AsBPI_Killable) == 0x000130, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::K2Node_DynamicCast_AsBPI_Killable' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000148, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000160, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_SpawnEmitterAtLocation_ReturnValue_1) == 0x000168, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_SpawnEmitterAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_HasAuthority_ReturnValue) == 0x000170, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000178, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_IsCloseToPlayers_CloseToPlayers) == 0x000190, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_IsCloseToPlayers_CloseToPlayers' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000198, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0001A0, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x0001B8, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001C0, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0001D8, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, Temp_int_Array_Index_Variable_1) == 0x0001F0, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x0001F8, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000200, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_MakeVector_ReturnValue) == 0x000218, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_K2_GetComponentLocation_ReturnValue_3) == 0x000230, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_K2_GetComponentLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000248, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_Add_VectorVector_ReturnValue) == 0x000260, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000278, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, Temp_int_Loop_Counter_Variable_2) == 0x000290, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_GetKillablesInDanger_Killables) == 0x000298, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_GetKillablesInDanger_Killables' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_Array_Length_ReturnValue) == 0x0002A8, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_Less_IntInt_ReturnValue) == 0x0002AC, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_Add_IntInt_ReturnValue_2) == 0x0002B0, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, Temp_int_Array_Index_Variable_2) == 0x0002B4, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_HasAuthority_ReturnValue_1) == 0x0002B8, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_Array_Get_Item) == 0x0002C0, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_Harm_self_CastInput) == 0x0002C8, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_Harm_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x0002D8, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, K2Node_CustomEvent_Killables_1) == 0x0002F0, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::K2Node_CustomEvent_Killables_1' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_Array_Get_Item_1) == 0x000300, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, K2Node_CreateDelegate_OutputDelegate) == 0x000308, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, K2Node_DynamicCast_AsBP_UPPlayer_Character) == 0x000318, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::K2Node_DynamicCast_AsBP_UPPlayer_Character' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, K2Node_DynamicCast_bSuccess_1) == 0x000320, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000328, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_GetEyesLocation_EyesLocation) == 0x000330, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_GetEyesLocation_EyesLocation' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000348, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000360, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_Array_Length_ReturnValue_1) == 0x000378, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_Less_IntInt_ReturnValue_1) == 0x00037C, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, K2Node_CustomEvent_Killables) == 0x000380, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::K2Node_CustomEvent_Killables' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_Array_Get_Item_2) == 0x000390, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_Array_Length_ReturnValue_2) == 0x000398, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_Less_IntInt_ReturnValue_2) == 0x00039C, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, Temp_object_Variable) == 0x0003A0, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_LineTraceSingle_OutHit) == 0x0003B0, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_LineTraceSingle_ReturnValue) == 0x000498, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x0004A0, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_MakeVector_ReturnValue_1) == 0x0004A8, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_BreakHitResult_bBlockingHit) == 0x0004C0, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_BreakHitResult_bInitialOverlap) == 0x0004C1, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_BreakHitResult_Time) == 0x0004C4, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_BreakHitResult_Distance) == 0x0004C8, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_BreakHitResult_Location) == 0x0004D0, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_BreakHitResult_ImpactPoint) == 0x0004E8, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_BreakHitResult_Normal) == 0x000500, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_BreakHitResult_ImpactNormal) == 0x000518, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_BreakHitResult_PhysMat) == 0x000530, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_BreakHitResult_HitActor) == 0x000538, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_BreakHitResult_HitComponent) == 0x000540, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_BreakHitResult_HitBoneName) == 0x000548, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_BreakHitResult_BoneName) == 0x000550, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_BreakHitResult_HitItem) == 0x000558, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_BreakHitResult_ElementIndex) == 0x00055C, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_BreakHitResult_FaceIndex) == 0x000560, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_BreakHitResult_TraceStart) == 0x000568, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_BreakHitResult_TraceEnd) == 0x000580, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000598, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000680, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_ExecuteUbergraph_BP_Sewer, CallFunc_Delay_Duration_ImplicitCast) == 0x000684, "Member 'BP_Sewer_C_ExecuteUbergraph_BP_Sewer::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function BP_Sewer.BP_Sewer_C.FreezeTargets
// 0x0010 (0x0010 - 0x0000)
struct BP_Sewer_C_FreezeTargets final
{
public:
	TArray<class ABP_KillableCharacter_C*>        Killables;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_Sewer_C_FreezeTargets) == 0x000008, "Wrong alignment on BP_Sewer_C_FreezeTargets");
static_assert(sizeof(BP_Sewer_C_FreezeTargets) == 0x000010, "Wrong size on BP_Sewer_C_FreezeTargets");
static_assert(offsetof(BP_Sewer_C_FreezeTargets, Killables) == 0x000000, "Member 'BP_Sewer_C_FreezeTargets::Killables' has a wrong offset!");

// Function BP_Sewer.BP_Sewer_C.GetKillablesInDanger
// 0x0068 (0x0068 - 0x0000)
struct BP_Sewer_C_GetKillablesInDanger final
{
public:
	TArray<class ABP_KillableCharacter_C*>        Killables;                                         // 0x0000(0x0010)(Parm, OutParm)
	TArray<class ABP_KillableCharacter_C*>        _Killables;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_KillableCharacter_C*                K2Node_DynamicCast_AsBP_Killable_Character;        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Sewer_C_GetKillablesInDanger) == 0x000008, "Wrong alignment on BP_Sewer_C_GetKillablesInDanger");
static_assert(sizeof(BP_Sewer_C_GetKillablesInDanger) == 0x000068, "Wrong size on BP_Sewer_C_GetKillablesInDanger");
static_assert(offsetof(BP_Sewer_C_GetKillablesInDanger, Killables) == 0x000000, "Member 'BP_Sewer_C_GetKillablesInDanger::Killables' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_GetKillablesInDanger, _Killables) == 0x000010, "Member 'BP_Sewer_C_GetKillablesInDanger::_Killables' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_GetKillablesInDanger, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_Sewer_C_GetKillablesInDanger::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_GetKillablesInDanger, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BP_Sewer_C_GetKillablesInDanger::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_GetKillablesInDanger, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_Sewer_C_GetKillablesInDanger::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_GetKillablesInDanger, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000030, "Member 'BP_Sewer_C_GetKillablesInDanger::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_GetKillablesInDanger, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_Sewer_C_GetKillablesInDanger::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_GetKillablesInDanger, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_Sewer_C_GetKillablesInDanger::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_GetKillablesInDanger, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_Sewer_C_GetKillablesInDanger::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_GetKillablesInDanger, K2Node_DynamicCast_AsBP_Killable_Character) == 0x000058, "Member 'BP_Sewer_C_GetKillablesInDanger::K2Node_DynamicCast_AsBP_Killable_Character' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_GetKillablesInDanger, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_Sewer_C_GetKillablesInDanger::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Sewer_C_GetKillablesInDanger, CallFunc_Array_Add_ReturnValue) == 0x000064, "Member 'BP_Sewer_C_GetKillablesInDanger::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_Sewer.BP_Sewer_C.UnfreezeTargets
// 0x0010 (0x0010 - 0x0000)
struct BP_Sewer_C_UnfreezeTargets final
{
public:
	TArray<class ABP_KillableCharacter_C*>        Killables;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_Sewer_C_UnfreezeTargets) == 0x000008, "Wrong alignment on BP_Sewer_C_UnfreezeTargets");
static_assert(sizeof(BP_Sewer_C_UnfreezeTargets) == 0x000010, "Wrong size on BP_Sewer_C_UnfreezeTargets");
static_assert(offsetof(BP_Sewer_C_UnfreezeTargets, Killables) == 0x000000, "Member 'BP_Sewer_C_UnfreezeTargets::Killables' has a wrong offset!");

}

