#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SessionStart

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SessionStart.BP_SessionStart_C.AddPlayerInside
// 0x0010 (0x0010 - 0x0000)
struct BP_SessionStart_C_AddPlayerInside final
{
public:
	class ABP_UPPlayerCharacter_C*                Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFreePlayerIndex_PlayerIndex;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SessionStart_C_AddPlayerInside) == 0x000008, "Wrong alignment on BP_SessionStart_C_AddPlayerInside");
static_assert(sizeof(BP_SessionStart_C_AddPlayerInside) == 0x000010, "Wrong size on BP_SessionStart_C_AddPlayerInside");
static_assert(offsetof(BP_SessionStart_C_AddPlayerInside, Player) == 0x000000, "Member 'BP_SessionStart_C_AddPlayerInside::Player' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_AddPlayerInside, Index_0) == 0x000008, "Member 'BP_SessionStart_C_AddPlayerInside::Index_0' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_AddPlayerInside, CallFunc_GetFreePlayerIndex_PlayerIndex) == 0x00000C, "Member 'BP_SessionStart_C_AddPlayerInside::CallFunc_GetFreePlayerIndex_PlayerIndex' has a wrong offset!");

// Function BP_SessionStart.BP_SessionStart_C.AllPlayersInside
// 0x0028 (0x0028 - 0x0000)
struct BP_SessionStart_C_AllPlayersInside final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInside_Result;                          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SessionStart_C_AllPlayersInside) == 0x000008, "Wrong alignment on BP_SessionStart_C_AllPlayersInside");
static_assert(sizeof(BP_SessionStart_C_AllPlayersInside) == 0x000028, "Wrong size on BP_SessionStart_C_AllPlayersInside");
static_assert(offsetof(BP_SessionStart_C_AllPlayersInside, Result) == 0x000000, "Member 'BP_SessionStart_C_AllPlayersInside::Result' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_AllPlayersInside, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_SessionStart_C_AllPlayersInside::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_AllPlayersInside, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_SessionStart_C_AllPlayersInside::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_AllPlayersInside, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_SessionStart_C_AllPlayersInside::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_AllPlayersInside, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_SessionStart_C_AllPlayersInside::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_AllPlayersInside, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_SessionStart_C_AllPlayersInside::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_AllPlayersInside, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'BP_SessionStart_C_AllPlayersInside::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_AllPlayersInside, CallFunc_IsInside_Result) == 0x000021, "Member 'BP_SessionStart_C_AllPlayersInside::CallFunc_IsInside_Result' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_AllPlayersInside, CallFunc_Not_PreBool_ReturnValue) == 0x000022, "Member 'BP_SessionStart_C_AllPlayersInside::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_AllPlayersInside, CallFunc_Not_PreBool_ReturnValue_1) == 0x000023, "Member 'BP_SessionStart_C_AllPlayersInside::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_AllPlayersInside, CallFunc_BooleanAND_ReturnValue) == 0x000024, "Member 'BP_SessionStart_C_AllPlayersInside::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_SessionStart.BP_SessionStart_C.CanLeave
// 0x0020 (0x0020 - 0x0000)
struct BP_SessionStart_C_CanLeave final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_UPPlayerCharacter_C*>        CallFunc_GetPlayersWithoutCamera_Players;          // 0x0008(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AllPlayersInside_Result;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SessionStart_C_CanLeave) == 0x000008, "Wrong alignment on BP_SessionStart_C_CanLeave");
static_assert(sizeof(BP_SessionStart_C_CanLeave) == 0x000020, "Wrong size on BP_SessionStart_C_CanLeave");
static_assert(offsetof(BP_SessionStart_C_CanLeave, Value) == 0x000000, "Member 'BP_SessionStart_C_CanLeave::Value' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_CanLeave, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_SessionStart_C_CanLeave::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_CanLeave, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'BP_SessionStart_C_CanLeave::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_CanLeave, CallFunc_GetPlayersWithoutCamera_Players) == 0x000008, "Member 'BP_SessionStart_C_CanLeave::CallFunc_GetPlayersWithoutCamera_Players' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_CanLeave, CallFunc_Array_IsEmpty_ReturnValue) == 0x000018, "Member 'BP_SessionStart_C_CanLeave::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_CanLeave, CallFunc_AllPlayersInside_Result) == 0x000019, "Member 'BP_SessionStart_C_CanLeave::CallFunc_AllPlayersInside_Result' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_CanLeave, CallFunc_BooleanAND_ReturnValue) == 0x00001A, "Member 'BP_SessionStart_C_CanLeave::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_SessionStart.BP_SessionStart_C.CreatePlayerStart
// 0x0090 (0x0090 - 0x0000)
struct BP_SessionStart_C_CreatePlayerStart final
{
public:
	class USceneComponent*                        PlayerSpawnPoint;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerStart*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SessionStart_C_CreatePlayerStart) == 0x000010, "Wrong alignment on BP_SessionStart_C_CreatePlayerStart");
static_assert(sizeof(BP_SessionStart_C_CreatePlayerStart) == 0x000090, "Wrong size on BP_SessionStart_C_CreatePlayerStart");
static_assert(offsetof(BP_SessionStart_C_CreatePlayerStart, PlayerSpawnPoint) == 0x000000, "Member 'BP_SessionStart_C_CreatePlayerStart::PlayerSpawnPoint' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_CreatePlayerStart, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000010, "Member 'BP_SessionStart_C_CreatePlayerStart::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_CreatePlayerStart, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'BP_SessionStart_C_CreatePlayerStart::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_CreatePlayerStart, CallFunc_FinishSpawningActor_ReturnValue) == 0x000078, "Member 'BP_SessionStart_C_CreatePlayerStart::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_CreatePlayerStart, CallFunc_Array_Add_ReturnValue) == 0x000080, "Member 'BP_SessionStart_C_CreatePlayerStart::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_SessionStart.BP_SessionStart_C.EntersHelicopter
// 0x0008 (0x0008 - 0x0000)
struct BP_SessionStart_C_EntersHelicopter final
{
public:
	class ABP_UPPlayerCharacter_C*                Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SessionStart_C_EntersHelicopter) == 0x000008, "Wrong alignment on BP_SessionStart_C_EntersHelicopter");
static_assert(sizeof(BP_SessionStart_C_EntersHelicopter) == 0x000008, "Wrong size on BP_SessionStart_C_EntersHelicopter");
static_assert(offsetof(BP_SessionStart_C_EntersHelicopter, Player) == 0x000000, "Member 'BP_SessionStart_C_EntersHelicopter::Player' has a wrong offset!");

// Function BP_SessionStart.BP_SessionStart_C.ExecuteUbergraph_BP_SessionStart
// 0x09C0 (0x09C0 - 0x0000)
struct BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsSelected;                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                K2Node_Event_Player;                               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerCharacter_C*                K2Node_CustomEvent_Player_4;                       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddPlayerInside_Index;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInside_Result;                          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                K2Node_CustomEvent_Player_3;                       // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemovePlayerInside_Index;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0100(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item_1;                         // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0230(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult_1;    // 0x0298(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue_1;       // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x3];                                      // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPGameState_C*                      K2Node_DynamicCast_AsBP_UPGame_State;              // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance_1;         // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPGameMode_C*                       K2Node_DynamicCast_AsBP_UPGame_Mode;               // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                K2Node_CustomEvent_Player_2;                       // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerStart*                           K2Node_CustomEvent_PlayerStart;                    // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x03E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC[0x4];                                      // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x0400(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Landing;                        // 0x041C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsRunning;                      // 0x041D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41E[0x2];                                      // 0x041E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHelicopterEmpty_Result;                 // 0x0424(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0425(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_426[0x2];                                      // 0x0426(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                CallFunc_Array_Get_Item_2;                         // 0x0428(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerCharacter_C*                CallFunc_Array_Get_Item_3;                         // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_442[0x6];                                      // 0x0442(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSessionMap_MapName;                    // 0x0448(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_UPGameSession_C*                    CallFunc_GetActorOfClass_ReturnValue;              // 0x0458(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x3];                                      // 0x0461(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ABP_KillableCharacter_C* KilledCharacter, class AActor* Killer)> K2Node_CreateDelegate_OutputDelegate; // 0x0464(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ABP_UPPlayerCharacter_C* Player)> K2Node_CreateDelegate_OutputDelegate_1;   // 0x0474(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_484[0x4];                                      // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                K2Node_CustomEvent_Player_1;                       // 0x0488(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEnteringDialogue_IsValid;              // 0x0491(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_492[0x6];                                      // 0x0492(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEnteringDialogue_DialogueText;         // 0x0498(0x0018)()
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x04B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x04C8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B1[0x7];                                      // 0x05B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x05B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x05D0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void(class ABP_UPPlayerCharacter_C* Player, class APlayerStart* PlayerStart)> K2Node_CreateDelegate_OutputDelegate_2; // 0x06B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x06C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CC[0x4];                                      // 0x06CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                CallFunc_Array_Get_Item_4;                         // 0x06D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D9[0x3];                                      // 0x06D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x06DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E1[0x7];                                      // 0x06E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_4;    // 0x06E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0700(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x0701(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0702(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0703(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0704(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_705[0x3];                                      // 0x0705(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0708(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_LowPolyAvatar_C*                   K2Node_DynamicCast_AsABP_Low_Poly_Avatar;          // 0x0710(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0719(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71A[0x6];                                      // 0x071A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item_5;                         // 0x0720(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0728(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x072C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72D[0x3];                                      // 0x072D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0730(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_5;    // 0x0818(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_6;    // 0x0830(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0848(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x0860(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_CanLeave_Value;                           // 0x0948(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_949[0x7];                                      // 0x0949(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                K2Node_CustomEvent_Player;                         // 0x0950(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_KillableCharacter_C*                K2Node_CustomEvent_KilledCharacter;                // 0x0958(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Killer;                         // 0x0960(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0968(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInResults_InResults;                    // 0x0969(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96A[0x6];                                      // 0x096A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0970(0x0018)()
	TArray<class USceneComponent*>                K2Node_MakeArray_Array;                            // 0x0988(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class USceneComponent*>                K2Node_MakeArray_Array_1;                          // 0x0998(0x0010)(ReferenceParm, ContainsInstancedReference)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x09A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerCharacter_C*                K2Node_DynamicCast_AsBP_UPPlayer_Character;        // 0x09B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x09B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInside_Result_1;                        // 0x09B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x09BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x09BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart) == 0x000010, "Wrong alignment on BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart");
static_assert(sizeof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart) == 0x0009C0, "Wrong size on BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, EntryPoint) == 0x000000, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, K2Node_DynamicCast_AsBP_UPGame_Instance) == 0x000010, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::K2Node_DynamicCast_AsBP_UPGame_Instance' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_HasAuthority_ReturnValue) == 0x000028, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, K2Node_CustomEvent_IsSelected) == 0x000029, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::K2Node_CustomEvent_IsSelected' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, K2Node_Event_Player) == 0x000030, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, K2Node_CustomEvent_Player_4) == 0x000038, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::K2Node_CustomEvent_Player_4' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_AddPlayerInside_Index) == 0x000040, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_AddPlayerInside_Index' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_IsInside_Result) == 0x000044, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_IsInside_Result' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, K2Node_CustomEvent_Player_3) == 0x000048, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::K2Node_CustomEvent_Player_3' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_RemovePlayerInside_Index) == 0x000050, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_RemovePlayerInside_Index' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, Temp_int_Loop_Counter_Variable_1) == 0x000054, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_Add_IntInt_ReturnValue_1) == 0x000058, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_Array_Get_Item) == 0x000060, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000068, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000080, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_MakeTransform_ReturnValue) == 0x0000A0, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000100, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_K2_SetActorTransform_ReturnValue) == 0x0001E8, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_Array_Get_Item_1) == 0x0001F0, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_K2_GetComponentRotation_ReturnValue_1) == 0x0001F8, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_K2_GetComponentRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000210, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, Temp_int_Loop_Counter_Variable_2) == 0x000228, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_MakeTransform_ReturnValue_1) == 0x000230, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_Add_IntInt_ReturnValue_2) == 0x000290, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_K2_SetActorTransform_SweepHitResult_1) == 0x000298, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_K2_SetActorTransform_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_K2_SetActorTransform_ReturnValue_1) == 0x000380, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_K2_SetActorTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, Temp_int_Array_Index_Variable_1) == 0x000384, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_GetGameState_ReturnValue) == 0x000388, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, K2Node_DynamicCast_AsBP_UPGame_State) == 0x000390, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::K2Node_DynamicCast_AsBP_UPGame_State' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, K2Node_DynamicCast_bSuccess_1) == 0x000398, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_GetGameInstance_ReturnValue_1) == 0x0003A0, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, K2Node_DynamicCast_AsBP_UPGame_Instance_1) == 0x0003A8, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::K2Node_DynamicCast_AsBP_UPGame_Instance_1' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, K2Node_DynamicCast_bSuccess_2) == 0x0003B0, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_GetGameMode_ReturnValue) == 0x0003B8, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, K2Node_DynamicCast_AsBP_UPGame_Mode) == 0x0003C0, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::K2Node_DynamicCast_AsBP_UPGame_Mode' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, K2Node_DynamicCast_bSuccess_3) == 0x0003C8, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, K2Node_CustomEvent_Player_2) == 0x0003D0, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::K2Node_CustomEvent_Player_2' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, K2Node_CustomEvent_PlayerStart) == 0x0003D8, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::K2Node_CustomEvent_PlayerStart' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x0003E0, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, Temp_int_Loop_Counter_Variable_3) == 0x0003F8, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_K2_GetComponentLocation_ReturnValue_3) == 0x000400, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_K2_GetComponentLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_Add_IntInt_ReturnValue_3) == 0x000418, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, K2Node_CustomEvent_Landing) == 0x00041C, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::K2Node_CustomEvent_Landing' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, K2Node_CustomEvent_IsRunning) == 0x00041D, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::K2Node_CustomEvent_IsRunning' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, Temp_int_Array_Index_Variable_2) == 0x000420, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_IsHelicopterEmpty_Result) == 0x000424, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_IsHelicopterEmpty_Result' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000425, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_Array_Get_Item_2) == 0x000428, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_Array_Get_Item_3) == 0x000430, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_Array_Length_ReturnValue) == 0x000438, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_Array_Length_ReturnValue_1) == 0x00043C, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_Less_IntInt_ReturnValue) == 0x000440, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_Less_IntInt_ReturnValue_1) == 0x000441, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_GetSessionMap_MapName) == 0x000448, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_GetSessionMap_MapName' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_GetActorOfClass_ReturnValue) == 0x000458, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_IsValid_ReturnValue) == 0x000460, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, K2Node_CreateDelegate_OutputDelegate) == 0x000464, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, K2Node_CreateDelegate_OutputDelegate_1) == 0x000474, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, K2Node_CustomEvent_Player_1) == 0x000488, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::K2Node_CustomEvent_Player_1' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, K2Node_SwitchEnum_CmpSuccess) == 0x000490, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_GetEnteringDialogue_IsValid) == 0x000491, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_GetEnteringDialogue_IsValid' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_GetEnteringDialogue_DialogueText) == 0x000498, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_GetEnteringDialogue_DialogueText' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_VLerp_ReturnValue) == 0x0004B0, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0004C8, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0005B0, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_VLerp_ReturnValue_1) == 0x0005B8, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0005D0, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, K2Node_CreateDelegate_OutputDelegate_2) == 0x0006B8, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, Temp_int_Array_Index_Variable_3) == 0x0006C8, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_Array_Get_Item_4) == 0x0006D0, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_IsValid_ReturnValue_1) == 0x0006D8, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_Array_Length_ReturnValue_2) == 0x0006DC, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_Less_IntInt_ReturnValue_2) == 0x0006E0, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_K2_GetComponentLocation_ReturnValue_4) == 0x0006E8, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_K2_GetComponentLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_Not_PreBool_ReturnValue) == 0x000700, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, K2Node_CustomEvent_Enable) == 0x000701, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::K2Node_CustomEvent_Enable' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_BooleanAND_ReturnValue) == 0x000702, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000703, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, K2Node_Event_EndPlayReason) == 0x000704, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_GetAnimInstance_ReturnValue) == 0x000708, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, K2Node_DynamicCast_AsABP_Low_Poly_Avatar) == 0x000710, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::K2Node_DynamicCast_AsABP_Low_Poly_Avatar' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, K2Node_DynamicCast_bSuccess_4) == 0x000718, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_Array_Contains_ReturnValue) == 0x000719, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_Array_Get_Item_5) == 0x000720, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart, CallFunc_Array_Length_ReturnValue_3) == 0x000728, "Member 'BP_SessionStart_C_ExecuteUbergraph_BP_SessionStart::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
