#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Survivor_Exterior

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_PlayerAvatar_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "BP_KillableCharacter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Survivor_Exterior.BP_Survivor_Exterior_C
// 0x0190 (0x0AA0 - 0x0910)
class ABP_Survivor_Exterior_C : public ABP_KillableCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Survivor_Exterior_C;             // 0x0910(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_DeathFaceAnims_C*                  BPC_DeathFaceAnims;                                // 0x0918(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 HeadMesh;                                          // 0x0920(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_PlayerAvatar>                PossibleAvatars;                                   // 0x0928(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundBase*                             BreathingSound;                                    // 0x0938(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        BreathingAudio;                                    // 0x0940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         AvatarIndex;                                       // 0x0948(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLookingAround;                                   // 0x094C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94D[0x3];                                      // 0x094D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USoundCue*>                      ManScreamingSounds;                                // 0x0950(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FS_PlayerAvatar                        Avatar;                                            // 0x0960(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UCurveFloat*                            FootstepLoudnessForSpeed;                          // 0x0A00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<EPhysicalSurface, double>                FootstepNoiseRanges;                               // 0x0A08(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsTalking;                                         // 0x0A58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A59[0x7];                                      // 0x0A59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USoundCue*>                      WomanScreamingSounds;                              // 0x0A60(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundCue*                              ScreamingSound;                                    // 0x0A70(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        ScreamingDelayMin;                                 // 0x0A78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ScreamingDelayMax;                                 // 0x0A80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScreamingNoiseRange;                               // 0x0A88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A8C[0x4];                                      // 0x0A8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundCue*                              ManDeathSound;                                     // 0x0A90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              WomanDeathSound;                                   // 0x0A98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void SetOverlayMaterial(class UMaterialInterface* Material);
	bool AvatarIsMan();
	void ReceiveBeginPlay();
	void Death__All_(class ABP_KillableCharacter_C* KilledCharacter, class AActor* Killer);
	void Death__Server_(class ABP_KillableCharacter_C* KilledCharacter, class AActor* Killer);
	void Scream__Server_();
	void OnRep_AvatarIndex();
	void FootstepNoise(EPhysicalSurface Surface);
	void RegisterToFootsteps();
	void InitFootsteps();
	void Scream__All_();
	void EndScreaming();
	void StartScreaming();
	void FrozenDeath();
	void ExecuteUbergraph_BP_Survivor_Exterior(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Survivor_Exterior_C">();
	}
	static class ABP_Survivor_Exterior_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Survivor_Exterior_C>();
	}
};
static_assert(alignof(ABP_Survivor_Exterior_C) == 0x000010, "Wrong alignment on ABP_Survivor_Exterior_C");
static_assert(sizeof(ABP_Survivor_Exterior_C) == 0x000AA0, "Wrong size on ABP_Survivor_Exterior_C");
static_assert(offsetof(ABP_Survivor_Exterior_C, UberGraphFrame_BP_Survivor_Exterior_C) == 0x000910, "Member 'ABP_Survivor_Exterior_C::UberGraphFrame_BP_Survivor_Exterior_C' has a wrong offset!");
static_assert(offsetof(ABP_Survivor_Exterior_C, BPC_DeathFaceAnims) == 0x000918, "Member 'ABP_Survivor_Exterior_C::BPC_DeathFaceAnims' has a wrong offset!");
static_assert(offsetof(ABP_Survivor_Exterior_C, HeadMesh) == 0x000920, "Member 'ABP_Survivor_Exterior_C::HeadMesh' has a wrong offset!");
static_assert(offsetof(ABP_Survivor_Exterior_C, PossibleAvatars) == 0x000928, "Member 'ABP_Survivor_Exterior_C::PossibleAvatars' has a wrong offset!");
static_assert(offsetof(ABP_Survivor_Exterior_C, BreathingSound) == 0x000938, "Member 'ABP_Survivor_Exterior_C::BreathingSound' has a wrong offset!");
static_assert(offsetof(ABP_Survivor_Exterior_C, BreathingAudio) == 0x000940, "Member 'ABP_Survivor_Exterior_C::BreathingAudio' has a wrong offset!");
static_assert(offsetof(ABP_Survivor_Exterior_C, AvatarIndex) == 0x000948, "Member 'ABP_Survivor_Exterior_C::AvatarIndex' has a wrong offset!");
static_assert(offsetof(ABP_Survivor_Exterior_C, IsLookingAround) == 0x00094C, "Member 'ABP_Survivor_Exterior_C::IsLookingAround' has a wrong offset!");
static_assert(offsetof(ABP_Survivor_Exterior_C, ManScreamingSounds) == 0x000950, "Member 'ABP_Survivor_Exterior_C::ManScreamingSounds' has a wrong offset!");
static_assert(offsetof(ABP_Survivor_Exterior_C, Avatar) == 0x000960, "Member 'ABP_Survivor_Exterior_C::Avatar' has a wrong offset!");
static_assert(offsetof(ABP_Survivor_Exterior_C, FootstepLoudnessForSpeed) == 0x000A00, "Member 'ABP_Survivor_Exterior_C::FootstepLoudnessForSpeed' has a wrong offset!");
static_assert(offsetof(ABP_Survivor_Exterior_C, FootstepNoiseRanges) == 0x000A08, "Member 'ABP_Survivor_Exterior_C::FootstepNoiseRanges' has a wrong offset!");
static_assert(offsetof(ABP_Survivor_Exterior_C, IsTalking) == 0x000A58, "Member 'ABP_Survivor_Exterior_C::IsTalking' has a wrong offset!");
static_assert(offsetof(ABP_Survivor_Exterior_C, WomanScreamingSounds) == 0x000A60, "Member 'ABP_Survivor_Exterior_C::WomanScreamingSounds' has a wrong offset!");
static_assert(offsetof(ABP_Survivor_Exterior_C, ScreamingSound) == 0x000A70, "Member 'ABP_Survivor_Exterior_C::ScreamingSound' has a wrong offset!");
static_assert(offsetof(ABP_Survivor_Exterior_C, ScreamingDelayMin) == 0x000A78, "Member 'ABP_Survivor_Exterior_C::ScreamingDelayMin' has a wrong offset!");
static_assert(offsetof(ABP_Survivor_Exterior_C, ScreamingDelayMax) == 0x000A80, "Member 'ABP_Survivor_Exterior_C::ScreamingDelayMax' has a wrong offset!");
static_assert(offsetof(ABP_Survivor_Exterior_C, ScreamingNoiseRange) == 0x000A88, "Member 'ABP_Survivor_Exterior_C::ScreamingNoiseRange' has a wrong offset!");
static_assert(offsetof(ABP_Survivor_Exterior_C, ManDeathSound) == 0x000A90, "Member 'ABP_Survivor_Exterior_C::ManDeathSound' has a wrong offset!");
static_assert(offsetof(ABP_Survivor_Exterior_C, WomanDeathSound) == 0x000A98, "Member 'ABP_Survivor_Exterior_C::WomanDeathSound' has a wrong offset!");

}

