#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Stalker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Parent_Enemy_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Stalker.BP_Stalker_C
// 0x0020 (0x0AB0 - 0x0A90)
class ABP_Stalker_C final : public ABP_Parent_Enemy_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Stalker_C;                       // 0x0A88(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsAngry;                                           // 0x0A90(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A91[0x7];                                      // 0x0A91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundCue*                              AngrySound;                                        // 0x0A98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AngryAudio;                                        // 0x0AA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Stalker(int32 EntryPoint);
	void OnRep_IsAngry();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Stalker_C">();
	}
	static class ABP_Stalker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Stalker_C>();
	}
};
static_assert(alignof(ABP_Stalker_C) == 0x000010, "Wrong alignment on ABP_Stalker_C");
static_assert(sizeof(ABP_Stalker_C) == 0x000AB0, "Wrong size on ABP_Stalker_C");
static_assert(offsetof(ABP_Stalker_C, UberGraphFrame_BP_Stalker_C) == 0x000A88, "Member 'ABP_Stalker_C::UberGraphFrame_BP_Stalker_C' has a wrong offset!");
static_assert(offsetof(ABP_Stalker_C, IsAngry) == 0x000A90, "Member 'ABP_Stalker_C::IsAngry' has a wrong offset!");
static_assert(offsetof(ABP_Stalker_C, AngrySound) == 0x000A98, "Member 'ABP_Stalker_C::AngrySound' has a wrong offset!");
static_assert(offsetof(ABP_Stalker_C, AngryAudio) == 0x000AA0, "Member 'ABP_Stalker_C::AngryAudio' has a wrong offset!");

}

