#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Survivor_Exterior

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_PlayerAvatar_structs.hpp"


namespace SDK::Params
{

// Function BP_Survivor_Exterior.BP_Survivor_Exterior_C.SetOverlayMaterial
// 0x0008 (0x0008 - 0x0000)
struct BP_Survivor_Exterior_C_SetOverlayMaterial final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Survivor_Exterior_C_SetOverlayMaterial) == 0x000008, "Wrong alignment on BP_Survivor_Exterior_C_SetOverlayMaterial");
static_assert(sizeof(BP_Survivor_Exterior_C_SetOverlayMaterial) == 0x000008, "Wrong size on BP_Survivor_Exterior_C_SetOverlayMaterial");
static_assert(offsetof(BP_Survivor_Exterior_C_SetOverlayMaterial, Material) == 0x000000, "Member 'BP_Survivor_Exterior_C_SetOverlayMaterial::Material' has a wrong offset!");

// Function BP_Survivor_Exterior.BP_Survivor_Exterior_C.AvatarIsMan
// 0x0002 (0x0002 - 0x0000)
struct BP_Survivor_Exterior_C_AvatarIsMan final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Survivor_Exterior_C_AvatarIsMan) == 0x000001, "Wrong alignment on BP_Survivor_Exterior_C_AvatarIsMan");
static_assert(sizeof(BP_Survivor_Exterior_C_AvatarIsMan) == 0x000002, "Wrong size on BP_Survivor_Exterior_C_AvatarIsMan");
static_assert(offsetof(BP_Survivor_Exterior_C_AvatarIsMan, ReturnValue) == 0x000000, "Member 'BP_Survivor_Exterior_C_AvatarIsMan::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_AvatarIsMan, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000001, "Member 'BP_Survivor_Exterior_C_AvatarIsMan::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_Survivor_Exterior.BP_Survivor_Exterior_C.Death (All)
// 0x0010 (0x0010 - 0x0000)
struct BP_Survivor_Exterior_C_Death__All_ final
{
public:
	class ABP_KillableCharacter_C*                KilledCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Killer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Survivor_Exterior_C_Death__All_) == 0x000008, "Wrong alignment on BP_Survivor_Exterior_C_Death__All_");
static_assert(sizeof(BP_Survivor_Exterior_C_Death__All_) == 0x000010, "Wrong size on BP_Survivor_Exterior_C_Death__All_");
static_assert(offsetof(BP_Survivor_Exterior_C_Death__All_, KilledCharacter) == 0x000000, "Member 'BP_Survivor_Exterior_C_Death__All_::KilledCharacter' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_Death__All_, Killer) == 0x000008, "Member 'BP_Survivor_Exterior_C_Death__All_::Killer' has a wrong offset!");

// Function BP_Survivor_Exterior.BP_Survivor_Exterior_C.Death (Server)
// 0x0010 (0x0010 - 0x0000)
struct BP_Survivor_Exterior_C_Death__Server_ final
{
public:
	class ABP_KillableCharacter_C*                KilledCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Killer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Survivor_Exterior_C_Death__Server_) == 0x000008, "Wrong alignment on BP_Survivor_Exterior_C_Death__Server_");
static_assert(sizeof(BP_Survivor_Exterior_C_Death__Server_) == 0x000010, "Wrong size on BP_Survivor_Exterior_C_Death__Server_");
static_assert(offsetof(BP_Survivor_Exterior_C_Death__Server_, KilledCharacter) == 0x000000, "Member 'BP_Survivor_Exterior_C_Death__Server_::KilledCharacter' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_Death__Server_, Killer) == 0x000008, "Member 'BP_Survivor_Exterior_C_Death__Server_::Killer' has a wrong offset!");

// Function BP_Survivor_Exterior.BP_Survivor_Exterior_C.FootstepNoise
// 0x0001 (0x0001 - 0x0000)
struct BP_Survivor_Exterior_C_FootstepNoise final
{
public:
	EPhysicalSurface                              Surface;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Survivor_Exterior_C_FootstepNoise) == 0x000001, "Wrong alignment on BP_Survivor_Exterior_C_FootstepNoise");
static_assert(sizeof(BP_Survivor_Exterior_C_FootstepNoise) == 0x000001, "Wrong size on BP_Survivor_Exterior_C_FootstepNoise");
static_assert(offsetof(BP_Survivor_Exterior_C_FootstepNoise, Surface) == 0x000000, "Member 'BP_Survivor_Exterior_C_FootstepNoise::Surface' has a wrong offset!");

// Function BP_Survivor_Exterior.BP_Survivor_Exterior_C.ExecuteUbergraph_BP_Survivor_Exterior
// 0x02D8 (0x02D8 - 0x0000)
struct BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_KillableCharacter_C*                K2Node_CustomEvent_KilledCharacter_1;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Killer_1;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ABP_KillableCharacter_C* KilledCharacter, class AActor* Killer)> K2Node_CreateDelegate_OutputDelegate; // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_PlayerAvatar                        CallFunc_Array_Get_Item;                           // 0x0048(0x00A0)(HasGetValueTypeHash)
	class ABP_KillableCharacter_C*                K2Node_CustomEvent_KilledCharacter;                // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Killer;                         // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_DynamicCast_AsAIController;                 // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PlayerAvatar                        CallFunc_Array_Random_OutItem;                     // 0x0110(0x00A0)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              K2Node_CustomEvent_Surface;                        // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Map_Find_Value;                           // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ABP_KillableCharacter_C* KilledCharacter, class AActor* Killer)> K2Node_CreateDelegate_OutputDelegate_1; // 0x020C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_LowPolyAvatar_C*                   K2Node_DynamicCast_AsABP_Low_Poly_Avatar;          // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24A[0x6];                                      // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25A[0x6];                                      // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0268(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0278(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28A[0x2];                                      // 0x028A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPhysicalSurface Surface)>     K2Node_CreateDelegate_OutputDelegate_4;            // 0x028C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AvatarIsMan_ReturnValue;                  // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AvatarIsMan_ReturnValue_1;                // 0x029D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29E[0x2];                                      // 0x029E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USoundCue*>                      K2Node_Select_Default;                             // 0x02A0(0x0010)(ReferenceParm)
	class USoundCue*                              CallFunc_Array_Random_OutItem_1;                   // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex_1;                  // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundCue*                              K2Node_Select_Default_1;                           // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ReportNoiseEvent_MaxRange_ImplicitCast;   // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior) == 0x000008, "Wrong alignment on BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior");
static_assert(sizeof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior) == 0x0002D8, "Wrong size on BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, EntryPoint) == 0x000000, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, K2Node_CustomEvent_KilledCharacter_1) == 0x000008, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::K2Node_CustomEvent_KilledCharacter_1' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, K2Node_CustomEvent_Killer_1) == 0x000010, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::K2Node_CustomEvent_Killer_1' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000018, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000030, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, K2Node_CustomEvent_KilledCharacter) == 0x0000E8, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::K2Node_CustomEvent_KilledCharacter' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, K2Node_CustomEvent_Killer) == 0x0000F0, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::K2Node_CustomEvent_Killer' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, CallFunc_GetController_ReturnValue) == 0x0000F8, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, K2Node_DynamicCast_AsAIController) == 0x000100, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::K2Node_DynamicCast_AsAIController' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, CallFunc_Array_Random_OutItem) == 0x000110, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, CallFunc_Array_Random_OutIndex) == 0x0001B0, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001B8, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, K2Node_CustomEvent_Surface) == 0x0001D0, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::K2Node_CustomEvent_Surface' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, CallFunc_GetVelocity_ReturnValue) == 0x0001D8, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, CallFunc_Map_Find_Value) == 0x0001F0, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, CallFunc_Map_Find_ReturnValue) == 0x0001F8, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, CallFunc_VSize_ReturnValue) == 0x000200, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, CallFunc_GetFloatValue_ReturnValue) == 0x000208, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, K2Node_CreateDelegate_OutputDelegate_1) == 0x00020C, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, Temp_bool_Variable) == 0x00021C, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000220, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, CallFunc_GetAnimInstance_ReturnValue) == 0x000238, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, K2Node_DynamicCast_AsABP_Low_Poly_Avatar) == 0x000240, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::K2Node_DynamicCast_AsABP_Low_Poly_Avatar' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, K2Node_DynamicCast_bSuccess_1) == 0x000248, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, CallFunc_IsValid_ReturnValue) == 0x000249, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, CallFunc_RandomFloatInRange_ReturnValue) == 0x000250, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, Temp_bool_Variable_1) == 0x000258, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, CallFunc_IsValid_ReturnValue_1) == 0x000259, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x000260, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, K2Node_CreateDelegate_OutputDelegate_2) == 0x000268, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, K2Node_CreateDelegate_OutputDelegate_3) == 0x000278, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, CallFunc_HasAuthority_ReturnValue) == 0x000288, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, CallFunc_IsValid_ReturnValue_2) == 0x000289, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, K2Node_CreateDelegate_OutputDelegate_4) == 0x00028C, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, CallFunc_AvatarIsMan_ReturnValue) == 0x00029C, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::CallFunc_AvatarIsMan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, CallFunc_AvatarIsMan_ReturnValue_1) == 0x00029D, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::CallFunc_AvatarIsMan_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, K2Node_Select_Default) == 0x0002A0, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, CallFunc_Array_Random_OutItem_1) == 0x0002B0, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::CallFunc_Array_Random_OutItem_1' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, CallFunc_Array_Random_OutIndex_1) == 0x0002B8, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::CallFunc_Array_Random_OutIndex_1' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, K2Node_Select_Default_1) == 0x0002C0, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, CallFunc_ReportNoiseEvent_MaxRange_ImplicitCast) == 0x0002C8, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::CallFunc_ReportNoiseEvent_MaxRange_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x0002CC, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior, CallFunc_Delay_Duration_ImplicitCast) == 0x0002D0, "Member 'BP_Survivor_Exterior_C_ExecuteUbergraph_BP_Survivor_Exterior::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

}

