#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Slender

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Slender.BP_Slender_C.BndEvt__BP_Slender_LeftFootCollision_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_Slender_C_BndEvt__BP_Slender_LeftFootCollision_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0030(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Slender_C_BndEvt__BP_Slender_LeftFootCollision_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Slender_C_BndEvt__BP_Slender_LeftFootCollision_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(BP_Slender_C_BndEvt__BP_Slender_LeftFootCollision_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature) == 0x000118, "Wrong size on BP_Slender_C_BndEvt__BP_Slender_LeftFootCollision_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(BP_Slender_C_BndEvt__BP_Slender_LeftFootCollision_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'BP_Slender_C_BndEvt__BP_Slender_LeftFootCollision_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_BndEvt__BP_Slender_LeftFootCollision_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Slender_C_BndEvt__BP_Slender_LeftFootCollision_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_BndEvt__BP_Slender_LeftFootCollision_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Slender_C_BndEvt__BP_Slender_LeftFootCollision_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_BndEvt__BP_Slender_LeftFootCollision_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'BP_Slender_C_BndEvt__BP_Slender_LeftFootCollision_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_BndEvt__BP_Slender_LeftFootCollision_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature, Hit) == 0x000030, "Member 'BP_Slender_C_BndEvt__BP_Slender_LeftFootCollision_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function BP_Slender.BP_Slender_C.BndEvt__BP_Slender_RightFootCollision_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_Slender_C_BndEvt__BP_Slender_RightFootCollision_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0030(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Slender_C_BndEvt__BP_Slender_RightFootCollision_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Slender_C_BndEvt__BP_Slender_RightFootCollision_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(BP_Slender_C_BndEvt__BP_Slender_RightFootCollision_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature) == 0x000118, "Wrong size on BP_Slender_C_BndEvt__BP_Slender_RightFootCollision_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(BP_Slender_C_BndEvt__BP_Slender_RightFootCollision_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'BP_Slender_C_BndEvt__BP_Slender_RightFootCollision_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_BndEvt__BP_Slender_RightFootCollision_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Slender_C_BndEvt__BP_Slender_RightFootCollision_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_BndEvt__BP_Slender_RightFootCollision_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Slender_C_BndEvt__BP_Slender_RightFootCollision_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_BndEvt__BP_Slender_RightFootCollision_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'BP_Slender_C_BndEvt__BP_Slender_RightFootCollision_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_BndEvt__BP_Slender_RightFootCollision_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature, Hit) == 0x000030, "Member 'BP_Slender_C_BndEvt__BP_Slender_RightFootCollision_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function BP_Slender.BP_Slender_C.ExecuteUbergraph_BP_Slender
// 0x06C0 (0x06C0 - 0x0000)
struct BP_Slender_C_ExecuteUbergraph_BP_Slender final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_KillableCharacter_C*                K2Node_CustomEvent_KilledCharacter;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Killer;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ABP_KillableCharacter_C* KilledCharacter, class AActor* Killer)> K2Node_CreateDelegate_OutputDelegate; // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_HitActor;                       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_KillableCharacter_C*                K2Node_DynamicCast_AsBP_Killable_Character;        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAffinity_Affinity;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent_1;         // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse_1;        // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit_1;                  // 0x00C8(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B3[0x1];                                      // 0x01B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x02C0(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AA[0x2];                                      // 0x03AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x03B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x03E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0400(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0428(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0450(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0468(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0480(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0490(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x0579(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x057A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57B[0x1];                                      // 0x057B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x057C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x0580(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_584[0x4];                                      // 0x0584(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x0588(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x05A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x05B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x05D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x05E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x05F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x05F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_2;                // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x0610(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_2;            // 0x0614(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x0618(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61C[0x4];                                      // 0x061C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x0620(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x0638(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0650(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x06B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_SlenderExplosion_C*                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x06B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Slender_C_ExecuteUbergraph_BP_Slender) == 0x000010, "Wrong alignment on BP_Slender_C_ExecuteUbergraph_BP_Slender");
static_assert(sizeof(BP_Slender_C_ExecuteUbergraph_BP_Slender) == 0x0006C0, "Wrong size on BP_Slender_C_ExecuteUbergraph_BP_Slender");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, EntryPoint) == 0x000000, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, K2Node_CustomEvent_KilledCharacter) == 0x000008, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::K2Node_CustomEvent_KilledCharacter' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, K2Node_CustomEvent_Killer) == 0x000010, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::K2Node_CustomEvent_Killer' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_HasAuthority_ReturnValue) == 0x000018, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, K2Node_CustomEvent_HitActor) == 0x000030, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::K2Node_CustomEvent_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, K2Node_CustomEvent_HitLocation) == 0x000038, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, K2Node_DynamicCast_AsBP_Killable_Character) == 0x000050, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::K2Node_DynamicCast_AsBP_Killable_Character' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_GetSocketLocation_ReturnValue) == 0x000060, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_GetAffinity_Affinity) == 0x000078, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_GetAffinity_Affinity' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000080, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, K2Node_ComponentBoundEvent_HitComponent_1) == 0x000098, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::K2Node_ComponentBoundEvent_HitComponent_1' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, K2Node_ComponentBoundEvent_OtherActor_1) == 0x0000A0, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, K2Node_ComponentBoundEvent_OtherComp_1) == 0x0000A8, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, K2Node_ComponentBoundEvent_NormalImpulse_1) == 0x0000B0, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::K2Node_ComponentBoundEvent_NormalImpulse_1' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, K2Node_ComponentBoundEvent_Hit_1) == 0x0000C8, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::K2Node_ComponentBoundEvent_Hit_1' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_Not_PreBool_ReturnValue) == 0x0001B0, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_bBlockingHit) == 0x0001B1, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001B2, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_Time) == 0x0001B4, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_Distance) == 0x0001B8, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_Location) == 0x0001C0, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_ImpactPoint) == 0x0001D8, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_Normal) == 0x0001F0, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_ImpactNormal) == 0x000208, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_PhysMat) == 0x000220, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_HitActor) == 0x000228, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_HitComponent) == 0x000230, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_HitBoneName) == 0x000238, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_BoneName) == 0x000240, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_HitItem) == 0x000248, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_ElementIndex) == 0x00024C, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_FaceIndex) == 0x000250, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_TraceStart) == 0x000258, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_TraceEnd) == 0x000270, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BooleanAND_ReturnValue) == 0x000288, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, K2Node_ComponentBoundEvent_HitComponent) == 0x000290, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, K2Node_ComponentBoundEvent_OtherActor) == 0x000298, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, K2Node_ComponentBoundEvent_OtherComp) == 0x0002A0, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, K2Node_ComponentBoundEvent_NormalImpulse) == 0x0002A8, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, K2Node_ComponentBoundEvent_Hit) == 0x0002C0, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_bBlockingHit_1) == 0x0003A8, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x0003A9, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_Time_1) == 0x0003AC, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_Distance_1) == 0x0003B0, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_Location_1) == 0x0003B8, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_ImpactPoint_1) == 0x0003D0, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_Normal_1) == 0x0003E8, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000400, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_PhysMat_1) == 0x000418, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_HitActor_1) == 0x000420, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_HitComponent_1) == 0x000428, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_HitBoneName_1) == 0x000430, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_BoneName_1) == 0x000438, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_BoneName_1' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_HitItem_1) == 0x000440, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_ElementIndex_1) == 0x000444, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_FaceIndex_1) == 0x000448, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_TraceStart_1) == 0x000450, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_TraceEnd_1) == 0x000468, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, Temp_object_Variable) == 0x000480, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_LineTraceSingle_OutHit) == 0x000490, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_LineTraceSingle_ReturnValue) == 0x000578, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_bBlockingHit_2) == 0x000579, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_bBlockingHit_2' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_bInitialOverlap_2) == 0x00057A, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_bInitialOverlap_2' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_Time_2) == 0x00057C, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_Time_2' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_Distance_2) == 0x000580, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_Distance_2' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_Location_2) == 0x000588, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_Location_2' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_ImpactPoint_2) == 0x0005A0, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_ImpactPoint_2' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_Normal_2) == 0x0005B8, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_Normal_2' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_ImpactNormal_2) == 0x0005D0, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_ImpactNormal_2' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_PhysMat_2) == 0x0005E8, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_PhysMat_2' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_HitActor_2) == 0x0005F0, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_HitActor_2' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_HitComponent_2) == 0x0005F8, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_HitComponent_2' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_HitBoneName_2) == 0x000600, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_HitBoneName_2' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_BoneName_2) == 0x000608, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_BoneName_2' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_HitItem_2) == 0x000610, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_HitItem_2' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_ElementIndex_2) == 0x000614, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_ElementIndex_2' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_FaceIndex_2) == 0x000618, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_FaceIndex_2' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_TraceStart_2) == 0x000620, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_TraceStart_2' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BreakHitResult_TraceEnd_2) == 0x000638, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BreakHitResult_TraceEnd_2' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000650, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0006B0, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_ExecuteUbergraph_BP_Slender, CallFunc_FinishSpawningActor_ReturnValue) == 0x0006B8, "Member 'BP_Slender_C_ExecuteUbergraph_BP_Slender::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_Slender.BP_Slender_C.FootHit
// 0x0020 (0x0020 - 0x0000)
struct BP_Slender_C_FootHit final
{
public:
	class AActor*                                 HitActor;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Slender_C_FootHit) == 0x000008, "Wrong alignment on BP_Slender_C_FootHit");
static_assert(sizeof(BP_Slender_C_FootHit) == 0x000020, "Wrong size on BP_Slender_C_FootHit");
static_assert(offsetof(BP_Slender_C_FootHit, HitActor) == 0x000000, "Member 'BP_Slender_C_FootHit::HitActor' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_FootHit, HitLocation) == 0x000008, "Member 'BP_Slender_C_FootHit::HitLocation' has a wrong offset!");

// Function BP_Slender.BP_Slender_C.SlenderKilled (All)
// 0x0010 (0x0010 - 0x0000)
struct BP_Slender_C_SlenderKilled__All_ final
{
public:
	class ABP_KillableCharacter_C*                KilledCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Killer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Slender_C_SlenderKilled__All_) == 0x000008, "Wrong alignment on BP_Slender_C_SlenderKilled__All_");
static_assert(sizeof(BP_Slender_C_SlenderKilled__All_) == 0x000010, "Wrong size on BP_Slender_C_SlenderKilled__All_");
static_assert(offsetof(BP_Slender_C_SlenderKilled__All_, KilledCharacter) == 0x000000, "Member 'BP_Slender_C_SlenderKilled__All_::KilledCharacter' has a wrong offset!");
static_assert(offsetof(BP_Slender_C_SlenderKilled__All_, Killer) == 0x000008, "Member 'BP_Slender_C_SlenderKilled__All_::Killer' has a wrong offset!");

}

