#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Spawner

#include "Basic.hpp"

#include "E_Spawnable_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Spawner.BP_Spawner_C.DestroyPlaceholder
// 0x0001 (0x0001 - 0x0000)
struct BP_Spawner_C_DestroyPlaceholder final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spawner_C_DestroyPlaceholder) == 0x000001, "Wrong alignment on BP_Spawner_C_DestroyPlaceholder");
static_assert(sizeof(BP_Spawner_C_DestroyPlaceholder) == 0x000001, "Wrong size on BP_Spawner_C_DestroyPlaceholder");
static_assert(offsetof(BP_Spawner_C_DestroyPlaceholder, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_Spawner_C_DestroyPlaceholder::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Spawner.BP_Spawner_C.ExecuteUbergraph_BP_Spawner
// 0x0004 (0x0004 - 0x0000)
struct BP_Spawner_C_ExecuteUbergraph_BP_Spawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spawner_C_ExecuteUbergraph_BP_Spawner) == 0x000004, "Wrong alignment on BP_Spawner_C_ExecuteUbergraph_BP_Spawner");
static_assert(sizeof(BP_Spawner_C_ExecuteUbergraph_BP_Spawner) == 0x000004, "Wrong size on BP_Spawner_C_ExecuteUbergraph_BP_Spawner");
static_assert(offsetof(BP_Spawner_C_ExecuteUbergraph_BP_Spawner, EntryPoint) == 0x000000, "Member 'BP_Spawner_C_ExecuteUbergraph_BP_Spawner::EntryPoint' has a wrong offset!");

// Function BP_Spawner.BP_Spawner_C.GetSpawnTransform
// 0x00D0 (0x00D0 - 0x0000)
struct BP_Spawner_C_GetSpawnTransform final
{
public:
	E_Spawnable                                   Spawnable;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             SpawnTransform;                                    // 0x0010(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0070(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spawner_C_GetSpawnTransform) == 0x000010, "Wrong alignment on BP_Spawner_C_GetSpawnTransform");
static_assert(sizeof(BP_Spawner_C_GetSpawnTransform) == 0x0000D0, "Wrong size on BP_Spawner_C_GetSpawnTransform");
static_assert(offsetof(BP_Spawner_C_GetSpawnTransform, Spawnable) == 0x000000, "Member 'BP_Spawner_C_GetSpawnTransform::Spawnable' has a wrong offset!");
static_assert(offsetof(BP_Spawner_C_GetSpawnTransform, SpawnTransform) == 0x000010, "Member 'BP_Spawner_C_GetSpawnTransform::SpawnTransform' has a wrong offset!");
static_assert(offsetof(BP_Spawner_C_GetSpawnTransform, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000070, "Member 'BP_Spawner_C_GetSpawnTransform::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");

// Function BP_Spawner.BP_Spawner_C.UpdatePlaceholder
// 0x0028 (0x0028 - 0x0000)
struct BP_Spawner_C_UpdatePlaceholder final
{
public:
	class UObject*                                CallFunc_GetDefaultObjectOfClass_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPGameSession_C*                    K2Node_DynamicCast_AsBP_UPGame_Session;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Spawnable                                   CallFunc_Array_Get_Item;                           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Map_Find_Value;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spawner_C_UpdatePlaceholder) == 0x000008, "Wrong alignment on BP_Spawner_C_UpdatePlaceholder");
static_assert(sizeof(BP_Spawner_C_UpdatePlaceholder) == 0x000028, "Wrong size on BP_Spawner_C_UpdatePlaceholder");
static_assert(offsetof(BP_Spawner_C_UpdatePlaceholder, CallFunc_GetDefaultObjectOfClass_ReturnValue) == 0x000000, "Member 'BP_Spawner_C_UpdatePlaceholder::CallFunc_GetDefaultObjectOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spawner_C_UpdatePlaceholder, K2Node_DynamicCast_AsBP_UPGame_Session) == 0x000008, "Member 'BP_Spawner_C_UpdatePlaceholder::K2Node_DynamicCast_AsBP_UPGame_Session' has a wrong offset!");
static_assert(offsetof(BP_Spawner_C_UpdatePlaceholder, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_Spawner_C_UpdatePlaceholder::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Spawner_C_UpdatePlaceholder, CallFunc_Array_Get_Item) == 0x000011, "Member 'BP_Spawner_C_UpdatePlaceholder::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Spawner_C_UpdatePlaceholder, CallFunc_Map_Find_Value) == 0x000018, "Member 'BP_Spawner_C_UpdatePlaceholder::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_Spawner_C_UpdatePlaceholder, CallFunc_Map_Find_ReturnValue) == 0x000020, "Member 'BP_Spawner_C_UpdatePlaceholder::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function BP_Spawner.BP_Spawner_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct BP_Spawner_C_UserConstructionScript final
{
public:
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spawner_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Spawner_C_UserConstructionScript");
static_assert(sizeof(BP_Spawner_C_UserConstructionScript) == 0x000010, "Wrong size on BP_Spawner_C_UserConstructionScript");
static_assert(offsetof(BP_Spawner_C_UserConstructionScript, CallFunc_GetGameInstance_ReturnValue) == 0x000000, "Member 'BP_Spawner_C_UserConstructionScript::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spawner_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_Spawner_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

