#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Slender

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Parent_Enemy_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Slender.BP_Slender_C
// 0x0010 (0x0AA0 - 0x0A90)
class ABP_Slender_C final : public ABP_Parent_Enemy_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Slender_C;                       // 0x0A88(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       RightFootCollision;                                // 0x0A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       LeftFootCollision;                                 // 0x0A98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Slender_LeftFootCollision_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void BndEvt__BP_Slender_RightFootCollision_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ExecuteUbergraph_BP_Slender(int32 EntryPoint);
	void FootHit(class AActor* HitActor, const struct FVector& HitLocation);
	void ReceiveBeginPlay();
	void SlenderKilled__All_(class ABP_KillableCharacter_C* KilledCharacter, class AActor* Killer);
	void Stomp();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Slender_C">();
	}
	static class ABP_Slender_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Slender_C>();
	}
};
static_assert(alignof(ABP_Slender_C) == 0x000010, "Wrong alignment on ABP_Slender_C");
static_assert(sizeof(ABP_Slender_C) == 0x000AA0, "Wrong size on ABP_Slender_C");
static_assert(offsetof(ABP_Slender_C, UberGraphFrame_BP_Slender_C) == 0x000A88, "Member 'ABP_Slender_C::UberGraphFrame_BP_Slender_C' has a wrong offset!");
static_assert(offsetof(ABP_Slender_C, RightFootCollision) == 0x000A90, "Member 'ABP_Slender_C::RightFootCollision' has a wrong offset!");
static_assert(offsetof(ABP_Slender_C, LeftFootCollision) == 0x000A98, "Member 'ABP_Slender_C::LeftFootCollision' has a wrong offset!");

}

