#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Tornado

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Tornado.BP_Tornado_C.AddForceToAllBodies
// 0x0030 (0x0030 - 0x0000)
struct BP_Tornado_C_AddForceToAllBodies final
{
public:
	class UPrimitiveComponent*                    Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Force;                                             // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tornado_C_AddForceToAllBodies) == 0x000008, "Wrong alignment on BP_Tornado_C_AddForceToAllBodies");
static_assert(sizeof(BP_Tornado_C_AddForceToAllBodies) == 0x000030, "Wrong size on BP_Tornado_C_AddForceToAllBodies");
static_assert(offsetof(BP_Tornado_C_AddForceToAllBodies, Component) == 0x000000, "Member 'BP_Tornado_C_AddForceToAllBodies::Component' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_AddForceToAllBodies, Force) == 0x000008, "Member 'BP_Tornado_C_AddForceToAllBodies::Force' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_AddForceToAllBodies, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x000020, "Member 'BP_Tornado_C_AddForceToAllBodies::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_AddForceToAllBodies, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Tornado_C_AddForceToAllBodies::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_Tornado.BP_Tornado_C.BndEvt__BP_Tornado_CharactersDetector_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_Tornado_C_BndEvt__BP_Tornado_CharactersDetector_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Tornado_C_BndEvt__BP_Tornado_CharactersDetector_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Tornado_C_BndEvt__BP_Tornado_CharactersDetector_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Tornado_C_BndEvt__BP_Tornado_CharactersDetector_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_Tornado_C_BndEvt__BP_Tornado_CharactersDetector_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Tornado_C_BndEvt__BP_Tornado_CharactersDetector_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Tornado_C_BndEvt__BP_Tornado_CharactersDetector_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_BndEvt__BP_Tornado_CharactersDetector_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Tornado_C_BndEvt__BP_Tornado_CharactersDetector_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_BndEvt__BP_Tornado_CharactersDetector_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Tornado_C_BndEvt__BP_Tornado_CharactersDetector_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_BndEvt__BP_Tornado_CharactersDetector_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Tornado_C_BndEvt__BP_Tornado_CharactersDetector_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_BndEvt__BP_Tornado_CharactersDetector_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_Tornado_C_BndEvt__BP_Tornado_CharactersDetector_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_BndEvt__BP_Tornado_CharactersDetector_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_Tornado_C_BndEvt__BP_Tornado_CharactersDetector_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_Tornado.BP_Tornado_C.ExecuteUbergraph_BP_Tornado
// 0x0478 (0x0478 - 0x0000)
struct BP_Tornado_C_ExecuteUbergraph_BP_Tornado final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            CallFunc_GetOverlappingComponents_OutOverlappingComponents; // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPhysicsLinearVelocity_ReturnValue;     // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Normal2D_ReturnValue;                     // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize2D_ReturnValue;                      // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue;              // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x01A8(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ABP_KillableCharacter_C*                K2Node_DynamicCast_AsBP_Killable_Character;        // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_NavigationPoint_Huge_C*>     CallFunc_GetAllActorsOfClass_OutActors;            // 0x02D8(0x0010)(ReferenceParm)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_2;        // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0340(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0358(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0370(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0388(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_MapRangeClamped_InRangeB_ImplicitCast;    // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado) == 0x000008, "Wrong alignment on BP_Tornado_C_ExecuteUbergraph_BP_Tornado");
static_assert(sizeof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado) == 0x000478, "Wrong size on BP_Tornado_C_ExecuteUbergraph_BP_Tornado");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, EntryPoint) == 0x000000, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_GetOverlappingComponents_OutOverlappingComponents) == 0x000010, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_GetOverlappingComponents_OutOverlappingComponents' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000040, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, Temp_int_Array_Index_Variable) == 0x000058, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_Array_Get_Item) == 0x000060, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_GetPhysicsLinearVelocity_ReturnValue) == 0x000068, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_GetPhysicsLinearVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000080, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_IsSimulatingPhysics_ReturnValue) == 0x000098, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_IsSimulatingPhysics_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_Conv_VectorToVector2D_ReturnValue_1) == 0x0000A0, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_Conv_VectorToVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x0000B0, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_Normal2D_ReturnValue) == 0x0000C0, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_Normal2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0000D0, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_Conv_Vector2DToVector_ReturnValue) == 0x0000E8, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_Conv_Vector2DToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_VSize2D_ReturnValue) == 0x000100, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_VSize2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x000108, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_MapRangeClamped_ReturnValue) == 0x000120, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000128, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000140, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000158, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_ClampVectorSize_ReturnValue) == 0x000170, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_ClampVectorSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000188, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, K2Node_ComponentBoundEvent_OtherActor) == 0x000190, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, K2Node_ComponentBoundEvent_OtherComp) == 0x000198, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0001A0, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, K2Node_ComponentBoundEvent_bFromSweep) == 0x0001A4, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, K2Node_ComponentBoundEvent_SweepResult) == 0x0001A8, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, K2Node_DynamicCast_AsBP_Killable_Character) == 0x000290, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::K2Node_DynamicCast_AsBP_Killable_Character' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, K2Node_DynamicCast_bSuccess) == 0x000298, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_MakeVector_ReturnValue) == 0x0002A0, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_RandomUnitVector_ReturnValue) == 0x0002B8, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0002D0, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_GetAllActorsOfClass_OutActors) == 0x0002D8, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_RandomFloatInRange_ReturnValue) == 0x0002E8, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_Conv_DoubleToVector_ReturnValue_2) == 0x0002F0, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_Conv_DoubleToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, Temp_int_Loop_Counter_Variable) == 0x000308, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x000310, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_Less_IntInt_ReturnValue) == 0x000328, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_Add_IntInt_ReturnValue) == 0x00032C, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000330, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_IsValid_ReturnValue) == 0x000338, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000340, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_GetCameraLocation_ReturnValue) == 0x000358, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_FindLookAtRotation_ReturnValue) == 0x000370, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000388, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Tornado_C_ExecuteUbergraph_BP_Tornado, CallFunc_MapRangeClamped_InRangeB_ImplicitCast) == 0x000470, "Member 'BP_Tornado_C_ExecuteUbergraph_BP_Tornado::CallFunc_MapRangeClamped_InRangeB_ImplicitCast' has a wrong offset!");

// Function BP_Tornado.BP_Tornado_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Tornado_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tornado_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Tornado_C_ReceiveTick");
static_assert(sizeof(BP_Tornado_C_ReceiveTick) == 0x000004, "Wrong size on BP_Tornado_C_ReceiveTick");
static_assert(offsetof(BP_Tornado_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Tornado_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

