#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UPPlayerState

#include "Basic.hpp"

#include "S_InventoryItem_structs.hpp"
#include "S_InventoryItemSave_structs.hpp"
#include "Engine_structs.hpp"
#include "E_PlayerAvatar_structs.hpp"
#include "E_InventoryItem_structs.hpp"


namespace SDK::Params
{

// Function BP_UPPlayerState.BP_UPPlayerState_C.AddInventoryItem
// 0x0010 (0x0010 - 0x0000)
struct BP_UPPlayerState_C_AddInventoryItem final
{
public:
	E_InventoryItem                               Item;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_InventoryItem_C*                    SpawnedItem;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPPlayerState_C_AddInventoryItem) == 0x000008, "Wrong alignment on BP_UPPlayerState_C_AddInventoryItem");
static_assert(sizeof(BP_UPPlayerState_C_AddInventoryItem) == 0x000010, "Wrong size on BP_UPPlayerState_C_AddInventoryItem");
static_assert(offsetof(BP_UPPlayerState_C_AddInventoryItem, Item) == 0x000000, "Member 'BP_UPPlayerState_C_AddInventoryItem::Item' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_AddInventoryItem, SpawnedItem) == 0x000008, "Member 'BP_UPPlayerState_C_AddInventoryItem::SpawnedItem' has a wrong offset!");

// Function BP_UPPlayerState.BP_UPPlayerState_C.AddMinimumItems
// 0x0028 (0x0028 - 0x0000)
struct BP_UPPlayerState_C_AddMinimumItems final
{
public:
	struct FS_InventoryItemSave                   K2Node_MakeStruct_S_InventoryItemSave;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCurrentMapType_InLobby;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCurrentMapType_InResult;               // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPPlayerState_C_AddMinimumItems) == 0x000008, "Wrong alignment on BP_UPPlayerState_C_AddMinimumItems");
static_assert(sizeof(BP_UPPlayerState_C_AddMinimumItems) == 0x000028, "Wrong size on BP_UPPlayerState_C_AddMinimumItems");
static_assert(offsetof(BP_UPPlayerState_C_AddMinimumItems, K2Node_MakeStruct_S_InventoryItemSave) == 0x000000, "Member 'BP_UPPlayerState_C_AddMinimumItems::K2Node_MakeStruct_S_InventoryItemSave' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_AddMinimumItems, CallFunc_Array_Add_ReturnValue) == 0x000008, "Member 'BP_UPPlayerState_C_AddMinimumItems::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_AddMinimumItems, CallFunc_Array_IsEmpty_ReturnValue) == 0x00000C, "Member 'BP_UPPlayerState_C_AddMinimumItems::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_AddMinimumItems, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BP_UPPlayerState_C_AddMinimumItems::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_AddMinimumItems, K2Node_DynamicCast_AsBP_UPGame_Instance) == 0x000018, "Member 'BP_UPPlayerState_C_AddMinimumItems::K2Node_DynamicCast_AsBP_UPGame_Instance' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_AddMinimumItems, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_UPPlayerState_C_AddMinimumItems::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_AddMinimumItems, CallFunc_GetCurrentMapType_InLobby) == 0x000021, "Member 'BP_UPPlayerState_C_AddMinimumItems::CallFunc_GetCurrentMapType_InLobby' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_AddMinimumItems, CallFunc_GetCurrentMapType_InResult) == 0x000022, "Member 'BP_UPPlayerState_C_AddMinimumItems::CallFunc_GetCurrentMapType_InResult' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_AddMinimumItems, CallFunc_Not_PreBool_ReturnValue) == 0x000023, "Member 'BP_UPPlayerState_C_AddMinimumItems::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_AddMinimumItems, CallFunc_Not_PreBool_ReturnValue_1) == 0x000024, "Member 'BP_UPPlayerState_C_AddMinimumItems::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_AddMinimumItems, CallFunc_BooleanAND_ReturnValue) == 0x000025, "Member 'BP_UPPlayerState_C_AddMinimumItems::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_UPPlayerState.BP_UPPlayerState_C.CreateSave
// 0x0010 (0x0010 - 0x0000)
struct BP_UPPlayerState_C_CreateSave final
{
public:
	class UBP_UPPlayerStateSave_C*                Save;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPPlayerStateSave_C*                CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPPlayerState_C_CreateSave) == 0x000008, "Wrong alignment on BP_UPPlayerState_C_CreateSave");
static_assert(sizeof(BP_UPPlayerState_C_CreateSave) == 0x000010, "Wrong size on BP_UPPlayerState_C_CreateSave");
static_assert(offsetof(BP_UPPlayerState_C_CreateSave, Save) == 0x000000, "Member 'BP_UPPlayerState_C_CreateSave::Save' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_CreateSave, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000008, "Member 'BP_UPPlayerState_C_CreateSave::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");

// Function BP_UPPlayerState.BP_UPPlayerState_C.ExecuteUbergraph_BP_UPPlayerState
// 0x0388 (0x0388 - 0x0000)
struct BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInLobby_InLobby;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerController_C*               K2Node_DynamicCast_AsBP_UPPlayer_Controller;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                K2Node_DynamicCast_AsBP_UPPlayer_Character;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSteamId_IsValid;                     // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_CheckSteamId_SteamId;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_Int64Int64_ReturnValue;      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_PlayerName;                     // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                CallFunc_GetPlayerCharacter_Player;                // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_UPPlayerStateSave_C*                CallFunc_CreateSave_Save;                          // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_PlayerAvatar                                K2Node_CustomEvent_Avatar;                         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                K2Node_CustomEvent_Player_1;                       // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_KillableCharacter_C*                K2Node_CustomEvent_KilledCharacter;                // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Killer;                         // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerCharacter_C*                K2Node_CustomEvent_Player;                         // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ABP_KillableCharacter_C* KilledCharacter, class AActor* Killer)> K2Node_CreateDelegate_OutputDelegate; // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerCharacter_C*                CallFunc_GetPlayerCharacter_Player_1;              // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_InventoryItem_C*                    CallFunc_Array_Get_Item;                           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActorBeingDestroyed_ReturnValue;        // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_InventoryItem                               CallFunc_Array_Get_Item_1;                         // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldResetInventory_Reset;               // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_InventoryItem                               K2Node_CustomEvent_Item;                           // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_InventoryItem_C*                    K2Node_CustomEvent_SpawnedItem;                    // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_InventoryItemSave                   K2Node_MakeStruct_S_InventoryItemSave;             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerController_C*               K2Node_DynamicCast_AsBP_UPPlayer_Controller_1;     // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance_1;         // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInResults_InResults;                    // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x2];                                      // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0134(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadInventory_ItemsAddedToStock;          // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSessionHost_IsHost;                     // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSaveSlotName_SlotName;                 // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance_2;         // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetProfilePicture_ProfilePicture;         // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerController_C*               K2Node_DynamicCast_AsBP_UPPlayer_Controller_2;     // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPGameState_C*                      K2Node_DynamicCast_AsBP_UPGame_State;              // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01B8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0208(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0218(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0238(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0288(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x02A0(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UObject*                          Temp_object_Variable;                              // 0x02C0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_InventoryItem                       CallFunc_GetInventoryItemInfo_ItemInfo;            // 0x02C8(0x0068)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumPlayerControllers_ReturnValue;      // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x3];                                      // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_CustomEvent_EndPlayReason;                  // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_342[0x2];                                      // 0x0342(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumPlayerControllers_ReturnValue_1;    // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_2;                    // 0x0352(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0353(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0355(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_356[0x2];                                      // 0x0356(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerController_C*               K2Node_DynamicCast_AsBP_UPPlayer_Controller_3;     // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36A[0x6];                                      // 0x036A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance_3;         // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState) == 0x000008, "Wrong alignment on BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState");
static_assert(sizeof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState) == 0x000388, "Wrong size on BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, EntryPoint) == 0x000000, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_IsInLobby_InLobby) == 0x000004, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_IsInLobby_InLobby' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_DynamicCast_AsBP_UPPlayer_Controller) == 0x000018, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_DynamicCast_AsBP_UPPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_DynamicCast_AsBP_UPPlayer_Character) == 0x000028, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_DynamicCast_AsBP_UPPlayer_Character' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_CheckSteamId_IsValid) == 0x000031, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_CheckSteamId_IsValid' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_CheckSteamId_SteamId) == 0x000038, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_CheckSteamId_SteamId' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_Event_EndPlayReason) == 0x000040, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_GreaterEqual_Int64Int64_ReturnValue) == 0x000041, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_GreaterEqual_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_CustomEvent_PlayerName) == 0x000048, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_CustomEvent_PlayerName' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_GetGameInstance_ReturnValue) == 0x000058, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_DynamicCast_AsBP_UPGame_Instance) == 0x000060, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_DynamicCast_AsBP_UPGame_Instance' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, Temp_int_Array_Index_Variable) == 0x00006C, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_IsEmpty_ReturnValue) == 0x000070, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_GetPlayerCharacter_Player) == 0x000078, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_GetPlayerCharacter_Player' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_CreateSave_Save) == 0x000088, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_CreateSave_Save' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_CustomEvent_Avatar) == 0x000090, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_CustomEvent_Avatar' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_CustomEvent_Player_1) == 0x000098, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_CustomEvent_Player_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_CustomEvent_KilledCharacter) == 0x0000A0, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_CustomEvent_KilledCharacter' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_CustomEvent_Killer) == 0x0000A8, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_CustomEvent_Killer' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_CustomEvent_Player) == 0x0000B0, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_CustomEvent_Player' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_CreateDelegate_OutputDelegate) == 0x0000B8, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_GetPlayerCharacter_Player_1) == 0x0000C8, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_GetPlayerCharacter_Player_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_IsValid_ReturnValue_1) == 0x0000D0, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_IsActorBeingDestroyed_ReturnValue) == 0x0000E0, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_IsActorBeingDestroyed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_Array_Get_Item_1) == 0x0000E1, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_Array_Length_ReturnValue) == 0x0000E4, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_ShouldResetInventory_Reset) == 0x0000E8, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_ShouldResetInventory_Reset' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_CustomEvent_Item) == 0x0000E9, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_CustomEvent_Item' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_CustomEvent_SpawnedItem) == 0x0000F0, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_CustomEvent_SpawnedItem' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, Temp_int_Variable) == 0x0000F8, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_GetPlayerController_ReturnValue_1) == 0x000100, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_MakeStruct_S_InventoryItemSave) == 0x000108, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_MakeStruct_S_InventoryItemSave' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_DynamicCast_AsBP_UPPlayer_Controller_1) == 0x000110, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_DynamicCast_AsBP_UPPlayer_Controller_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_DynamicCast_bSuccess_3) == 0x000118, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_Add_IntInt_ReturnValue) == 0x00011C, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_GetGameInstance_ReturnValue_1) == 0x000120, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_DynamicCast_AsBP_UPGame_Instance_1) == 0x000128, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_DynamicCast_AsBP_UPGame_Instance_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_DynamicCast_bSuccess_4) == 0x000130, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_IsInResults_InResults) == 0x000131, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_IsInResults_InResults' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_CreateDelegate_OutputDelegate_1) == 0x000134, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_Array_Add_ReturnValue) == 0x000144, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_LoadInventory_ItemsAddedToStock) == 0x000148, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_LoadInventory_ItemsAddedToStock' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_IsSessionHost_IsHost) == 0x000149, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_IsSessionHost_IsHost' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_GetSaveSlotName_SlotName) == 0x000150, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_GetSaveSlotName_SlotName' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_SaveGameToSlot_ReturnValue) == 0x000160, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_GetGameInstance_ReturnValue_2) == 0x000168, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_DynamicCast_AsBP_UPGame_Instance_2) == 0x000170, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_DynamicCast_AsBP_UPGame_Instance_2' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_DynamicCast_bSuccess_5) == 0x000178, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, Temp_int_Variable_1) == 0x00017C, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_GetProfilePicture_ProfilePicture) == 0x000180, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_GetProfilePicture_ProfilePicture' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_GetPlayerController_ReturnValue_2) == 0x000188, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_DynamicCast_AsBP_UPPlayer_Controller_2) == 0x000190, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_DynamicCast_AsBP_UPPlayer_Controller_2' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_DynamicCast_bSuccess_6) == 0x000198, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_Add_IntInt_ReturnValue_1) == 0x00019C, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_GetGameState_ReturnValue) == 0x0001A0, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_DynamicCast_AsBP_UPGame_State) == 0x0001A8, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_DynamicCast_AsBP_UPGame_State' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_DynamicCast_bSuccess_7) == 0x0001B0, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_IsValid_ReturnValue_2) == 0x0001B1, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_MakeStruct_FormatArgumentData) == 0x0001B8, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_MakeArray_Array) == 0x000208, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_Format_ReturnValue) == 0x000218, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_IsValid_ReturnValue_3) == 0x000230, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, Temp_int_Loop_Counter_Variable) == 0x000234, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_MakeStruct_FormatArgumentData_1) == 0x000238, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_MakeArray_Array_1) == 0x000288, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_Less_IntInt_ReturnValue) == 0x000298, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_Format_ReturnValue_1) == 0x0002A0, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_Add_IntInt_ReturnValue_2) == 0x0002B8, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, Temp_object_Variable) == 0x0002C0, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_GetInventoryItemInfo_ItemInfo) == 0x0002C8, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_GetInventoryItemInfo_ItemInfo' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_BooleanAND_ReturnValue) == 0x000330, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_GetNumPlayerControllers_ReturnValue) == 0x000334, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_GetNumPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_HasAuthority_ReturnValue) == 0x000338, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_Subtract_IntInt_ReturnValue) == 0x00033C, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000340, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_CustomEvent_EndPlayReason) == 0x000341, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_CustomEvent_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_GetNumPlayerControllers_ReturnValue_1) == 0x000344, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_GetNumPlayerControllers_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000348, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00034C, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000350, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_IsEmpty_ReturnValue_1) == 0x000351, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_IsEmpty_ReturnValue_2) == 0x000352, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_IsEmpty_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_Not_PreBool_ReturnValue) == 0x000353, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_Not_PreBool_ReturnValue_1) == 0x000354, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_BooleanAND_ReturnValue_1) == 0x000355, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_GetPlayerController_ReturnValue_3) == 0x000358, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_DynamicCast_AsBP_UPPlayer_Controller_3) == 0x000360, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_DynamicCast_AsBP_UPPlayer_Controller_3' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_DynamicCast_bSuccess_8) == 0x000368, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_IsValid_ReturnValue_4) == 0x000369, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, CallFunc_GetGameInstance_ReturnValue_3) == 0x000370, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::CallFunc_GetGameInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_DynamicCast_AsBP_UPGame_Instance_3) == 0x000378, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_DynamicCast_AsBP_UPGame_Instance_3' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState, K2Node_DynamicCast_bSuccess_9) == 0x000380, "Member 'BP_UPPlayerState_C_ExecuteUbergraph_BP_UPPlayerState::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");

// Function BP_UPPlayerState.BP_UPPlayerState_C.GetPlayerCharacter
// 0x0020 (0x0020 - 0x0000)
struct BP_UPPlayerState_C_GetPlayerCharacter final
{
public:
	class ABP_UPPlayerCharacter_C*                Player;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                K2Node_DynamicCast_AsBP_UPPlayer_Character;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPPlayerState_C_GetPlayerCharacter) == 0x000008, "Wrong alignment on BP_UPPlayerState_C_GetPlayerCharacter");
static_assert(sizeof(BP_UPPlayerState_C_GetPlayerCharacter) == 0x000020, "Wrong size on BP_UPPlayerState_C_GetPlayerCharacter");
static_assert(offsetof(BP_UPPlayerState_C_GetPlayerCharacter, Player) == 0x000000, "Member 'BP_UPPlayerState_C_GetPlayerCharacter::Player' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_GetPlayerCharacter, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_UPPlayerState_C_GetPlayerCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_GetPlayerCharacter, K2Node_DynamicCast_AsBP_UPPlayer_Character) == 0x000010, "Member 'BP_UPPlayerState_C_GetPlayerCharacter::K2Node_DynamicCast_AsBP_UPPlayer_Character' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_GetPlayerCharacter, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_UPPlayerState_C_GetPlayerCharacter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_GetPlayerCharacter, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'BP_UPPlayerState_C_GetPlayerCharacter::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_UPPlayerState.BP_UPPlayerState_C.GetSaveSlotName
// 0x00B0 (0x00B0 - 0x0000)
struct BP_UPPlayerState_C_GetSaveSlotName final
{
public:
	class FString                                 SlotName;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_Int64ToText_ReturnValue;             // 0x0010(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPPlayerState_C_GetSaveSlotName) == 0x000008, "Wrong alignment on BP_UPPlayerState_C_GetSaveSlotName");
static_assert(sizeof(BP_UPPlayerState_C_GetSaveSlotName) == 0x0000B0, "Wrong size on BP_UPPlayerState_C_GetSaveSlotName");
static_assert(offsetof(BP_UPPlayerState_C_GetSaveSlotName, SlotName) == 0x000000, "Member 'BP_UPPlayerState_C_GetSaveSlotName::SlotName' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_GetSaveSlotName, CallFunc_Conv_Int64ToText_ReturnValue) == 0x000010, "Member 'BP_UPPlayerState_C_GetSaveSlotName::CallFunc_Conv_Int64ToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_GetSaveSlotName, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'BP_UPPlayerState_C_GetSaveSlotName::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_GetSaveSlotName, K2Node_MakeArray_Array) == 0x000078, "Member 'BP_UPPlayerState_C_GetSaveSlotName::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_GetSaveSlotName, CallFunc_Format_ReturnValue) == 0x000088, "Member 'BP_UPPlayerState_C_GetSaveSlotName::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerState_C_GetSaveSlotName, CallFunc_Conv_TextToString_ReturnValue) == 0x0000A0, "Member 'BP_UPPlayerState_C_GetSaveSlotName::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function BP_UPPlayerState.BP_UPPlayerState_C.InitInventory
// 0x0008 (0x0008 - 0x0000)
struct BP_UPPlayerState_C_InitInventory final
{
public:
	class ABP_UPPlayerCharacter_C*                Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPPlayerState_C_InitInventory) == 0x000008, "Wrong alignment on BP_UPPlayerState_C_InitInventory");
static_assert(sizeof(BP_UPPlayerState_C_InitInventory) == 0x000008, "Wrong size on BP_UPPlayerState_C_InitInventory");
