#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UPGameSession

#include "Basic.hpp"

#include "S_SpawnWave_structs.hpp"
#include "S_SpawnableVariants_structs.hpp"
#include "E_Spawnable_structs.hpp"
#include "S_VariantsProbabilities_structs.hpp"
#include "E_ScoringActorVariant_structs.hpp"
#include "E_SpawnContext_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_RareSpawn_structs.hpp"
#include "S_SpawnRules_structs.hpp"
#include "S_SpawnWaveElement_structs.hpp"


namespace SDK::Params
{

// Function BP_UPGameSession.BP_UPGameSession_C.ApplyCustomAmountModifier
// 0x0068 (0x0068 - 0x0000)
struct BP_UPGameSession_C_ApplyCustomAmountModifier final
{
public:
	int32                                         InMin;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMax;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<E_Spawnable>                           Spawnables_0;                                      // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	double                                        Min;                                               // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Max;                                               // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetAmountModifier_MinMultiplier;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetAmountModifier_MaxMultiplier;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPGameSession_C_ApplyCustomAmountModifier) == 0x000008, "Wrong alignment on BP_UPGameSession_C_ApplyCustomAmountModifier");
static_assert(sizeof(BP_UPGameSession_C_ApplyCustomAmountModifier) == 0x000068, "Wrong size on BP_UPGameSession_C_ApplyCustomAmountModifier");
static_assert(offsetof(BP_UPGameSession_C_ApplyCustomAmountModifier, InMin) == 0x000000, "Member 'BP_UPGameSession_C_ApplyCustomAmountModifier::InMin' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ApplyCustomAmountModifier, InMax) == 0x000004, "Member 'BP_UPGameSession_C_ApplyCustomAmountModifier::InMax' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ApplyCustomAmountModifier, Spawnables_0) == 0x000008, "Member 'BP_UPGameSession_C_ApplyCustomAmountModifier::Spawnables_0' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ApplyCustomAmountModifier, Min) == 0x000018, "Member 'BP_UPGameSession_C_ApplyCustomAmountModifier::Min' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ApplyCustomAmountModifier, Max) == 0x000020, "Member 'BP_UPGameSession_C_ApplyCustomAmountModifier::Max' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ApplyCustomAmountModifier, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000028, "Member 'BP_UPGameSession_C_ApplyCustomAmountModifier::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ApplyCustomAmountModifier, CallFunc_GetAmountModifier_MinMultiplier) == 0x000030, "Member 'BP_UPGameSession_C_ApplyCustomAmountModifier::CallFunc_GetAmountModifier_MinMultiplier' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ApplyCustomAmountModifier, CallFunc_GetAmountModifier_MaxMultiplier) == 0x000038, "Member 'BP_UPGameSession_C_ApplyCustomAmountModifier::CallFunc_GetAmountModifier_MaxMultiplier' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ApplyCustomAmountModifier, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_UPGameSession_C_ApplyCustomAmountModifier::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ApplyCustomAmountModifier, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000048, "Member 'BP_UPGameSession_C_ApplyCustomAmountModifier::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ApplyCustomAmountModifier, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000050, "Member 'BP_UPGameSession_C_ApplyCustomAmountModifier::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ApplyCustomAmountModifier, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x000058, "Member 'BP_UPGameSession_C_ApplyCustomAmountModifier::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ApplyCustomAmountModifier, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000060, "Member 'BP_UPGameSession_C_ApplyCustomAmountModifier::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");

// Function BP_UPGameSession.BP_UPGameSession_C.ApplyCustomTimeModifier
// 0x0040 (0x0040 - 0x0000)
struct BP_UPGameSession_C_ApplyCustomTimeModifier final
{
public:
	double                                        InMin;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InMax;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Spawnable                                   Spawnable;                                         // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Min;                                               // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Max;                                               // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetTimeModifier_Multiplier;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPGameSession_C_ApplyCustomTimeModifier) == 0x000008, "Wrong alignment on BP_UPGameSession_C_ApplyCustomTimeModifier");
static_assert(sizeof(BP_UPGameSession_C_ApplyCustomTimeModifier) == 0x000040, "Wrong size on BP_UPGameSession_C_ApplyCustomTimeModifier");
static_assert(offsetof(BP_UPGameSession_C_ApplyCustomTimeModifier, InMin) == 0x000000, "Member 'BP_UPGameSession_C_ApplyCustomTimeModifier::InMin' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ApplyCustomTimeModifier, InMax) == 0x000008, "Member 'BP_UPGameSession_C_ApplyCustomTimeModifier::InMax' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ApplyCustomTimeModifier, Spawnable) == 0x000010, "Member 'BP_UPGameSession_C_ApplyCustomTimeModifier::Spawnable' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ApplyCustomTimeModifier, Min) == 0x000018, "Member 'BP_UPGameSession_C_ApplyCustomTimeModifier::Min' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ApplyCustomTimeModifier, Max) == 0x000020, "Member 'BP_UPGameSession_C_ApplyCustomTimeModifier::Max' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ApplyCustomTimeModifier, CallFunc_GetTimeModifier_Multiplier) == 0x000028, "Member 'BP_UPGameSession_C_ApplyCustomTimeModifier::CallFunc_GetTimeModifier_Multiplier' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ApplyCustomTimeModifier, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_UPGameSession_C_ApplyCustomTimeModifier::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ApplyCustomTimeModifier, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000038, "Member 'BP_UPGameSession_C_ApplyCustomTimeModifier::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");

// Function BP_UPGameSession.BP_UPGameSession_C.ExecuteUbergraph_BP_UPGameSession
// 0x05B0 (0x05B0 - 0x0000)
struct BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_SpawnWave                           K2Node_CustomEvent_Wave;                           // 0x00B0(0x0018)(HasGetValueTypeHash)
	struct FS_SpawnWaveElement                    CallFunc_Array_Get_Item;                           // 0x00C8(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ApplyCustomAmountModifier_Min;            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ApplyCustomAmountModifier_Max;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRandomCount_ReturnValue;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<E_Spawnable>                           CallFunc_GetRandomSpawnables_Spawnables;           // 0x0108(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue; // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SpawnContext                                K2Node_CustomEvent_SpawnContext;                   // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Spawnable                                   K2Node_CustomEvent_Spawnable;                      // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_136[0x2];                                      // 0x0136(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_TrySpawn_Actor;                           // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0150(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0170(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01D0(0x0018)()
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Spawnable                                   CallFunc_Array_Get_Item_1;                         // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x2];                                      // 0x01F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Spawner_C*>                  CallFunc_GetAllActorsOfClass_OutActors;            // 0x0218(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0230(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_DelayedSpawn_C*                     CallFunc_FinishSpawningActor_ReturnValue;          // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Episodes_C*                         CallFunc_GetActorOfClass_ReturnValue;              // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_SpawnWave>                   CallFunc_GetSpawnRules_SpawnWaves;                 // 0x02B8(0x0010)(ReferenceParm)
	TArray<struct FS_RareSpawn>                   CallFunc_GetSpawnRules_RareSpawns;                 // 0x02C8(0x0010)(ReferenceParm)
	TMap<E_Spawnable, struct FS_VariantsProbabilities> CallFunc_GetSpawnRules_Variants;              // 0x02D8(0x0050)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0330(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0380(0x0010)(ReferenceParm)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0398(0x0018)()
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance_1;         // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInSession_InSession;                    // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA[0x2];                                      // 0x03BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_RareSpawn                           CallFunc_Array_Get_Item_2;                         // 0x03C0(0x0068)(HasGetValueTypeHash)
	E_Spawnable                                   CallFunc_SelectRareSpawnable_Spawnable;            // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldSpawn_Result;                       // 0x0429(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42A[0x6];                                      // 0x042A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ApplyCustomTimeModifier_Min;              // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ApplyCustomTimeModifier_Max;              // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetRandomTime_Value;                      // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue; // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ABP_KillableCharacter_C* KilledCharacter, class AActor* Killer)> K2Node_CreateDelegate_OutputDelegate; // 0x0450(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ABP_UPPlayerCharacter_C* Player)> K2Node_CreateDelegate_OutputDelegate_1;   // 0x0460(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_UPPlayerCharacter_C*>        CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0470(0x0010)(ReferenceParm)
	class ABP_UPPlayerCharacter_C*                CallFunc_Array_Get_Item_3;                         // 0x0480(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x048C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x048D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48E[0x2];                                      // 0x048E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0490(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPGameState_C*                      K2Node_DynamicCast_AsBP_UPGame_State;              // 0x0498(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x3];                                      // 0x04A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x04A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x04B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x04C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance_2;         // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1[0x3];                                      // 0x04D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x04D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x04E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_UPPlayerCharacter_C*>        CallFunc_GetAllActorsOfClass_OutActors_2;          // 0x04F0(0x0010)(ReferenceParm)
	class ABP_UPPlayerCharacter_C*                CallFunc_Array_Get_Item_4;                         // 0x0500(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x050C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50D[0x3];                                      // 0x050D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_514[0x4];                                      // 0x0514(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                K2Node_CustomEvent_Player;                         // 0x0518(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_KillableCharacter_C*                K2Node_CustomEvent_KilledCharacter;                // 0x0520(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Killer;                         // 0x0528(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x0530(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance_3;         // 0x0538(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                CallFunc_Array_Get_Item_5;                         // 0x0548(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0554(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReadyToStart_IsReady;                   // 0x0555(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_556[0x2];                                      // 0x0556(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0558(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_561[0x7];                                      // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerController_C*               K2Node_DynamicCast_AsBP_UPPlayer_Controller;       // 0x0568(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_571[0x7];                                      // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_AddHudWidget_Widget;                      // 0x0578(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_GameSession_C*                       K2Node_DynamicCast_AsW_Game_Session;               // 0x0580(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_589[0x7];                                      // 0x0589(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x059C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_TimeRemaining_ImplicitCast;     // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession) == 0x000010, "Wrong alignment on BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession");
static_assert(sizeof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession) == 0x0005B0, "Wrong size on BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, EntryPoint) == 0x000000, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, K2Node_DynamicCast_AsBP_UPGame_Instance) == 0x000010, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::K2Node_DynamicCast_AsBP_UPGame_Instance' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, Temp_int_Array_Index_Variable) == 0x000024, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, Temp_int_Loop_Counter_Variable_1) == 0x000028, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Add_IntInt_ReturnValue_1) == 0x00002C, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, Temp_int_Array_Index_Variable_1) == 0x000030, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, Temp_int_Variable) == 0x000034, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000038, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Add_IntInt_ReturnValue_2) == 0x000090, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, Temp_bool_Variable) == 0x000094, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, Temp_int_Array_Index_Variable_2) == 0x000098, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Not_PreBool_ReturnValue) == 0x00009C, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, Temp_int_Loop_Counter_Variable_2) == 0x0000A0, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000A4, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, Temp_int_Array_Index_Variable_3) == 0x0000A8, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_HasAuthority_ReturnValue) == 0x0000AC, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, K2Node_CustomEvent_Wave) == 0x0000B0, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::K2Node_CustomEvent_Wave' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Array_Length_ReturnValue) == 0x0000E8, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_ApplyCustomAmountModifier_Min) == 0x0000F0, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_ApplyCustomAmountModifier_Min' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_ApplyCustomAmountModifier_Max) == 0x0000F8, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_ApplyCustomAmountModifier_Max' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_GetRandomCount_ReturnValue) == 0x000100, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_GetRandomCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_GetRandomSpawnables_Spawnables) == 0x000108, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_GetRandomSpawnables_Spawnables' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Array_Length_ReturnValue_1) == 0x000118, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00011C, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue) == 0x000120, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000128, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Add_IntInt_ReturnValue_4) == 0x000130, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, K2Node_CustomEvent_SpawnContext) == 0x000134, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::K2Node_CustomEvent_SpawnContext' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, K2Node_CustomEvent_Spawnable) == 0x000135, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::K2Node_CustomEvent_Spawnable' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000138, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_TrySpawn_Actor) == 0x000148, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_TrySpawn_Actor' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Conv_StringToText_ReturnValue) == 0x000150, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_IsValid_ReturnValue) == 0x000168, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, K2Node_MakeStruct_FormatArgumentData_1) == 0x000170, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, K2Node_MakeArray_Array) == 0x0001C0, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Format_ReturnValue) == 0x0001D0, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001E8, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, Temp_int_Array_Index_Variable_4) == 0x0001EC, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_BooleanAND_ReturnValue) == 0x0001F0, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Array_Get_Item_1) == 0x0001F1, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, Temp_int_Loop_Counter_Variable_3) == 0x0001F4, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Less_IntInt_ReturnValue) == 0x0001F8, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Add_IntInt_ReturnValue_5) == 0x0001FC, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, Temp_int_Loop_Counter_Variable_4) == 0x000200, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, Temp_int_Loop_Counter_Variable_5) == 0x000204, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Add_IntInt_ReturnValue_6) == 0x000208, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Less_IntInt_ReturnValue_1) == 0x00020C, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Add_IntInt_ReturnValue_7) == 0x000210, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Add_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_GetAllActorsOfClass_OutActors) == 0x000218, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Array_Length_ReturnValue_2) == 0x000228, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_GetTransform_ReturnValue) == 0x000230, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Less_IntInt_ReturnValue_2) == 0x000290, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000298, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_FinishSpawningActor_ReturnValue) == 0x0002A0, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_GetActorOfClass_ReturnValue) == 0x0002A8, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_IsValid_ReturnValue_1) == 0x0002B0, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_GetSpawnRules_SpawnWaves) == 0x0002B8, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_GetSpawnRules_SpawnWaves' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_GetSpawnRules_RareSpawns) == 0x0002C8, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_GetSpawnRules_RareSpawns' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_GetSpawnRules_Variants) == 0x0002D8, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_GetSpawnRules_Variants' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000328, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, K2Node_MakeStruct_FormatArgumentData_2) == 0x000330, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, K2Node_MakeArray_Array_1) == 0x000380, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_GetGameInstance_ReturnValue_1) == 0x000390, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Format_ReturnValue_1) == 0x000398, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, K2Node_DynamicCast_AsBP_UPGame_Instance_1) == 0x0003B0, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::K2Node_DynamicCast_AsBP_UPGame_Instance_1' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, K2Node_DynamicCast_bSuccess_1) == 0x0003B8, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_IsInSession_InSession) == 0x0003B9, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_IsInSession_InSession' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, Temp_int_Array_Index_Variable_5) == 0x0003BC, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Array_Get_Item_2) == 0x0003C0, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_SelectRareSpawnable_Spawnable) == 0x000428, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_SelectRareSpawnable_Spawnable' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_ShouldSpawn_Result) == 0x000429, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_ShouldSpawn_Result' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_ApplyCustomTimeModifier_Min) == 0x000430, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_ApplyCustomTimeModifier_Min' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_ApplyCustomTimeModifier_Max) == 0x000438, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_ApplyCustomTimeModifier_Max' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_GetRandomTime_Value) == 0x000440, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_GetRandomTime_Value' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000448, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue) == 0x00044C, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, K2Node_CreateDelegate_OutputDelegate) == 0x000450, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, K2Node_CreateDelegate_OutputDelegate_1) == 0x000460, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000470, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Array_Get_Item_3) == 0x000480, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Array_Length_ReturnValue_3) == 0x000488, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Less_IntInt_ReturnValue_3) == 0x00048C, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_Array_IsEmpty_ReturnValue) == 0x00048D, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession, CallFunc_GetGameState_ReturnValue) == 0x000490, "Member 'BP_UPGameSession_C_ExecuteUbergraph_BP_UPGameSession::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
