#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UPGameStateSave

#include "Basic.hpp"

#include "S_CameroidCaptureGroup_structs.hpp"
#include "S_InventoryItemSave_structs.hpp"
#include "S_CameroidCapture_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_UPGameStateSave.BP_UPGameStateSave_C
// 0x0060 (0x0088 - 0x0028)
class UBP_UPGameStateSave_C final : public USaveGame
{
public:
	TArray<int64>                                 SteamIds;                                          // 0x0028(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FS_CameroidCaptureGroup>        Captures;                                          // 0x0038(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Wallet;                                            // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_InventoryItemSave>           ItemsStock;                                        // 0x0050(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FS_CameroidCapture>             TopCaptures;                                       // 0x0060(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int64>                                 KickedSteamIds;                                    // 0x0070(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ResultsPublished;                                  // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UPGameStateSave_C">();
	}
	static class UBP_UPGameStateSave_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UPGameStateSave_C>();
	}
};
static_assert(alignof(UBP_UPGameStateSave_C) == 0x000008, "Wrong alignment on UBP_UPGameStateSave_C");
static_assert(sizeof(UBP_UPGameStateSave_C) == 0x000088, "Wrong size on UBP_UPGameStateSave_C");
static_assert(offsetof(UBP_UPGameStateSave_C, SteamIds) == 0x000028, "Member 'UBP_UPGameStateSave_C::SteamIds' has a wrong offset!");
static_assert(offsetof(UBP_UPGameStateSave_C, Captures) == 0x000038, "Member 'UBP_UPGameStateSave_C::Captures' has a wrong offset!");
static_assert(offsetof(UBP_UPGameStateSave_C, Wallet) == 0x000048, "Member 'UBP_UPGameStateSave_C::Wallet' has a wrong offset!");
static_assert(offsetof(UBP_UPGameStateSave_C, ItemsStock) == 0x000050, "Member 'UBP_UPGameStateSave_C::ItemsStock' has a wrong offset!");
static_assert(offsetof(UBP_UPGameStateSave_C, TopCaptures) == 0x000060, "Member 'UBP_UPGameStateSave_C::TopCaptures' has a wrong offset!");
static_assert(offsetof(UBP_UPGameStateSave_C, KickedSteamIds) == 0x000070, "Member 'UBP_UPGameStateSave_C::KickedSteamIds' has a wrong offset!");
static_assert(offsetof(UBP_UPGameStateSave_C, ResultsPublished) == 0x000080, "Member 'UBP_UPGameStateSave_C::ResultsPublished' has a wrong offset!");

}

