#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UPPlayerSpectator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function BP_UPPlayerSpectator.BP_UPPlayerSpectator_C.ExecuteUbergraph_BP_UPPlayerSpectator
// 0x0298 (0x0298 - 0x0000)
struct BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0020(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0048(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1_0;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_InputActionValueToAxis2D_ReturnValue; // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable;                              // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetPlayerMeshLocation_Location;           // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x00D0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BB[0x5];                                      // 0x01BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Event_OldController;                        // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_Event_NewController;                        // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerController_C*               K2Node_DynamicCast_AsBP_UPPlayer_Controller;       // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue;      // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E3[0x1];                                      // 0x01E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3;                              // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_1;                            // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0208(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0230(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue_1;    // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23A[0x6];                                      // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3_0;                            // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_AddHudWidget_Widget;                      // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_Spectate_C*                          K2Node_DynamicCast_AsW_Spectate;                   // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26A[0x6];                                      // 0x026A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                K2Node_CustomEvent_LocalPlayer;                    // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_UPPlayerCharacter_C*>        CallFunc_GetAllActorsOfClass_OutActors;            // 0x0278(0x0010)(ReferenceParm)
	float                                         CallFunc_AddControllerYawInput_Val_ImplicitCast;   // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AddControllerPitchInput_Val_ImplicitCast; // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetAspectRatio_InAspectRatio_ImplicitCast; // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator) == 0x000008, "Wrong alignment on BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator");
static_assert(sizeof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator) == 0x000298, "Wrong size on BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, EntryPoint) == 0x000000, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, Temp_real_Variable) == 0x000008, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, Temp_real_Variable_1) == 0x000010, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, Temp_object_Variable) == 0x000018, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000020, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000040, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x000044, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000048, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_HasAuthority_ReturnValue) == 0x000050, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, Temp_real_Variable_1_0) == 0x000058, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, Temp_real_Variable_0) == 0x000060, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_Conv_InputActionValueToAxis2D_ReturnValue) == 0x000068, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_Conv_InputActionValueToAxis2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, Temp_struct_Variable) == 0x000078, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_BreakVector2D_X) == 0x000088, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_BreakVector2D_Y) == 0x000090, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, K2Node_Event_DeltaSeconds) == 0x000098, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_Add_IntInt_ReturnValue) == 0x0000A8, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_Not_PreBool_ReturnValue) == 0x0000AC, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000AD, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_GetPlayerMeshLocation_Location) == 0x0000B0, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_GetPlayerMeshLocation_Location' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_BooleanAND_ReturnValue) == 0x0000C8, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0000D0, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0001B8, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_IsValid_ReturnValue) == 0x0001B9, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0001BA, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, K2Node_Event_OldController) == 0x0001C0, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::K2Node_Event_OldController' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, K2Node_Event_NewController) == 0x0001C8, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::K2Node_Event_NewController' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, K2Node_DynamicCast_AsBP_UPPlayer_Controller) == 0x0001D0, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::K2Node_DynamicCast_AsBP_UPPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, K2Node_DynamicCast_bSuccess) == 0x0001D8, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_IsValid_ReturnValue_1) == 0x0001D9, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, K2Node_Event_EndPlayReason) == 0x0001DA, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_IsValid_ReturnValue_2) == 0x0001DB, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_Array_Find_ReturnValue) == 0x0001DC, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_IsValid_ReturnValue_3) == 0x0001E0, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_IsLocalPlayerController_ReturnValue) == 0x0001E1, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_IsLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, Temp_bool_Variable) == 0x0001E2, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, Temp_int_Variable) == 0x0001E4, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, Temp_real_Variable_2) == 0x0001E8, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x0001F0, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, Temp_real_Variable_3) == 0x0001F8, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, Temp_object_Variable_1) == 0x000200, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000208, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000228, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00022C, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000230, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_IsValid_ReturnValue_4) == 0x000238, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_IsLocalPlayerController_ReturnValue_1) == 0x000239, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_IsLocalPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, Temp_real_Variable_3_0) == 0x000240, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, Temp_real_Variable_2_0) == 0x000248, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000250, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_AddHudWidget_Widget) == 0x000258, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_AddHudWidget_Widget' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, K2Node_DynamicCast_AsW_Spectate) == 0x000260, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::K2Node_DynamicCast_AsW_Spectate' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, K2Node_DynamicCast_bSuccess_1) == 0x000268, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_IsValid_ReturnValue_5) == 0x000269, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, K2Node_CustomEvent_LocalPlayer) == 0x000270, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::K2Node_CustomEvent_LocalPlayer' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_GetAllActorsOfClass_OutActors) == 0x000278, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_AddControllerYawInput_Val_ImplicitCast) == 0x000288, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_AddControllerYawInput_Val_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_AddControllerPitchInput_Val_ImplicitCast) == 0x00028C, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_AddControllerPitchInput_Val_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator, CallFunc_SetAspectRatio_InAspectRatio_ImplicitCast) == 0x000290, "Member 'BP_UPPlayerSpectator_C_ExecuteUbergraph_BP_UPPlayerSpectator::CallFunc_SetAspectRatio_InAspectRatio_ImplicitCast' has a wrong offset!");

// Function BP_UPPlayerSpectator.BP_UPPlayerSpectator_C.FindPlayers
// 0x0008 (0x0008 - 0x0000)
struct BP_UPPlayerSpectator_C_FindPlayers final
{
public:
	class ABP_UPPlayerCharacter_C*                LocalPlayer_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPPlayerSpectator_C_FindPlayers) == 0x000008, "Wrong alignment on BP_UPPlayerSpectator_C_FindPlayers");
static_assert(sizeof(BP_UPPlayerSpectator_C_FindPlayers) == 0x000008, "Wrong size on BP_UPPlayerSpectator_C_FindPlayers");
static_assert(offsetof(BP_UPPlayerSpectator_C_FindPlayers, LocalPlayer_0) == 0x000000, "Member 'BP_UPPlayerSpectator_C_FindPlayers::LocalPlayer_0' has a wrong offset!");

// Function BP_UPPlayerSpectator.BP_UPPlayerSpectator_C.GetPlayerMeshLocation
// 0x00D0 (0x00D0 - 0x0000)
struct BP_UPPlayerSpectator_C_GetPlayerMeshLocation final
{
public:
	class ABP_UPPlayerCharacter_C*                Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetBoneTransform_ReturnValue;             // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPPlayerSpectator_C_GetPlayerMeshLocation) == 0x000010, "Wrong alignment on BP_UPPlayerSpectator_C_GetPlayerMeshLocation");
static_assert(sizeof(BP_UPPlayerSpectator_C_GetPlayerMeshLocation) == 0x0000D0, "Wrong size on BP_UPPlayerSpectator_C_GetPlayerMeshLocation");
static_assert(offsetof(BP_UPPlayerSpectator_C_GetPlayerMeshLocation, Player) == 0x000000, "Member 'BP_UPPlayerSpectator_C_GetPlayerMeshLocation::Player' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_GetPlayerMeshLocation, Location) == 0x000008, "Member 'BP_UPPlayerSpectator_C_GetPlayerMeshLocation::Location' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_GetPlayerMeshLocation, CallFunc_GetBoneTransform_ReturnValue) == 0x000020, "Member 'BP_UPPlayerSpectator_C_GetPlayerMeshLocation::CallFunc_GetBoneTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_GetPlayerMeshLocation, CallFunc_BreakTransform_Location) == 0x000080, "Member 'BP_UPPlayerSpectator_C_GetPlayerMeshLocation::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_GetPlayerMeshLocation, CallFunc_BreakTransform_Rotation) == 0x000098, "Member 'BP_UPPlayerSpectator_C_GetPlayerMeshLocation::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_GetPlayerMeshLocation, CallFunc_BreakTransform_Scale) == 0x0000B0, "Member 'BP_UPPlayerSpectator_C_GetPlayerMeshLocation::CallFunc_BreakTransform_Scale' has a wrong offset!");

// Function BP_UPPlayerSpectator.BP_UPPlayerSpectator_C.InpActEvt_IA_ChangeSpectate_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct BP_UPPlayerSpectator_C_InpActEvt_IA_ChangeSpectate_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPPlayerSpectator_C_InpActEvt_IA_ChangeSpectate_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on BP_UPPlayerSpectator_C_InpActEvt_IA_ChangeSpectate_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(BP_UPPlayerSpectator_C_InpActEvt_IA_ChangeSpectate_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on BP_UPPlayerSpectator_C_InpActEvt_IA_ChangeSpectate_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(BP_UPPlayerSpectator_C_InpActEvt_IA_ChangeSpectate_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'BP_UPPlayerSpectator_C_InpActEvt_IA_ChangeSpectate_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_InpActEvt_IA_ChangeSpectate_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'BP_UPPlayerSpectator_C_InpActEvt_IA_ChangeSpectate_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_InpActEvt_IA_ChangeSpectate_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'BP_UPPlayerSpectator_C_InpActEvt_IA_ChangeSpectate_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_InpActEvt_IA_ChangeSpectate_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'BP_UPPlayerSpectator_C_InpActEvt_IA_ChangeSpectate_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function BP_UPPlayerSpectator.BP_UPPlayerSpectator_C.InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct BP_UPPlayerSpectator_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPPlayerSpectator_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on BP_UPPlayerSpectator_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1");
static_assert(sizeof(BP_UPPlayerSpectator_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1) == 0x000030, "Wrong size on BP_UPPlayerSpectator_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1");
static_assert(offsetof(BP_UPPlayerSpectator_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1, ActionValue) == 0x000000, "Member 'BP_UPPlayerSpectator_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1::ActionValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1, ElapsedTime) == 0x000020, "Member 'BP_UPPlayerSpectator_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1, TriggeredTime) == 0x000024, "Member 'BP_UPPlayerSpectator_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1, SourceAction) == 0x000028, "Member 'BP_UPPlayerSpectator_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1::SourceAction' has a wrong offset!");

// Function BP_UPPlayerSpectator.BP_UPPlayerSpectator_C.ReceiveControllerChanged
// 0x0010 (0x0010 - 0x0000)
struct BP_UPPlayerSpectator_C_ReceiveControllerChanged final
{
public:
	class AController*                            OldController;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            NewController;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPPlayerSpectator_C_ReceiveControllerChanged) == 0x000008, "Wrong alignment on BP_UPPlayerSpectator_C_ReceiveControllerChanged");
static_assert(sizeof(BP_UPPlayerSpectator_C_ReceiveControllerChanged) == 0x000010, "Wrong size on BP_UPPlayerSpectator_C_ReceiveControllerChanged");
static_assert(offsetof(BP_UPPlayerSpectator_C_ReceiveControllerChanged, OldController) == 0x000000, "Member 'BP_UPPlayerSpectator_C_ReceiveControllerChanged::OldController' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_ReceiveControllerChanged, NewController) == 0x000008, "Member 'BP_UPPlayerSpectator_C_ReceiveControllerChanged::NewController' has a wrong offset!");

// Function BP_UPPlayerSpectator.BP_UPPlayerSpectator_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_UPPlayerSpectator_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPPlayerSpectator_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_UPPlayerSpectator_C_ReceiveEndPlay");
static_assert(sizeof(BP_UPPlayerSpectator_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_UPPlayerSpectator_C_ReceiveEndPlay");
static_assert(offsetof(BP_UPPlayerSpectator_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_UPPlayerSpectator_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_UPPlayerSpectator.BP_UPPlayerSpectator_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_UPPlayerSpectator_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPPlayerSpectator_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_UPPlayerSpectator_C_ReceiveTick");
static_assert(sizeof(BP_UPPlayerSpectator_C_ReceiveTick) == 0x000004, "Wrong size on BP_UPPlayerSpectator_C_ReceiveTick");
static_assert(offsetof(BP_UPPlayerSpectator_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_UPPlayerSpectator_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_UPPlayerSpectator.BP_UPPlayerSpectator_C.UpdatePawnMovement
// 0x0060 (0x0060 - 0x0000)
struct BP_UPPlayerSpectator_C_UpdatePawnMovement final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPPlayerSpectator_C_UpdatePawnMovement) == 0x000008, "Wrong alignment on BP_UPPlayerSpectator_C_UpdatePawnMovement");
static_assert(sizeof(BP_UPPlayerSpectator_C_UpdatePawnMovement) == 0x000060, "Wrong size on BP_UPPlayerSpectator_C_UpdatePawnMovement");
static_assert(offsetof(BP_UPPlayerSpectator_C_UpdatePawnMovement, Temp_bool_Variable) == 0x000000, "Member 'BP_UPPlayerSpectator_C_UpdatePawnMovement::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerSpectator_C_UpdatePawnMovement, CallFunc_GetActorUpVector_ReturnValue) == 0x000008, "Member 'BP_UPPlayerSpectator_C_UpdatePawnMovement::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
