#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UPPlayerStateSave

#include "Basic.hpp"

#include "E_PlayerAvatar_structs.hpp"
#include "S_InventoryItemSave_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_UPPlayerStateSave.BP_UPPlayerStateSave_C
// 0x0030 (0x0058 - 0x0028)
class UBP_UPPlayerStateSave_C final : public USaveGame
{
public:
	int64                                         SteamID;                                           // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 PlayerName;                                        // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	E_PlayerAvatar                                PlayerAvatar;                                      // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDead;                                            // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_InventoryItemSave>           Inventory;                                         // 0x0048(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UPPlayerStateSave_C">();
	}
	static class UBP_UPPlayerStateSave_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UPPlayerStateSave_C>();
	}
};
static_assert(alignof(UBP_UPPlayerStateSave_C) == 0x000008, "Wrong alignment on UBP_UPPlayerStateSave_C");
static_assert(sizeof(UBP_UPPlayerStateSave_C) == 0x000058, "Wrong size on UBP_UPPlayerStateSave_C");
static_assert(offsetof(UBP_UPPlayerStateSave_C, SteamID) == 0x000028, "Member 'UBP_UPPlayerStateSave_C::SteamID' has a wrong offset!");
static_assert(offsetof(UBP_UPPlayerStateSave_C, PlayerName) == 0x000030, "Member 'UBP_UPPlayerStateSave_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UBP_UPPlayerStateSave_C, PlayerAvatar) == 0x000040, "Member 'UBP_UPPlayerStateSave_C::PlayerAvatar' has a wrong offset!");
static_assert(offsetof(UBP_UPPlayerStateSave_C, IsDead) == 0x000041, "Member 'UBP_UPPlayerStateSave_C::IsDead' has a wrong offset!");
static_assert(offsetof(UBP_UPPlayerStateSave_C, Inventory) == 0x000048, "Member 'UBP_UPPlayerStateSave_C::Inventory' has a wrong offset!");

}

