#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UPPlayerController

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_UPPlayerController.BP_UPPlayerController_C.AddHudWidget
// 0x0028 (0x0028 - 0x0000)
struct BP_UPPlayerController_C_AddHudWidget final
{
public:
	class UClass*                                 WidgetClass;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Priority;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Widget;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_HudParent_C*                         CallFunc_GetHudParent_HudParent;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_AddHudWidget_Widget;                      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPPlayerController_C_AddHudWidget) == 0x000008, "Wrong alignment on BP_UPPlayerController_C_AddHudWidget");
static_assert(sizeof(BP_UPPlayerController_C_AddHudWidget) == 0x000028, "Wrong size on BP_UPPlayerController_C_AddHudWidget");
static_assert(offsetof(BP_UPPlayerController_C_AddHudWidget, WidgetClass) == 0x000000, "Member 'BP_UPPlayerController_C_AddHudWidget::WidgetClass' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_AddHudWidget, Priority) == 0x000008, "Member 'BP_UPPlayerController_C_AddHudWidget::Priority' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_AddHudWidget, Widget) == 0x000010, "Member 'BP_UPPlayerController_C_AddHudWidget::Widget' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_AddHudWidget, CallFunc_GetHudParent_HudParent) == 0x000018, "Member 'BP_UPPlayerController_C_AddHudWidget::CallFunc_GetHudParent_HudParent' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_AddHudWidget, CallFunc_AddHudWidget_Widget) == 0x000020, "Member 'BP_UPPlayerController_C_AddHudWidget::CallFunc_AddHudWidget_Widget' has a wrong offset!");

// Function BP_UPPlayerController.BP_UPPlayerController_C.AskForCapture
// 0x0004 (0x0004 - 0x0000)
struct BP_UPPlayerController_C_AskForCapture final
{
public:
	int32                                         CaptureId;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPPlayerController_C_AskForCapture) == 0x000004, "Wrong alignment on BP_UPPlayerController_C_AskForCapture");
static_assert(sizeof(BP_UPPlayerController_C_AskForCapture) == 0x000004, "Wrong size on BP_UPPlayerController_C_AskForCapture");
static_assert(offsetof(BP_UPPlayerController_C_AskForCapture, CaptureId) == 0x000000, "Member 'BP_UPPlayerController_C_AskForCapture::CaptureId' has a wrong offset!");

// Function BP_UPPlayerController.BP_UPPlayerController_C.CheckSteamId
// 0x0018 (0x0018 - 0x0000)
struct BP_UPPlayerController_C_CheckSteamId final
{
public:
	bool                                          IsValid;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         SteamID_0;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_Int64Int64_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPPlayerController_C_CheckSteamId) == 0x000008, "Wrong alignment on BP_UPPlayerController_C_CheckSteamId");
static_assert(sizeof(BP_UPPlayerController_C_CheckSteamId) == 0x000018, "Wrong size on BP_UPPlayerController_C_CheckSteamId");
static_assert(offsetof(BP_UPPlayerController_C_CheckSteamId, IsValid) == 0x000000, "Member 'BP_UPPlayerController_C_CheckSteamId::IsValid' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_CheckSteamId, SteamID_0) == 0x000008, "Member 'BP_UPPlayerController_C_CheckSteamId::SteamID_0' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_CheckSteamId, CallFunc_GreaterEqual_Int64Int64_ReturnValue) == 0x000010, "Member 'BP_UPPlayerController_C_CheckSteamId::CallFunc_GreaterEqual_Int64Int64_ReturnValue' has a wrong offset!");

// Function BP_UPPlayerController.BP_UPPlayerController_C.CreateCaptureRequest
// 0x0004 (0x0004 - 0x0000)
struct BP_UPPlayerController_C_CreateCaptureRequest final
{
public:
	int32                                         CaptureId;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPPlayerController_C_CreateCaptureRequest) == 0x000004, "Wrong alignment on BP_UPPlayerController_C_CreateCaptureRequest");
static_assert(sizeof(BP_UPPlayerController_C_CreateCaptureRequest) == 0x000004, "Wrong size on BP_UPPlayerController_C_CreateCaptureRequest");
static_assert(offsetof(BP_UPPlayerController_C_CreateCaptureRequest, CaptureId) == 0x000000, "Member 'BP_UPPlayerController_C_CreateCaptureRequest::CaptureId' has a wrong offset!");

// Function BP_UPPlayerController.BP_UPPlayerController_C.ExecuteUbergraph_BP_UPPlayerController
// 0x07E0 (0x07E0 - 0x0000)
struct BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FVector2D& Size, double Ratio)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_CaptureId_1;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_CaptureId;                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CaptureRequest_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_VoiceChat_C*                        CallFunc_GetActorOfClass_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerCharacter_C*                CallFunc_FindDeadPlayerWithId_Player;              // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCameraShakeBase>           K2Node_CustomEvent_ShakeClass;                     // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Scale;                          // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_CameraShakeIndex_1;             // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraShakeBase*                       CallFunc_StartCameraShake_ReturnValue;             // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_CameraShakeIndex;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraShakeBase*                       CallFunc_Map_Find_Value;                           // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_CustomEvent_Size;                           // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Ratio;                          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUPGameViewportClient*                  CallFunc_GetViewportClient_ReturnValue;            // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_UPGameViewportClient_C*             K2Node_DynamicCast_AsBP_UPGame_Viewport_Client;    // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable;                              // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0190(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x01B8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUPGameViewportClient*                  CallFunc_GetViewportClient_ReturnValue_1;          // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameViewportClient_C*             K2Node_DynamicCast_AsBP_UPGame_Viewport_Client_1;  // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputMappingContext*             K2Node_CustomEvent_MappingContext;                 // 0x0208(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Priority;                       // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enabled;                        // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0218(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_1;                        // 0x0230(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_2;                        // 0x0248(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_3;                        // 0x0260(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_4;                        // 0x0278(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_5;                        // 0x0290(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_6;                        // 0x02A8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_7;                        // 0x02C0(0x0018)(HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_1;                            // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_VoiceChat_C*                        CallFunc_GetActorOfClass_ReturnValue_1;            // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_8;                        // 0x02E8(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsMicrophoneMuted_Muted;               // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0302(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_303[0x5];                                      // 0x0303(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_9;                        // 0x0308(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsUsingGamepad;                 // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x0328(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x0350(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_InputVectorAxisEvent_AxisValue;             // 0x0358(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue;        // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3_0;                            // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_10;                       // 0x0390(0x0018)(HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_3;     // 0x03A8(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_3;     // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_3;   // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_3;    // 0x03D0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_4;     // 0x03D8(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_4;     // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_4;   // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_4;    // 0x0400(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_1;                            // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_2; // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3_2;                            // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_3; // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Visible;                        // 0x0431(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInLobby_InLobby;                        // 0x0432(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_433[0x5];                                      // 0x0433(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_MainMenu_C*                          CallFunc_Create_ReturnValue;                       // 0x0438(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInLobby_InLobby_1;                      // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0442(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_443[0x5];                                      // 0x0443(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_GamepadFocusHighlight_C*             CallFunc_Create_ReturnValue_1;                     // 0x0448(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_PlayerName_1;                   // 0x0450(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowPlayerNotification_Result;      // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0468(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0480(0x0050)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_11;                       // 0x04D0(0x0018)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x04E8(0x0010)(ReferenceParm)
	class FString                                 K2Node_CustomEvent_PlayerName;                     // 0x04F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0508(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0520(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0538(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0548(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0598(0x0010)(ReferenceParm)
	bool                                          CallFunc_ShouldShowPlayerNotification_Result_1;    // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A9[0x7];                                      // 0x05A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x05B0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x05C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x05D8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x05F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int64                                         K2Node_CustomEvent_SteamId;                        // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSteamId_IsValid;                       // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_609[0x7];                                      // 0x0609(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_GetSteamId_SteamId;                       // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue;      // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_619[0x7];                                      // 0x0619(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_12;                       // 0x0620(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_13;                       // 0x0638(0x0018)(HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0650(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance;           // 0x0658(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_PossessedPawn;                        // 0x0668(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerCharacter_C*                K2Node_DynamicCast_AsBP_UPPlayer_Character;        // 0x0670(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_679[0x7];                                      // 0x0679(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_14;                       // 0x0680(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_15;                       // 0x0698(0x0018)(HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x06B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPGameMode_C*                       K2Node_DynamicCast_AsBP_UPGame_Mode;               // 0x06B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x06C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C2[0x6];                                      // 0x06C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_4;                              // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x06D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x06E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E9[0x7];                                      // 0x06E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPGameMode_C*                       K2Node_DynamicCast_AsBP_UPGame_Mode_1;             // 0x06F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F9[0x7];                                      // 0x06F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_2;                            // 0x0700(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0708(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0728(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x072C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0730(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0738(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance_1;         // 0x0740(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0748(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_749[0x7];                                      // 0x0749(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_5_0;                            // 0x0750(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInSession_InSession;                    // 0x0758(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_759[0x7];                                      // 0x0759(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_4_0;                            // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_4; // 0x0768(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_769[0x7];                                      // 0x0769(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                K2Node_CustomEvent_DeadPlayer;                     // 0x0770(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0778(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerCharacter_C*                K2Node_DynamicCast_AsBP_UPPlayer_Character_1;      // 0x0780(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FModifyContextOptions                  Temp_struct_Variable;                              // 0x0789(0x0001)(ConstParm, NoDestructor)
	uint8                                         Pad_78A[0x6];                                      // 0x078A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnhancedInputLocalPlayerSubsystem*     CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0790(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_HasMappingContext_self_CastInput; // 0x0798(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_HasMappingContext_OutFoundPriority;       // 0x07A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMappingContext_ReturnValue;            // 0x07AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7AD[0x3];                                      // 0x07AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_RemoveMappingContext_self_CastInput; // 0x07B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x07C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FModifyContextOptions                  Temp_struct_Variable_1;                            // 0x07C2(0x0001)(ConstParm, NoDestructor)
	uint8                                         Pad_7C3[0x5];                                      // 0x07C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_AddMappingContext_self_CastInput; // 0x07C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController) == 0x000010, "Wrong alignment on BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController");
static_assert(sizeof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController) == 0x0007E0, "Wrong size on BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, EntryPoint) == 0x000000, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, CallFunc_HasAuthority_ReturnValue_1) == 0x000005, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_CustomEvent_CaptureId_1) == 0x000018, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_CustomEvent_CaptureId_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_CustomEvent_CaptureId) == 0x00001C, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_CustomEvent_CaptureId' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000080, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_CreateDelegate_OutputDelegate_1) == 0x000088, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, CallFunc_FinishSpawningActor_ReturnValue) == 0x000098, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, CallFunc_GetActorOfClass_ReturnValue) == 0x0000A0, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000AC, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, Temp_bool_Variable) == 0x0000BC, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000C0, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, CallFunc_IsValid_ReturnValue_1) == 0x0000C8, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, Temp_real_Variable) == 0x0000D0, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, CallFunc_FindDeadPlayerWithId_Player) == 0x0000D8, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::CallFunc_FindDeadPlayerWithId_Player' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, CallFunc_IsValid_ReturnValue_2) == 0x0000E0, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, CallFunc_IsValid_ReturnValue_3) == 0x0000E1, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_CustomEvent_ShakeClass) == 0x0000E8, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_CustomEvent_ShakeClass' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_CustomEvent_Scale) == 0x0000F0, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_CustomEvent_Scale' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_CustomEvent_CameraShakeIndex_1) == 0x0000F4, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_CustomEvent_CameraShakeIndex_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, CallFunc_StartCameraShake_ReturnValue) == 0x0000F8, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::CallFunc_StartCameraShake_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_CustomEvent_CameraShakeIndex) == 0x000100, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_CustomEvent_CameraShakeIndex' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, CallFunc_Map_Find_Value) == 0x000108, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, CallFunc_Map_Find_ReturnValue) == 0x000110, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, CallFunc_IsValid_ReturnValue_4) == 0x000111, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_CustomEvent_Size) == 0x000118, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_CustomEvent_Size' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_CustomEvent_Ratio) == 0x000128, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_CustomEvent_Ratio' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, CallFunc_BreakVector2D_X) == 0x000130, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, CallFunc_BreakVector2D_Y) == 0x000138, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000140, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, CallFunc_GetViewportClient_ReturnValue) == 0x000148, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::CallFunc_GetViewportClient_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, Temp_bool_Variable_1) == 0x000150, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_DynamicCast_AsBP_UPGame_Viewport_Client) == 0x000158, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_DynamicCast_AsBP_UPGame_Viewport_Client' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, Temp_real_Variable_1) == 0x000168, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, Temp_real_Variable_2) == 0x000170, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, Temp_real_Variable_3) == 0x000178, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, CallFunc_IsValid_ReturnValue_5) == 0x000180, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, Temp_object_Variable) == 0x000188, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000190, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x0001B0, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x0001B4, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_EnhancedInputActionEvent_SourceAction) == 0x0001B8, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, Temp_real_Variable_2_0) == 0x0001C0, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, Temp_real_Variable_1_0) == 0x0001C8, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x0001D0, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, CallFunc_GetViewportClient_ReturnValue_1) == 0x0001D8, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::CallFunc_GetViewportClient_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_DynamicCast_AsBP_UPGame_Viewport_Client_1) == 0x0001E0, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_DynamicCast_AsBP_UPGame_Viewport_Client_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_DynamicCast_bSuccess_1) == 0x0001E8, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, CallFunc_SelectFloat_ReturnValue) == 0x0001F0, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0001F8, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000200, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_CustomEvent_MappingContext) == 0x000208, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_CustomEvent_MappingContext' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_CustomEvent_Priority) == 0x000210, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_CustomEvent_Priority' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_CustomEvent_Enabled) == 0x000214, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_CustomEvent_Enabled' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_InputKeyEvent_Key) == 0x000218, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_InputKeyEvent_Key_1) == 0x000230, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_InputKeyEvent_Key_1' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_InputKeyEvent_Key_2) == 0x000248, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_InputKeyEvent_Key_2' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_InputKeyEvent_Key_3) == 0x000260, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_InputKeyEvent_Key_3' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_InputKeyEvent_Key_4) == 0x000278, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_InputKeyEvent_Key_4' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_InputKeyEvent_Key_5) == 0x000290, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_InputKeyEvent_Key_5' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_InputKeyEvent_Key_6) == 0x0002A8, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_InputKeyEvent_Key_6' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, K2Node_InputKeyEvent_Key_7) == 0x0002C0, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::K2Node_InputKeyEvent_Key_7' has a wrong offset!");
static_assert(offsetof(BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController, Temp_object_Variable_1) == 0x0002D8, "Member 'BP_UPPlayerController_C_ExecuteUbergraph_BP_UPPlayerController::Temp_object_Variable_1' has a wrong offset!");
