#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UPGameInstance

#include "Basic.hpp"

#include "SteamIntegrationKit_structs.hpp"
#include "S_InventoryItem_structs.hpp"
#include "BlueprintJson_structs.hpp"
#include "S_InventoryItemSave_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "E_AntiAliasingMethod_structs.hpp"
#include "S_FindSessionsResult_structs.hpp"
#include "S_OnlineSession_structs.hpp"
#include "E_Dismemberment_structs.hpp"
#include "E_DeathType_structs.hpp"


namespace SDK::Params
{

// Function BP_UPGameInstance.BP_UPGameInstance_C.AddRequestLobbyCustomGamesFilter
// 0x0001 (0x0001 - 0x0000)
struct BP_UPGameInstance_C_AddRequestLobbyCustomGamesFilter final
{
public:
	bool                                          IncludeCustomGames;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPGameInstance_C_AddRequestLobbyCustomGamesFilter) == 0x000001, "Wrong alignment on BP_UPGameInstance_C_AddRequestLobbyCustomGamesFilter");
static_assert(sizeof(BP_UPGameInstance_C_AddRequestLobbyCustomGamesFilter) == 0x000001, "Wrong size on BP_UPGameInstance_C_AddRequestLobbyCustomGamesFilter");
static_assert(offsetof(BP_UPGameInstance_C_AddRequestLobbyCustomGamesFilter, IncludeCustomGames) == 0x000000, "Member 'BP_UPGameInstance_C_AddRequestLobbyCustomGamesFilter::IncludeCustomGames' has a wrong offset!");

// Function BP_UPGameInstance.BP_UPGameInstance_C.ApplyAntiAliasingMethod
// 0x0038 (0x0038 - 0x0000)
struct BP_UPGameInstance_C_ApplyAntiAliasingMethod final
{
public:
	E_AntiAliasingMethod                          Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPGameInstance_C_ApplyAntiAliasingMethod) == 0x000008, "Wrong alignment on BP_UPGameInstance_C_ApplyAntiAliasingMethod");
static_assert(sizeof(BP_UPGameInstance_C_ApplyAntiAliasingMethod) == 0x000038, "Wrong size on BP_UPGameInstance_C_ApplyAntiAliasingMethod");
static_assert(offsetof(BP_UPGameInstance_C_ApplyAntiAliasingMethod, Temp_byte_Variable) == 0x000000, "Member 'BP_UPGameInstance_C_ApplyAntiAliasingMethod::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_ApplyAntiAliasingMethod, Temp_int_Variable) == 0x000004, "Member 'BP_UPGameInstance_C_ApplyAntiAliasingMethod::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_ApplyAntiAliasingMethod, Temp_int_Variable_1) == 0x000008, "Member 'BP_UPGameInstance_C_ApplyAntiAliasingMethod::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_ApplyAntiAliasingMethod, Temp_int_Variable_2) == 0x00000C, "Member 'BP_UPGameInstance_C_ApplyAntiAliasingMethod::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_ApplyAntiAliasingMethod, Temp_int_Variable_3) == 0x000010, "Member 'BP_UPGameInstance_C_ApplyAntiAliasingMethod::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_ApplyAntiAliasingMethod, K2Node_Select_Default) == 0x000014, "Member 'BP_UPGameInstance_C_ApplyAntiAliasingMethod::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_ApplyAntiAliasingMethod, CallFunc_Conv_IntToString_ReturnValue) == 0x000018, "Member 'BP_UPGameInstance_C_ApplyAntiAliasingMethod::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_ApplyAntiAliasingMethod, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'BP_UPGameInstance_C_ApplyAntiAliasingMethod::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function BP_UPGameInstance.BP_UPGameInstance_C.ApplyRenderScale
// 0x0048 (0x0048 - 0x0000)
struct BP_UPGameInstance_C_ApplyRenderScale final
{
public:
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPGameInstance_C_ApplyRenderScale) == 0x000008, "Wrong alignment on BP_UPGameInstance_C_ApplyRenderScale");
static_assert(sizeof(BP_UPGameInstance_C_ApplyRenderScale) == 0x000048, "Wrong size on BP_UPGameInstance_C_ApplyRenderScale");
static_assert(offsetof(BP_UPGameInstance_C_ApplyRenderScale, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000000, "Member 'BP_UPGameInstance_C_ApplyRenderScale::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_ApplyRenderScale, CallFunc_Round_ReturnValue) == 0x000008, "Member 'BP_UPGameInstance_C_ApplyRenderScale::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_ApplyRenderScale, CallFunc_Clamp_ReturnValue) == 0x00000C, "Member 'BP_UPGameInstance_C_ApplyRenderScale::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_ApplyRenderScale, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'BP_UPGameInstance_C_ApplyRenderScale::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_ApplyRenderScale, CallFunc_Conv_TextToString_ReturnValue) == 0x000028, "Member 'BP_UPGameInstance_C_ApplyRenderScale::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_ApplyRenderScale, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'BP_UPGameInstance_C_ApplyRenderScale::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function BP_UPGameInstance.BP_UPGameInstance_C.CheckSessionName
// 0x0028 (0x0028 - 0x0000)
struct BP_UPGameInstance_C_CheckSessionName final
{
public:
	class FString                                 InSessionName;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 OutSessionName;                                    // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPGameInstance_C_CheckSessionName) == 0x000008, "Wrong alignment on BP_UPGameInstance_C_CheckSessionName");
static_assert(sizeof(BP_UPGameInstance_C_CheckSessionName) == 0x000028, "Wrong size on BP_UPGameInstance_C_CheckSessionName");
static_assert(offsetof(BP_UPGameInstance_C_CheckSessionName, InSessionName) == 0x000000, "Member 'BP_UPGameInstance_C_CheckSessionName::InSessionName' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_CheckSessionName, OutSessionName) == 0x000010, "Member 'BP_UPGameInstance_C_CheckSessionName::OutSessionName' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_CheckSessionName, CallFunc_IsEmpty_ReturnValue) == 0x000020, "Member 'BP_UPGameInstance_C_CheckSessionName::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");

// Function BP_UPGameInstance.BP_UPGameInstance_C.ClearCameroidTextures
// 0x0001 (0x0001 - 0x0000)
struct BP_UPGameInstance_C_ClearCameroidTextures final
{
public:
	bool                                          IsPrivate;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPGameInstance_C_ClearCameroidTextures) == 0x000001, "Wrong alignment on BP_UPGameInstance_C_ClearCameroidTextures");
static_assert(sizeof(BP_UPGameInstance_C_ClearCameroidTextures) == 0x000001, "Wrong size on BP_UPGameInstance_C_ClearCameroidTextures");
static_assert(offsetof(BP_UPGameInstance_C_ClearCameroidTextures, IsPrivate) == 0x000000, "Member 'BP_UPGameInstance_C_ClearCameroidTextures::IsPrivate' has a wrong offset!");

// Function BP_UPGameInstance.BP_UPGameInstance_C.ClearItemSave
// 0x0020 (0x0020 - 0x0000)
struct BP_UPGameInstance_C_ClearItemSave final
{
public:
	int32                                         ItemId;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetInventoryItemSaveSlot_Slot;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DeleteGameInSlot_ReturnValue;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPGameInstance_C_ClearItemSave) == 0x000008, "Wrong alignment on BP_UPGameInstance_C_ClearItemSave");
static_assert(sizeof(BP_UPGameInstance_C_ClearItemSave) == 0x000020, "Wrong size on BP_UPGameInstance_C_ClearItemSave");
static_assert(offsetof(BP_UPGameInstance_C_ClearItemSave, ItemId) == 0x000000, "Member 'BP_UPGameInstance_C_ClearItemSave::ItemId' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_ClearItemSave, CallFunc_GetInventoryItemSaveSlot_Slot) == 0x000008, "Member 'BP_UPGameInstance_C_ClearItemSave::CallFunc_GetInventoryItemSaveSlot_Slot' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_ClearItemSave, CallFunc_DoesSaveGameExist_ReturnValue) == 0x000018, "Member 'BP_UPGameInstance_C_ClearItemSave::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_ClearItemSave, CallFunc_DeleteGameInSlot_ReturnValue) == 0x000019, "Member 'BP_UPGameInstance_C_ClearItemSave::CallFunc_DeleteGameInSlot_ReturnValue' has a wrong offset!");

// Function BP_UPGameInstance.BP_UPGameInstance_C.DeleteSavedSession
// 0x0078 (0x0078 - 0x0000)
struct BP_UPGameInstance_C_DeleteSavedSession final
{
public:
	int32                                         SessionSlot_0;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 _SlotPrefix;                                       // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetAllSaveFileNames_ReturnValue;          // 0x0048(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DeleteGameInSlot_ReturnValue;             // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartsWith_ReturnValue;                   // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPGameInstance_C_DeleteSavedSession) == 0x000008, "Wrong alignment on BP_UPGameInstance_C_DeleteSavedSession");
static_assert(sizeof(BP_UPGameInstance_C_DeleteSavedSession) == 0x000078, "Wrong size on BP_UPGameInstance_C_DeleteSavedSession");
static_assert(offsetof(BP_UPGameInstance_C_DeleteSavedSession, SessionSlot_0) == 0x000000, "Member 'BP_UPGameInstance_C_DeleteSavedSession::SessionSlot_0' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_DeleteSavedSession, _SlotPrefix) == 0x000008, "Member 'BP_UPGameInstance_C_DeleteSavedSession::_SlotPrefix' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_DeleteSavedSession, CallFunc_Conv_IntToString_ReturnValue) == 0x000018, "Member 'BP_UPGameInstance_C_DeleteSavedSession::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_DeleteSavedSession, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_UPGameInstance_C_DeleteSavedSession::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_DeleteSavedSession, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'BP_UPGameInstance_C_DeleteSavedSession::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_DeleteSavedSession, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'BP_UPGameInstance_C_DeleteSavedSession::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_DeleteSavedSession, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BP_UPGameInstance_C_DeleteSavedSession::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_DeleteSavedSession, CallFunc_GetAllSaveFileNames_ReturnValue) == 0x000048, "Member 'BP_UPGameInstance_C_DeleteSavedSession::CallFunc_GetAllSaveFileNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_DeleteSavedSession, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_UPGameInstance_C_DeleteSavedSession::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_DeleteSavedSession, CallFunc_Array_Get_Item) == 0x000060, "Member 'BP_UPGameInstance_C_DeleteSavedSession::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_DeleteSavedSession, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'BP_UPGameInstance_C_DeleteSavedSession::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_DeleteSavedSession, CallFunc_DeleteGameInSlot_ReturnValue) == 0x000071, "Member 'BP_UPGameInstance_C_DeleteSavedSession::CallFunc_DeleteGameInSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_DeleteSavedSession, CallFunc_DoesSaveGameExist_ReturnValue) == 0x000072, "Member 'BP_UPGameInstance_C_DeleteSavedSession::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_DeleteSavedSession, CallFunc_StartsWith_ReturnValue) == 0x000073, "Member 'BP_UPGameInstance_C_DeleteSavedSession::CallFunc_StartsWith_ReturnValue' has a wrong offset!");

// Function BP_UPGameInstance.BP_UPGameInstance_C.DeleteTempSaveFiles
// 0x0040 (0x0040 - 0x0000)
struct BP_UPGameInstance_C_DeleteTempSaveFiles final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetAllSaveFileNames_ReturnValue;          // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DeleteGameInSlot_ReturnValue;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTempSaveFile_IsTemp;                    // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UPGameInstance_C_DeleteTempSaveFiles) == 0x000008, "Wrong alignment on BP_UPGameInstance_C_DeleteTempSaveFiles");
static_assert(sizeof(BP_UPGameInstance_C_DeleteTempSaveFiles) == 0x000040, "Wrong size on BP_UPGameInstance_C_DeleteTempSaveFiles");
static_assert(offsetof(BP_UPGameInstance_C_DeleteTempSaveFiles, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_UPGameInstance_C_DeleteTempSaveFiles::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_DeleteTempSaveFiles, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_UPGameInstance_C_DeleteTempSaveFiles::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_DeleteTempSaveFiles, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_UPGameInstance_C_DeleteTempSaveFiles::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_DeleteTempSaveFiles, CallFunc_GetAllSaveFileNames_ReturnValue) == 0x000010, "Member 'BP_UPGameInstance_C_DeleteTempSaveFiles::CallFunc_GetAllSaveFileNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_DeleteTempSaveFiles, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_UPGameInstance_C_DeleteTempSaveFiles::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_DeleteTempSaveFiles, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_UPGameInstance_C_DeleteTempSaveFiles::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_DeleteTempSaveFiles, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_UPGameInstance_C_DeleteTempSaveFiles::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_DeleteTempSaveFiles, CallFunc_DeleteGameInSlot_ReturnValue) == 0x000039, "Member 'BP_UPGameInstance_C_DeleteTempSaveFiles::CallFunc_DeleteGameInSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_DeleteTempSaveFiles, CallFunc_DoesSaveGameExist_ReturnValue) == 0x00003A, "Member 'BP_UPGameInstance_C_DeleteTempSaveFiles::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UPGameInstance_C_DeleteTempSaveFiles, CallFunc_IsTempSaveFile_IsTemp) == 0x00003B, "Member 'BP_UPGameInstance_C_DeleteTempSaveFiles::CallFunc_IsTempSaveFile_IsTemp' has a wrong offset!");

// Function BP_UPGameInstance.BP_UPGameInstance_C.ExecuteUbergraph_BP_UPGameInstance
// 0x1038 (0x1038 - 0x0000)
struct BP_UPGameInstance_C_ExecuteUbergraph_BP_UPGameInstance final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_MapName_2;                      // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Difficulty;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_CurrentPoints;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Objective;                      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_RemainingDays;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CustomGameConfig_C*                 CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsPrivate)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESIK_LobbyType                                Temp_byte_Variable;                                // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUPGameViewportClient*                  CallFunc_GetViewportClient_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESIK_LobbyType                                Temp_byte_Variable_1;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUPGameViewportClient*                  CallFunc_GetViewportClient_ReturnValue_1;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& UserId, const class FString& Username, const class FString& LoginMethod)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x1];                                       // 0x0093(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue_1;             // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_InputsSettings_C*                   CallFunc_CreateSaveGameObject_ReturnValue_1;       // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_InputsSettings_C*                   K2Node_DynamicCast_AsBP_Inputs_Settings;           // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Sensitivity;                    // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsUsingGamepad;                 // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESIK_LobbyType                                Temp_byte_Variable_2;                              // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InvertMouseX;                   // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InvertMouseY;                   // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_UserID;                         // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_UserName;                       // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_LoginMethod;                    // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FBlueprintJsonValue                    CallFunc_JsonMakeString_ReturnValue;               // 0x0100(0x0010)()
	bool                                          K2Node_CustomEvent_IsPrivate_3;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsPrivate_2;                    // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_1;          // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FBlueprintJsonValue                    CallFunc_JsonMakeString_ReturnValue_1;             // 0x0138(0x0010)()
	struct FBlueprintJsonValue                    CallFunc_JsonMakeString_ReturnValue_2;             // 0x0148(0x0010)()
	class ABP_UPPlayerCharacter_C*                K2Node_CustomEvent_Player_4;                       // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESIK_LobbyType                                Temp_byte_Variable_3;                              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            K2Node_MakeMap_Map;                                // 0x0168(0x0050)()
	class FString                                 K2Node_CustomEvent_EventName_1;                    // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FBlueprintJsonObject                   K2Node_CustomEvent_Event;                          // 0x01C8(0x0010)()
	class FString                                 K2Node_CustomEvent_EventName;                      // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TMap<class FString, struct FBlueprintJsonValue> K2Node_CustomEvent_Properties_1;                 // 0x01E8(0x0050)()
	bool                                          Temp_bool_Variable_2;                              // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESIK_LobbyType                                K2Node_Select_Default;                             // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23A[0x6];                                      // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue_1;           // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue_1;          // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CustomGameConfig_C*                 K2Node_DynamicCast_AsBP_Custom_Game_Config;        // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FBlueprintJsonValue> K2Node_CustomEvent_Properties;                   // 0x0260(0x0050)()
	TMap<class FString, class FString>            K2Node_MakeMap_Map_1;                              // 0x02B0(0x0050)()
	class FString                                 K2Node_CustomEvent_Key_1;                          // 0x0300(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Value_1;                        // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Key;                            // 0x0320(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Value;                          // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlueprintJsonValue                    CallFunc_JsonMakeString_ReturnValue_3;             // 0x0338(0x0010)()
	struct FBlueprintJsonValue                    CallFunc_JsonMakeInt_ReturnValue;                  // 0x0348(0x0010)()
	TMap<class FString, struct FBlueprintJsonValue> K2Node_MakeMap_Map_2;                            // 0x0358(0x0050)()
	TMap<class FString, struct FBlueprintJsonValue> K2Node_MakeMap_Map_3;                            // 0x03A8(0x0050)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x03F8(0x0018)()
	class UHostMigrationSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0410(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0418(0x0050)(HasGetValueTypeHash)
	TDelegate<void(bool IsPrivate)>               K2Node_CreateDelegate_OutputDelegate_3;            // 0x0468(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FSIK_SteamId& LobbyID, bool bLocalPlayerHost)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0478(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FBlueprintJsonObject                   CallFunc_MakeIdentification_Identification;        // 0x0488(0x0010)()
	class FString                                 CallFunc_Conv_JsonObjectToString_ReturnValue;      // 0x0498(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FBlueprintJsonObject                   CallFunc_MakeAnalyticsEvent_Event;                 // 0x04A8(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x04B8(0x0018)()
	struct FBlueprintJsonObject                   CallFunc_AddEventProperties_OutEvent;              // 0x04D0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x04E0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0530(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0540(0x0018)()
	struct FBlueprintJsonObject                   CallFunc_MakeAnalyticsBody_Body;                   // 0x0558(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0568(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendRestfulRequest_success;               // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579[0x3];                                      // 0x0579(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SendRestfulRequest_responseCode;          // 0x057C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SendRestfulRequest_data;                  // 0x0580(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TMap<class FString, class FString>            CallFunc_SendRestfulRequest_responseHeaders;       // 0x0590(0x0050)()
	struct FBlueprintJsonObject                   CallFunc_MakeAnalyticsEvent_Event_1;               // 0x05E0(0x0010)()
	bool                                          CallFunc_GetCurrentMapType_InLobby;                // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCurrentMapType_InResult;               // 0x05F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F2[0x6];                                      // 0x05F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x05F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPGameState_C*                      K2Node_DynamicCast_AsBP_UPGame_State;              // 0x0600(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasInSession_Result;                      // 0x0609(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60A[0x6];                                      // 0x060A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_2;          // 0x0610(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0620(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TMap<class FString, struct FBlueprintJsonValue> CallFunc_MakeStringEventProperty_Properties;     // 0x0630(0x0050)()
	struct FBlueprintJsonValue                    CallFunc_JsonMakeString_ReturnValue_4;             // 0x0680(0x0010)()
	class ABP_UPPlayerCharacter_C*                K2Node_CustomEvent_Player_3;                       // 0x0690(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_KillableCharacter_C*                K2Node_CustomEvent_KilledCharacter;                // 0x0698(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Killer;                         // 0x06A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x06A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A9[0x7];                                      // 0x06A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x06B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x06B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UHostMigrationSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x06C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FBlueprintJsonValue                    CallFunc_JsonMakeString_ReturnValue_5;             // 0x06D0(0x0010)()
	int32                                         K2Node_CustomEvent_Damage;                         // 0x06E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Ragdoll;                        // 0x06E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E5[0x3];                                      // 0x06E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_SourceLocation;                 // 0x06E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Force;                          // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Dismemberment                               K2Node_CustomEvent_Dismemberment;                  // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_DeathType                                   K2Node_CustomEvent_DeathType;                      // 0x0709(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_70A[0x6];                                      // 0x070A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Attacker;                       // 0x0710(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_719[0x3];                                      // 0x0719(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FSIK_SteamId& SteamID, const struct FSIK_SteamId& LobbyID)> K2Node_CreateDelegate_OutputDelegate_5; // 0x071C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72C[0x4];                                      // 0x072C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0730(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USIK_FriendsSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0738(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue_1;        // 0x0740(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TMap<class FString, struct FBlueprintJsonValue> CallFunc_MakeStringEventProperty_Properties_1;   // 0x0750(0x0050)()
	class ABP_UPGameSession_C*                    CallFunc_GetGameSession_GameSession;               // 0x07A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESIK_Result                                   Temp_byte_Variable_4;                              // 0x07A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x07A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x07AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7AB[0x5];                                      // 0x07AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPGameSession_C*                    K2Node_CustomEvent_GameSession;                    // 0x07B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESIK_ChatRoomEnterResponse                    Temp_byte_Variable_5;                              // 0x07B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B9[0x3];                                      // 0x07B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSessionElapsedDuration_Duration;       // 0x07BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerDead_IsDead;                 // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C1[0x7];                                      // 0x07C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlueprintJsonValue                    CallFunc_JsonMakeInt_ReturnValue_1;                // 0x07C8(0x0010)()
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_3;          // 0x07D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FBlueprintJsonValue                    CallFunc_JsonMakeString_ReturnValue_6;             // 0x07E8(0x0010)()
	ESIK_Result                                   K2Node_CustomEvent_Result;                         // 0x07F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bLocked;                        // 0x07F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESIK_ChatRoomEnterResponse                    K2Node_CustomEvent_ChatRoomEnterResponse;          // 0x07FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7FB[0x5];                                      // 0x07FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                K2Node_CustomEvent_Player_2;                       // 0x0800(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESIK_Result Result, bool bLocked, ESIK_ChatRoomEnterResponse ChatRoomEnterResponse)> K2Node_CreateDelegate_OutputDelegate_6; // 0x0808(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESIK_Result                                   K2Node_CustomEvent_Result_1;                       // 0x0818(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bLocked_1;                      // 0x0819(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESIK_ChatRoomEnterResponse                    K2Node_CustomEvent_ChatRoomEnterResponse_1;        // 0x081A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81B[0x5];                                      // 0x081B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Episodes_C*                         CallFunc_GetActorOfClass_ReturnValue;              // 0x0820(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0828(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_829[0x3];                                      // 0x0829(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ESIK_Result Result, bool bLocked, ESIK_ChatRoomEnterResponse ChatRoomEnterResponse)> K2Node_CreateDelegate_OutputDelegate_7; // 0x082C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83C[0x4];                                      // 0x083C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Episodes_C*                         K2Node_CustomEvent_Episodes;                       // 0x0840(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetResultsDetails_Score;                  // 0x0848(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetResultsDetails_Difficulty;             // 0x084C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetResultsDetails_IsSuccess;              // 0x0850(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetResultsDetails_IsFailed;               // 0x0851(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_852[0x6];                                      // 0x0852(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_4;          // 0x0858(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_5;          // 0x0868(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FBlueprintJsonValue                    CallFunc_JsonMakeString_ReturnValue_7;             // 0x0878(0x0010)()
	struct FBlueprintJsonValue                    CallFunc_JsonMakeString_ReturnValue_8;             // 0x0888(0x0010)()
	struct FBlueprintJsonValue                    CallFunc_JsonMakeInt_ReturnValue_2;                // 0x0898(0x0010)()
	struct FBlueprintJsonValue                    CallFunc_JsonMakeInt_ReturnValue_3;                // 0x08A8(0x0010)()
	class ABP_UPGameSession_C*                    CallFunc_GetGameSession_GameSession_1;             // 0x08B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSessionElapsedDuration_Duration_1;     // 0x08C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C4[0x4];                                      // 0x08C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlueprintJsonValue                    CallFunc_JsonMakeInt_ReturnValue_4;                // 0x08C8(0x0010)()
	TMap<class FString, struct FBlueprintJsonValue> K2Node_MakeMap_Map_4;                            // 0x08D8(0x0050)()
	bool                                          CallFunc_PullPendingEvents_HasEvents;              // 0x0928(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_929[0x7];                                      // 0x0929(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBlueprintJsonValue>            CallFunc_PullPendingEvents_EventsArray;            // 0x0930(0x0010)(ReferenceParm)
	struct FBlueprintJsonValue                    CallFunc_JsonMakeArray_ReturnValue;                // 0x0940(0x0010)()
	struct FBlueprintJsonObject                   CallFunc_JsonMakeField_ReturnValue;                // 0x0950(0x0010)(ConstParm)
	class FString                                 CallFunc_Conv_JsonObjectToString_ReturnValue_1;    // 0x0960(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0970(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendRestfulRequest_success_1;             // 0x0974(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_975[0x3];                                      // 0x0975(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SendRestfulRequest_responseCode_1;        // 0x0978(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_97C[0x4];                                      // 0x097C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SendRestfulRequest_data_1;                // 0x0980(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TMap<class FString, class FString>            CallFunc_SendRestfulRequest_responseHeaders_1;     // 0x0990(0x0050)()
	int32                                         CallFunc_GetPlayersCount_PlayersCount;             // 0x09E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayersCount_PlayersCount_1;           // 0x09E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBlueprintJsonValue                    CallFunc_JsonMakeInt_ReturnValue_5;                // 0x09E8(0x0010)()
	struct FBlueprintJsonValue                    CallFunc_JsonMakeInt_ReturnValue_6;                // 0x09F8(0x0010)()
	int32                                         CallFunc_GetPlayersCount_PlayersCount_2;           // 0x0A08(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A0C[0x4];                                      // 0x0A0C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FBlueprintJsonValue> K2Node_MakeMap_Map_5;                            // 0x0A10(0x0050)()
	struct FBlueprintJsonValue                    CallFunc_JsonMakeInt_ReturnValue_7;                // 0x0A60(0x0010)()
	TMap<class FString, struct FBlueprintJsonValue> K2Node_MakeMap_Map_6;                            // 0x0A70(0x0050)()
	class FString                                 CallFunc_GetProjectVersion_ReturnValue;            // 0x0AC0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FBlueprintJsonValue                    CallFunc_JsonMakeString_ReturnValue_9;             // 0x0AD0(0x0010)()
	int32                                         CallFunc_GetSessionDifficulty_Difficulty;          // 0x0AE0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE4[0x4];                                      // 0x0AE4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FBlueprintJsonValue> K2Node_MakeMap_Map_7;                            // 0x0AE8(0x0050)()
	struct FBlueprintJsonValue                    CallFunc_JsonMakeInt_ReturnValue_8;                // 0x0B38(0x0010)()
	TMap<class FString, struct FBlueprintJsonValue> K2Node_MakeMap_Map_8;                            // 0x0B48(0x0050)()
	class USIK_RequestLobbyList_AsyncFunction*    CallFunc_RequestLobbyList_ReturnValue;             // 0x0B98(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0BA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA1[0x3];                                      // 0x0BA1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0BA4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBlueprintJsonValue                    CallFunc_JsonMakeString_ReturnValue_10;            // 0x0BA8(0x0010)()
	struct FBlueprintJsonValue                    CallFunc_JsonMakeString_ReturnValue_11;            // 0x0BB8(0x0010)()
	TMap<class FString, struct FBlueprintJsonValue> K2Node_MakeMap_Map_9;                            // 0x0BC8(0x0050)()
	TMap<class FString, struct FBlueprintJsonValue> K2Node_MakeMap_Map_10;                           // 0x0C18(0x0050)()
	ESIK_LobbyDistanceFilter                      K2Node_CustomEvent_DistanceFilter;                 // 0x0C68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IncludeCustomGames;             // 0x0C69(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6A[0x6];                                      // 0x0C6A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
