#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VoiceChatSave

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VoiceChatSave.BP_VoiceChatSave_C
// 0x0028 (0x0050 - 0x0028)
class UBP_VoiceChatSave_C final : public USaveGame
{
public:
	bool                                          PushToTalk;                                        // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMicrophoneMuted;                                 // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PreferedCaptureDevice;                             // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	double                                        CaptureVolumeMultiplier;                           // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PlaybackVolumeMultiplier;                          // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VoiceChatSave_C">();
	}
	static class UBP_VoiceChatSave_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_VoiceChatSave_C>();
	}
};
static_assert(alignof(UBP_VoiceChatSave_C) == 0x000008, "Wrong alignment on UBP_VoiceChatSave_C");
static_assert(sizeof(UBP_VoiceChatSave_C) == 0x000050, "Wrong size on UBP_VoiceChatSave_C");
static_assert(offsetof(UBP_VoiceChatSave_C, PushToTalk) == 0x000028, "Member 'UBP_VoiceChatSave_C::PushToTalk' has a wrong offset!");
static_assert(offsetof(UBP_VoiceChatSave_C, IsMicrophoneMuted) == 0x000029, "Member 'UBP_VoiceChatSave_C::IsMicrophoneMuted' has a wrong offset!");
static_assert(offsetof(UBP_VoiceChatSave_C, PreferedCaptureDevice) == 0x000030, "Member 'UBP_VoiceChatSave_C::PreferedCaptureDevice' has a wrong offset!");
static_assert(offsetof(UBP_VoiceChatSave_C, CaptureVolumeMultiplier) == 0x000040, "Member 'UBP_VoiceChatSave_C::CaptureVolumeMultiplier' has a wrong offset!");
static_assert(offsetof(UBP_VoiceChatSave_C, PlaybackVolumeMultiplier) == 0x000048, "Member 'UBP_VoiceChatSave_C::PlaybackVolumeMultiplier' has a wrong offset!");

}

