#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Velociralien

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_Parent_Enemy_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Velociralien.BP_Velociralien_C
// 0x00C0 (0x0B50 - 0x0A90)
class ABP_Velociralien_C : public ABP_Parent_Enemy_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Velociralien_C;                  // 0x0A88(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   TailAnchor;                                        // 0x0A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPhysicsConstraintComponent*            TailPhysicsConstraint;                             // 0x0A98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TailTarget;                                        // 0x0AA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Mouth;                                             // 0x0AA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BoxFootL;                                          // 0x0AB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BoxFootR;                                          // 0x0AB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_HeadAnimation_Alpha_5DB42713438AE187C361419D1F959D80; // 0x0AC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_HeadAnimation__Direction_5DB42713438AE187C361419D1F959D80; // 0x0AC4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC5[0x3];                                      // 0x0AC5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_HeadAnimation;                            // 0x0AC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        GrawlImpulse;                                      // 0x0AD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GrawlAngularImpulse;                               // 0x0AD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GrawlRadius;                                       // 0x0AE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE4[0x4];                                      // 0x0AE4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_KillableCharacter_C*                Food;                                              // 0x0AE8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          OverrideHeadTransform;                             // 0x0AF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AF1[0x7];                                      // 0x0AF1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HeadLocation;                                      // 0x0AF8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               HeadRotation;                                      // 0x0B10(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          OverrideTailLocation;                              // 0x0B28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B29[0x7];                                      // 0x0B29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TailLocation;                                      // 0x0B30(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void GetTargetHeadLocation(class ABP_KillableCharacter_C* Food_0, struct FVector* TargetLocation);
	void GetCurrentHeadTransform(struct FVector* CurrentLocation);
	void Timeline_HeadAnimation__FinishedFunc();
	void Timeline_HeadAnimation__UpdateFunc();
	void Timeline_HeadAnimation__EatEvent__EventFunc();
	void Eat(class ABP_KillableCharacter_C* Killable);
	void BndEvt__BP_Velociralien_BoxFootL_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void BndEvt__BP_Velociralien_BoxFootR_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void FootHit(class AActor* HitActor, const struct FVector& HitLocation);
	void ReleaseFromMouth();
	void TakeInMouth(class ABP_KillableCharacter_C* Food_0);
	void EatAnimation(class ABP_KillableCharacter_C* Food_0);
	void GrawlExplosion();
	void ReceiveTick(float DeltaSeconds);
	void HasKilled__All_(TScriptInterface<class IBPI_Killable_C> KilledActor);
	void OnRep_IsGrawling();
	void ReceiveBeginPlay();
	void VelociralienKilled__All_(class ABP_KillableCharacter_C* KilledCharacter, class AActor* Killer);
	void ExecuteUbergraph_BP_Velociralien(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Velociralien_C">();
	}
	static class ABP_Velociralien_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Velociralien_C>();
	}
};
static_assert(alignof(ABP_Velociralien_C) == 0x000010, "Wrong alignment on ABP_Velociralien_C");
static_assert(sizeof(ABP_Velociralien_C) == 0x000B50, "Wrong size on ABP_Velociralien_C");
static_assert(offsetof(ABP_Velociralien_C, UberGraphFrame_BP_Velociralien_C) == 0x000A88, "Member 'ABP_Velociralien_C::UberGraphFrame_BP_Velociralien_C' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C, TailAnchor) == 0x000A90, "Member 'ABP_Velociralien_C::TailAnchor' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C, TailPhysicsConstraint) == 0x000A98, "Member 'ABP_Velociralien_C::TailPhysicsConstraint' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C, TailTarget) == 0x000AA0, "Member 'ABP_Velociralien_C::TailTarget' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C, Mouth) == 0x000AA8, "Member 'ABP_Velociralien_C::Mouth' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C, BoxFootL) == 0x000AB0, "Member 'ABP_Velociralien_C::BoxFootL' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C, BoxFootR) == 0x000AB8, "Member 'ABP_Velociralien_C::BoxFootR' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C, Timeline_HeadAnimation_Alpha_5DB42713438AE187C361419D1F959D80) == 0x000AC0, "Member 'ABP_Velociralien_C::Timeline_HeadAnimation_Alpha_5DB42713438AE187C361419D1F959D80' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C, Timeline_HeadAnimation__Direction_5DB42713438AE187C361419D1F959D80) == 0x000AC4, "Member 'ABP_Velociralien_C::Timeline_HeadAnimation__Direction_5DB42713438AE187C361419D1F959D80' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C, Timeline_HeadAnimation) == 0x000AC8, "Member 'ABP_Velociralien_C::Timeline_HeadAnimation' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C, GrawlImpulse) == 0x000AD0, "Member 'ABP_Velociralien_C::GrawlImpulse' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C, GrawlAngularImpulse) == 0x000AD8, "Member 'ABP_Velociralien_C::GrawlAngularImpulse' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C, GrawlRadius) == 0x000AE0, "Member 'ABP_Velociralien_C::GrawlRadius' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C, Food) == 0x000AE8, "Member 'ABP_Velociralien_C::Food' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C, OverrideHeadTransform) == 0x000AF0, "Member 'ABP_Velociralien_C::OverrideHeadTransform' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C, HeadLocation) == 0x000AF8, "Member 'ABP_Velociralien_C::HeadLocation' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C, HeadRotation) == 0x000B10, "Member 'ABP_Velociralien_C::HeadRotation' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C, OverrideTailLocation) == 0x000B28, "Member 'ABP_Velociralien_C::OverrideTailLocation' has a wrong offset!");
static_assert(offsetof(ABP_Velociralien_C, TailLocation) == 0x000B30, "Member 'ABP_Velociralien_C::TailLocation' has a wrong offset!");

}

