#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_AIFearSource

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BPC_FearSource_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_AIFearSource.BPC_AIFearSource_C
// 0x0020 (0x0300 - 0x02E0)
class UBPC_AIFearSource_C final : public UBPC_FearSource_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BPC_AIFearSource_C;                 // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_Parent_Enemy_C*                     Enemy;                                             // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        ChaseFearPerSecond;                                // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChaseMaxFear;                                      // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void GetFearSettings(class ABP_UPPlayerCharacter_C* Player, bool* IsActive_0, double* FearPerSecond_0, double* MaxFear_0, bool* CheckSight_0, double* JumpFear_0);
	void ReceiveBeginPlay();
	void Killed(class ABP_KillableCharacter_C* KilledCharacter, class AActor* Killer);
	void ExecuteUbergraph_BPC_AIFearSource(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_AIFearSource_C">();
	}
	static class UBPC_AIFearSource_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_AIFearSource_C>();
	}
};
static_assert(alignof(UBPC_AIFearSource_C) == 0x000010, "Wrong alignment on UBPC_AIFearSource_C");
static_assert(sizeof(UBPC_AIFearSource_C) == 0x000300, "Wrong size on UBPC_AIFearSource_C");
static_assert(offsetof(UBPC_AIFearSource_C, UberGraphFrame_BPC_AIFearSource_C) == 0x0002D8, "Member 'UBPC_AIFearSource_C::UberGraphFrame_BPC_AIFearSource_C' has a wrong offset!");
static_assert(offsetof(UBPC_AIFearSource_C, Enemy) == 0x0002E0, "Member 'UBPC_AIFearSource_C::Enemy' has a wrong offset!");
static_assert(offsetof(UBPC_AIFearSource_C, ChaseFearPerSecond) == 0x0002E8, "Member 'UBPC_AIFearSource_C::ChaseFearPerSecond' has a wrong offset!");
static_assert(offsetof(UBPC_AIFearSource_C, ChaseMaxFear) == 0x0002F0, "Member 'UBPC_AIFearSource_C::ChaseMaxFear' has a wrong offset!");

}

