#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_PlayerDialogue

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPC_PlayerDialogue.BPC_PlayerDialogue_C.GetDialogueWidget
// 0x0020 (0x0020 - 0x0000)
struct BPC_PlayerDialogue_C_GetDialogueWidget final
{
public:
	class UW_Dialogue_C*                          Widget;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerCharacter_C*                K2Node_DynamicCast_AsBP_UPPlayer_Character;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerDialogue_C_GetDialogueWidget) == 0x000008, "Wrong alignment on BPC_PlayerDialogue_C_GetDialogueWidget");
static_assert(sizeof(BPC_PlayerDialogue_C_GetDialogueWidget) == 0x000020, "Wrong size on BPC_PlayerDialogue_C_GetDialogueWidget");
static_assert(offsetof(BPC_PlayerDialogue_C_GetDialogueWidget, Widget) == 0x000000, "Member 'BPC_PlayerDialogue_C_GetDialogueWidget::Widget' has a wrong offset!");
static_assert(offsetof(BPC_PlayerDialogue_C_GetDialogueWidget, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BPC_PlayerDialogue_C_GetDialogueWidget::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerDialogue_C_GetDialogueWidget, K2Node_DynamicCast_AsBP_UPPlayer_Character) == 0x000010, "Member 'BPC_PlayerDialogue_C_GetDialogueWidget::K2Node_DynamicCast_AsBP_UPPlayer_Character' has a wrong offset!");
static_assert(offsetof(BPC_PlayerDialogue_C_GetDialogueWidget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BPC_PlayerDialogue_C_GetDialogueWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BPC_PlayerDialogue.BPC_PlayerDialogue_C.AddDialogueLine
// 0x0018 (0x0018 - 0x0000)
struct BPC_PlayerDialogue_C_AddDialogueLine final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	double                                        Duration;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerDialogue_C_AddDialogueLine) == 0x000008, "Wrong alignment on BPC_PlayerDialogue_C_AddDialogueLine");
static_assert(sizeof(BPC_PlayerDialogue_C_AddDialogueLine) == 0x000018, "Wrong size on BPC_PlayerDialogue_C_AddDialogueLine");
static_assert(offsetof(BPC_PlayerDialogue_C_AddDialogueLine, Text) == 0x000000, "Member 'BPC_PlayerDialogue_C_AddDialogueLine::Text' has a wrong offset!");
static_assert(offsetof(BPC_PlayerDialogue_C_AddDialogueLine, Duration) == 0x000010, "Member 'BPC_PlayerDialogue_C_AddDialogueLine::Duration' has a wrong offset!");

// Function BPC_PlayerDialogue.BPC_PlayerDialogue_C.AddDialogueLineLocalized
// 0x0020 (0x0020 - 0x0000)
struct BPC_PlayerDialogue_C_AddDialogueLineLocalized final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	double                                        Duration;                                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerDialogue_C_AddDialogueLineLocalized) == 0x000008, "Wrong alignment on BPC_PlayerDialogue_C_AddDialogueLineLocalized");
static_assert(sizeof(BPC_PlayerDialogue_C_AddDialogueLineLocalized) == 0x000020, "Wrong size on BPC_PlayerDialogue_C_AddDialogueLineLocalized");
static_assert(offsetof(BPC_PlayerDialogue_C_AddDialogueLineLocalized, Text) == 0x000000, "Member 'BPC_PlayerDialogue_C_AddDialogueLineLocalized::Text' has a wrong offset!");
static_assert(offsetof(BPC_PlayerDialogue_C_AddDialogueLineLocalized, Duration) == 0x000018, "Member 'BPC_PlayerDialogue_C_AddDialogueLineLocalized::Duration' has a wrong offset!");

// Function BPC_PlayerDialogue.BPC_PlayerDialogue_C.ExecuteUbergraph_BPC_PlayerDialogue
// 0x0060 (0x0060 - 0x0000)
struct BPC_PlayerDialogue_C_ExecuteUbergraph_BPC_PlayerDialogue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Dialogue_C*                          CallFunc_GetDialogueWidget_Widget;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Text;                           // 0x0010(0x0018)()
	double                                        K2Node_CustomEvent_Duration;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_Dialogue_C*                          CallFunc_GetDialogueWidget_Widget_1;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Text_1;                         // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Duration_1;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerDialogue_C_ExecuteUbergraph_BPC_PlayerDialogue) == 0x000008, "Wrong alignment on BPC_PlayerDialogue_C_ExecuteUbergraph_BPC_PlayerDialogue");
static_assert(sizeof(BPC_PlayerDialogue_C_ExecuteUbergraph_BPC_PlayerDialogue) == 0x000060, "Wrong size on BPC_PlayerDialogue_C_ExecuteUbergraph_BPC_PlayerDialogue");
static_assert(offsetof(BPC_PlayerDialogue_C_ExecuteUbergraph_BPC_PlayerDialogue, EntryPoint) == 0x000000, "Member 'BPC_PlayerDialogue_C_ExecuteUbergraph_BPC_PlayerDialogue::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_PlayerDialogue_C_ExecuteUbergraph_BPC_PlayerDialogue, CallFunc_GetDialogueWidget_Widget) == 0x000008, "Member 'BPC_PlayerDialogue_C_ExecuteUbergraph_BPC_PlayerDialogue::CallFunc_GetDialogueWidget_Widget' has a wrong offset!");
static_assert(offsetof(BPC_PlayerDialogue_C_ExecuteUbergraph_BPC_PlayerDialogue, K2Node_CustomEvent_Text) == 0x000010, "Member 'BPC_PlayerDialogue_C_ExecuteUbergraph_BPC_PlayerDialogue::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(BPC_PlayerDialogue_C_ExecuteUbergraph_BPC_PlayerDialogue, K2Node_CustomEvent_Duration) == 0x000028, "Member 'BPC_PlayerDialogue_C_ExecuteUbergraph_BPC_PlayerDialogue::K2Node_CustomEvent_Duration' has a wrong offset!");
static_assert(offsetof(BPC_PlayerDialogue_C_ExecuteUbergraph_BPC_PlayerDialogue, CallFunc_GetDialogueWidget_Widget_1) == 0x000030, "Member 'BPC_PlayerDialogue_C_ExecuteUbergraph_BPC_PlayerDialogue::CallFunc_GetDialogueWidget_Widget_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerDialogue_C_ExecuteUbergraph_BPC_PlayerDialogue, CallFunc_Conv_TextToString_ReturnValue) == 0x000038, "Member 'BPC_PlayerDialogue_C_ExecuteUbergraph_BPC_PlayerDialogue::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerDialogue_C_ExecuteUbergraph_BPC_PlayerDialogue, K2Node_CustomEvent_Text_1) == 0x000048, "Member 'BPC_PlayerDialogue_C_ExecuteUbergraph_BPC_PlayerDialogue::K2Node_CustomEvent_Text_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerDialogue_C_ExecuteUbergraph_BPC_PlayerDialogue, K2Node_CustomEvent_Duration_1) == 0x000058, "Member 'BPC_PlayerDialogue_C_ExecuteUbergraph_BPC_PlayerDialogue::K2Node_CustomEvent_Duration_1' has a wrong offset!");

}

