#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_PlayerEmotes

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "E_Emote_structs.hpp"
#include "S_Emote_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPC_PlayerEmotes.BPC_PlayerEmotes_C.IsCameroidInFocus
// 0x0018 (0x0018 - 0x0000)
struct BPC_PlayerEmotes_C_IsCameroidInFocus final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Cameroid_C*                         K2Node_DynamicCast_AsBP_Cameroid;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerEmotes_C_IsCameroidInFocus) == 0x000008, "Wrong alignment on BPC_PlayerEmotes_C_IsCameroidInFocus");
static_assert(sizeof(BPC_PlayerEmotes_C_IsCameroidInFocus) == 0x000018, "Wrong size on BPC_PlayerEmotes_C_IsCameroidInFocus");
static_assert(offsetof(BPC_PlayerEmotes_C_IsCameroidInFocus, Result) == 0x000000, "Member 'BPC_PlayerEmotes_C_IsCameroidInFocus::Result' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_IsCameroidInFocus, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BPC_PlayerEmotes_C_IsCameroidInFocus::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_IsCameroidInFocus, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'BPC_PlayerEmotes_C_IsCameroidInFocus::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_IsCameroidInFocus, K2Node_DynamicCast_AsBP_Cameroid) == 0x000008, "Member 'BPC_PlayerEmotes_C_IsCameroidInFocus::K2Node_DynamicCast_AsBP_Cameroid' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_IsCameroidInFocus, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BPC_PlayerEmotes_C_IsCameroidInFocus::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_IsCameroidInFocus, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'BPC_PlayerEmotes_C_IsCameroidInFocus::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_IsCameroidInFocus, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'BPC_PlayerEmotes_C_IsCameroidInFocus::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BPC_PlayerEmotes.BPC_PlayerEmotes_C.SetArmsVisibility
// 0x0001 (0x0001 - 0x0000)
struct BPC_PlayerEmotes_C_SetArmsVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerEmotes_C_SetArmsVisibility) == 0x000001, "Wrong alignment on BPC_PlayerEmotes_C_SetArmsVisibility");
static_assert(sizeof(BPC_PlayerEmotes_C_SetArmsVisibility) == 0x000001, "Wrong size on BPC_PlayerEmotes_C_SetArmsVisibility");
static_assert(offsetof(BPC_PlayerEmotes_C_SetArmsVisibility, Visible) == 0x000000, "Member 'BPC_PlayerEmotes_C_SetArmsVisibility::Visible' has a wrong offset!");

// Function BPC_PlayerEmotes.BPC_PlayerEmotes_C.PlayEmoteAnim
// 0x0008 (0x0008 - 0x0000)
struct BPC_PlayerEmotes_C_PlayEmoteAnim final
{
public:
	class UAnimationAsset*                        Anim;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerEmotes_C_PlayEmoteAnim) == 0x000008, "Wrong alignment on BPC_PlayerEmotes_C_PlayEmoteAnim");
static_assert(sizeof(BPC_PlayerEmotes_C_PlayEmoteAnim) == 0x000008, "Wrong size on BPC_PlayerEmotes_C_PlayEmoteAnim");
static_assert(offsetof(BPC_PlayerEmotes_C_PlayEmoteAnim, Anim) == 0x000000, "Member 'BPC_PlayerEmotes_C_PlayEmoteAnim::Anim' has a wrong offset!");

// Function BPC_PlayerEmotes.BPC_PlayerEmotes_C.GetEmote
// 0x0070 (0x0070 - 0x0000)
struct BPC_PlayerEmotes_C_GetEmote final
{
public:
	E_Emote                                       EEmote;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Found;                                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Emote                               Emote;                                             // 0x0008(0x0028)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_Emote                               CallFunc_Array_Get_Item;                           // 0x0040(0x0028)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerEmotes_C_GetEmote) == 0x000008, "Wrong alignment on BPC_PlayerEmotes_C_GetEmote");
static_assert(sizeof(BPC_PlayerEmotes_C_GetEmote) == 0x000070, "Wrong size on BPC_PlayerEmotes_C_GetEmote");
static_assert(offsetof(BPC_PlayerEmotes_C_GetEmote, EEmote) == 0x000000, "Member 'BPC_PlayerEmotes_C_GetEmote::EEmote' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_GetEmote, Found) == 0x000001, "Member 'BPC_PlayerEmotes_C_GetEmote::Found' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_GetEmote, Emote) == 0x000008, "Member 'BPC_PlayerEmotes_C_GetEmote::Emote' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_GetEmote, Temp_int_Array_Index_Variable) == 0x000030, "Member 'BPC_PlayerEmotes_C_GetEmote::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_GetEmote, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'BPC_PlayerEmotes_C_GetEmote::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_GetEmote, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BPC_PlayerEmotes_C_GetEmote::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_GetEmote, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BPC_PlayerEmotes_C_GetEmote::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_GetEmote, CallFunc_Array_Get_Item) == 0x000040, "Member 'BPC_PlayerEmotes_C_GetEmote::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_GetEmote, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'BPC_PlayerEmotes_C_GetEmote::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_GetEmote, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000069, "Member 'BPC_PlayerEmotes_C_GetEmote::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BPC_PlayerEmotes.BPC_PlayerEmotes_C.InpActEvt_IA_Emote1_K2Node_EnhancedInputActionEvent_7
// 0x0030 (0x0030 - 0x0000)
struct BPC_PlayerEmotes_C_InpActEvt_IA_Emote1_K2Node_EnhancedInputActionEvent_7 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote1_K2Node_EnhancedInputActionEvent_7) == 0x000008, "Wrong alignment on BPC_PlayerEmotes_C_InpActEvt_IA_Emote1_K2Node_EnhancedInputActionEvent_7");
static_assert(sizeof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote1_K2Node_EnhancedInputActionEvent_7) == 0x000030, "Wrong size on BPC_PlayerEmotes_C_InpActEvt_IA_Emote1_K2Node_EnhancedInputActionEvent_7");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote1_K2Node_EnhancedInputActionEvent_7, ActionValue) == 0x000000, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote1_K2Node_EnhancedInputActionEvent_7::ActionValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote1_K2Node_EnhancedInputActionEvent_7, ElapsedTime) == 0x000020, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote1_K2Node_EnhancedInputActionEvent_7::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote1_K2Node_EnhancedInputActionEvent_7, TriggeredTime) == 0x000024, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote1_K2Node_EnhancedInputActionEvent_7::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote1_K2Node_EnhancedInputActionEvent_7, SourceAction) == 0x000028, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote1_K2Node_EnhancedInputActionEvent_7::SourceAction' has a wrong offset!");

// Function BPC_PlayerEmotes.BPC_PlayerEmotes_C.InpActEvt_IA_Emote2_K2Node_EnhancedInputActionEvent_6
// 0x0030 (0x0030 - 0x0000)
struct BPC_PlayerEmotes_C_InpActEvt_IA_Emote2_K2Node_EnhancedInputActionEvent_6 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote2_K2Node_EnhancedInputActionEvent_6) == 0x000008, "Wrong alignment on BPC_PlayerEmotes_C_InpActEvt_IA_Emote2_K2Node_EnhancedInputActionEvent_6");
static_assert(sizeof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote2_K2Node_EnhancedInputActionEvent_6) == 0x000030, "Wrong size on BPC_PlayerEmotes_C_InpActEvt_IA_Emote2_K2Node_EnhancedInputActionEvent_6");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote2_K2Node_EnhancedInputActionEvent_6, ActionValue) == 0x000000, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote2_K2Node_EnhancedInputActionEvent_6::ActionValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote2_K2Node_EnhancedInputActionEvent_6, ElapsedTime) == 0x000020, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote2_K2Node_EnhancedInputActionEvent_6::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote2_K2Node_EnhancedInputActionEvent_6, TriggeredTime) == 0x000024, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote2_K2Node_EnhancedInputActionEvent_6::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote2_K2Node_EnhancedInputActionEvent_6, SourceAction) == 0x000028, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote2_K2Node_EnhancedInputActionEvent_6::SourceAction' has a wrong offset!");

// Function BPC_PlayerEmotes.BPC_PlayerEmotes_C.InpActEvt_IA_Emote3_K2Node_EnhancedInputActionEvent_5
// 0x0030 (0x0030 - 0x0000)
struct BPC_PlayerEmotes_C_InpActEvt_IA_Emote3_K2Node_EnhancedInputActionEvent_5 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote3_K2Node_EnhancedInputActionEvent_5) == 0x000008, "Wrong alignment on BPC_PlayerEmotes_C_InpActEvt_IA_Emote3_K2Node_EnhancedInputActionEvent_5");
static_assert(sizeof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote3_K2Node_EnhancedInputActionEvent_5) == 0x000030, "Wrong size on BPC_PlayerEmotes_C_InpActEvt_IA_Emote3_K2Node_EnhancedInputActionEvent_5");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote3_K2Node_EnhancedInputActionEvent_5, ActionValue) == 0x000000, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote3_K2Node_EnhancedInputActionEvent_5::ActionValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote3_K2Node_EnhancedInputActionEvent_5, ElapsedTime) == 0x000020, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote3_K2Node_EnhancedInputActionEvent_5::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote3_K2Node_EnhancedInputActionEvent_5, TriggeredTime) == 0x000024, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote3_K2Node_EnhancedInputActionEvent_5::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote3_K2Node_EnhancedInputActionEvent_5, SourceAction) == 0x000028, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote3_K2Node_EnhancedInputActionEvent_5::SourceAction' has a wrong offset!");

// Function BPC_PlayerEmotes.BPC_PlayerEmotes_C.InpActEvt_IA_Emote4_K2Node_EnhancedInputActionEvent_4
// 0x0030 (0x0030 - 0x0000)
struct BPC_PlayerEmotes_C_InpActEvt_IA_Emote4_K2Node_EnhancedInputActionEvent_4 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote4_K2Node_EnhancedInputActionEvent_4) == 0x000008, "Wrong alignment on BPC_PlayerEmotes_C_InpActEvt_IA_Emote4_K2Node_EnhancedInputActionEvent_4");
static_assert(sizeof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote4_K2Node_EnhancedInputActionEvent_4) == 0x000030, "Wrong size on BPC_PlayerEmotes_C_InpActEvt_IA_Emote4_K2Node_EnhancedInputActionEvent_4");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote4_K2Node_EnhancedInputActionEvent_4, ActionValue) == 0x000000, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote4_K2Node_EnhancedInputActionEvent_4::ActionValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote4_K2Node_EnhancedInputActionEvent_4, ElapsedTime) == 0x000020, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote4_K2Node_EnhancedInputActionEvent_4::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote4_K2Node_EnhancedInputActionEvent_4, TriggeredTime) == 0x000024, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote4_K2Node_EnhancedInputActionEvent_4::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote4_K2Node_EnhancedInputActionEvent_4, SourceAction) == 0x000028, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote4_K2Node_EnhancedInputActionEvent_4::SourceAction' has a wrong offset!");

// Function BPC_PlayerEmotes.BPC_PlayerEmotes_C.InpActEvt_IA_Emote5_K2Node_EnhancedInputActionEvent_3
// 0x0030 (0x0030 - 0x0000)
struct BPC_PlayerEmotes_C_InpActEvt_IA_Emote5_K2Node_EnhancedInputActionEvent_3 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote5_K2Node_EnhancedInputActionEvent_3) == 0x000008, "Wrong alignment on BPC_PlayerEmotes_C_InpActEvt_IA_Emote5_K2Node_EnhancedInputActionEvent_3");
static_assert(sizeof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote5_K2Node_EnhancedInputActionEvent_3) == 0x000030, "Wrong size on BPC_PlayerEmotes_C_InpActEvt_IA_Emote5_K2Node_EnhancedInputActionEvent_3");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote5_K2Node_EnhancedInputActionEvent_3, ActionValue) == 0x000000, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote5_K2Node_EnhancedInputActionEvent_3::ActionValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote5_K2Node_EnhancedInputActionEvent_3, ElapsedTime) == 0x000020, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote5_K2Node_EnhancedInputActionEvent_3::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote5_K2Node_EnhancedInputActionEvent_3, TriggeredTime) == 0x000024, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote5_K2Node_EnhancedInputActionEvent_3::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote5_K2Node_EnhancedInputActionEvent_3, SourceAction) == 0x000028, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote5_K2Node_EnhancedInputActionEvent_3::SourceAction' has a wrong offset!");

// Function BPC_PlayerEmotes.BPC_PlayerEmotes_C.InpActEvt_IA_Emote6_K2Node_EnhancedInputActionEvent_2
// 0x0030 (0x0030 - 0x0000)
struct BPC_PlayerEmotes_C_InpActEvt_IA_Emote6_K2Node_EnhancedInputActionEvent_2 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote6_K2Node_EnhancedInputActionEvent_2) == 0x000008, "Wrong alignment on BPC_PlayerEmotes_C_InpActEvt_IA_Emote6_K2Node_EnhancedInputActionEvent_2");
static_assert(sizeof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote6_K2Node_EnhancedInputActionEvent_2) == 0x000030, "Wrong size on BPC_PlayerEmotes_C_InpActEvt_IA_Emote6_K2Node_EnhancedInputActionEvent_2");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote6_K2Node_EnhancedInputActionEvent_2, ActionValue) == 0x000000, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote6_K2Node_EnhancedInputActionEvent_2::ActionValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote6_K2Node_EnhancedInputActionEvent_2, ElapsedTime) == 0x000020, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote6_K2Node_EnhancedInputActionEvent_2::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote6_K2Node_EnhancedInputActionEvent_2, TriggeredTime) == 0x000024, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote6_K2Node_EnhancedInputActionEvent_2::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote6_K2Node_EnhancedInputActionEvent_2, SourceAction) == 0x000028, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote6_K2Node_EnhancedInputActionEvent_2::SourceAction' has a wrong offset!");

// Function BPC_PlayerEmotes.BPC_PlayerEmotes_C.InpActEvt_IA_Emote7_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct BPC_PlayerEmotes_C_InpActEvt_IA_Emote7_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote7_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on BPC_PlayerEmotes_C_InpActEvt_IA_Emote7_K2Node_EnhancedInputActionEvent_1");
static_assert(sizeof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote7_K2Node_EnhancedInputActionEvent_1) == 0x000030, "Wrong size on BPC_PlayerEmotes_C_InpActEvt_IA_Emote7_K2Node_EnhancedInputActionEvent_1");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote7_K2Node_EnhancedInputActionEvent_1, ActionValue) == 0x000000, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote7_K2Node_EnhancedInputActionEvent_1::ActionValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote7_K2Node_EnhancedInputActionEvent_1, ElapsedTime) == 0x000020, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote7_K2Node_EnhancedInputActionEvent_1::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote7_K2Node_EnhancedInputActionEvent_1, TriggeredTime) == 0x000024, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote7_K2Node_EnhancedInputActionEvent_1::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote7_K2Node_EnhancedInputActionEvent_1, SourceAction) == 0x000028, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote7_K2Node_EnhancedInputActionEvent_1::SourceAction' has a wrong offset!");

// Function BPC_PlayerEmotes.BPC_PlayerEmotes_C.InpActEvt_IA_Emote8_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct BPC_PlayerEmotes_C_InpActEvt_IA_Emote8_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote8_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on BPC_PlayerEmotes_C_InpActEvt_IA_Emote8_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote8_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on BPC_PlayerEmotes_C_InpActEvt_IA_Emote8_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote8_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote8_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote8_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote8_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote8_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote8_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BPC_PlayerEmotes_C_InpActEvt_IA_Emote8_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'BPC_PlayerEmotes_C_InpActEvt_IA_Emote8_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function BPC_PlayerEmotes.BPC_PlayerEmotes_C.PlayEmoteAnimation
// 0x0001 (0x0001 - 0x0000)
struct BPC_PlayerEmotes_C_PlayEmoteAnimation final
{
public:
	E_Emote                                       Emote;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerEmotes_C_PlayEmoteAnimation) == 0x000001, "Wrong alignment on BPC_PlayerEmotes_C_PlayEmoteAnimation");
static_assert(sizeof(BPC_PlayerEmotes_C_PlayEmoteAnimation) == 0x000001, "Wrong size on BPC_PlayerEmotes_C_PlayEmoteAnimation");
static_assert(offsetof(BPC_PlayerEmotes_C_PlayEmoteAnimation, Emote) == 0x000000, "Member 'BPC_PlayerEmotes_C_PlayEmoteAnimation::Emote' has a wrong offset!");

// Function BPC_PlayerEmotes.BPC_PlayerEmotes_C.StopEmoteAnimationDelayed
// 0x0008 (0x0008 - 0x0000)
struct BPC_PlayerEmotes_C_StopEmoteAnimationDelayed final
{
public:
	double                                        Duration;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerEmotes_C_StopEmoteAnimationDelayed) == 0x000008, "Wrong alignment on BPC_PlayerEmotes_C_StopEmoteAnimationDelayed");
static_assert(sizeof(BPC_PlayerEmotes_C_StopEmoteAnimationDelayed) == 0x000008, "Wrong size on BPC_PlayerEmotes_C_StopEmoteAnimationDelayed");
static_assert(offsetof(BPC_PlayerEmotes_C_StopEmoteAnimationDelayed, Duration) == 0x000000, "Member 'BPC_PlayerEmotes_C_StopEmoteAnimationDelayed::Duration' has a wrong offset!");

// Function BPC_PlayerEmotes.BPC_PlayerEmotes_C.StartPlayingEmote
// 0x0001 (0x0001 - 0x0000)
struct BPC_PlayerEmotes_C_StartPlayingEmote final
{
public:
	E_Emote                                       Emote;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerEmotes_C_StartPlayingEmote) == 0x000001, "Wrong alignment on BPC_PlayerEmotes_C_StartPlayingEmote");
static_assert(sizeof(BPC_PlayerEmotes_C_StartPlayingEmote) == 0x000001, "Wrong size on BPC_PlayerEmotes_C_StartPlayingEmote");
static_assert(offsetof(BPC_PlayerEmotes_C_StartPlayingEmote, Emote) == 0x000000, "Member 'BPC_PlayerEmotes_C_StartPlayingEmote::Emote' has a wrong offset!");

// Function BPC_PlayerEmotes.BPC_PlayerEmotes_C.StartPlatingEmoteByIndex
// 0x0001 (0x0001 - 0x0000)
struct BPC_PlayerEmotes_C_StartPlatingEmoteByIndex final
{
public:
	uint8                                         EmoteIdx;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerEmotes_C_StartPlatingEmoteByIndex) == 0x000001, "Wrong alignment on BPC_PlayerEmotes_C_StartPlatingEmoteByIndex");
static_assert(sizeof(BPC_PlayerEmotes_C_StartPlatingEmoteByIndex) == 0x000001, "Wrong size on BPC_PlayerEmotes_C_StartPlatingEmoteByIndex");
static_assert(offsetof(BPC_PlayerEmotes_C_StartPlatingEmoteByIndex, EmoteIdx) == 0x000000, "Member 'BPC_PlayerEmotes_C_StartPlatingEmoteByIndex::EmoteIdx' has a wrong offset!");

// Function BPC_PlayerEmotes.BPC_PlayerEmotes_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BPC_PlayerEmotes_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerEmotes_C_ReceiveTick) == 0x000004, "Wrong alignment on BPC_PlayerEmotes_C_ReceiveTick");
static_assert(sizeof(BPC_PlayerEmotes_C_ReceiveTick) == 0x000004, "Wrong size on BPC_PlayerEmotes_C_ReceiveTick");
static_assert(offsetof(BPC_PlayerEmotes_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BPC_PlayerEmotes_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BPC_PlayerEmotes.BPC_PlayerEmotes_C.CameraShakeIfLocal
// 0x0008 (0x0008 - 0x0000)
struct BPC_PlayerEmotes_C_CameraShakeIfLocal final
{
public:
	class UClass*                                 CameraShake;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerEmotes_C_CameraShakeIfLocal) == 0x000008, "Wrong alignment on BPC_PlayerEmotes_C_CameraShakeIfLocal");
static_assert(sizeof(BPC_PlayerEmotes_C_CameraShakeIfLocal) == 0x000008, "Wrong size on BPC_PlayerEmotes_C_CameraShakeIfLocal");
static_assert(offsetof(BPC_PlayerEmotes_C_CameraShakeIfLocal, CameraShake) == 0x000000, "Member 'BPC_PlayerEmotes_C_CameraShakeIfLocal::CameraShake' has a wrong offset!");

// Function BPC_PlayerEmotes.BPC_PlayerEmotes_C.ExecuteUbergraph_BPC_PlayerEmotes
// 0x0438 (0x0438 - 0x0000)
struct BPC_PlayerEmotes_C_ExecuteUbergraph_BPC_PlayerEmotes final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInSelfieMode_Result;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_4;     // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_4;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_4;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_4;    // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1_0;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_3;     // 0x0070(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_3;     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_3;   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_3;    // 0x0098(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_1;                            // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_2;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x00D8(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x0100(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_2; // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_2;                            // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4_0;                            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_5_0;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0140(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0168(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_3;                            // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_3; // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_6;                              // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7;                              // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6_0;                            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7_0;                            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x01A8(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x01D0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_4; // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_4;                            // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_8;                              // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_8_0;                            // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_9;                              // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_9_0;                            // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_Emote                                       K2Node_CustomEvent_Emote_1;                        // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                K2Node_DynamicCast_AsBP_UPPlayer_Character;        // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEmote_Found;                           // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22A[0x6];                                      // 0x022A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Emote                               CallFunc_GetEmote_Emote;                           // 0x0230(0x0028)(NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Duration;                       // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Emote                                       K2Node_CustomEvent_Emote;                          // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0272(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_273[0x5];                                      // 0x0273(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_283[0x5];                                      // 0x0283(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_10;                             // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_11;                             // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_5;                            // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_7;     // 0x02A0(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_7;     // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_7;   // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_7;    // 0x02C8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_EmoteIdx;                       // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D2[0x6];                                      // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_11_0;                           // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_10_0;                           // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_5; // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EA[0x6];                                      // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_12;                             // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_13;                             // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_6;                            // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_5;     // 0x0340(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_5;     // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_5;   // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_5;    // 0x0368(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_13_0;                           // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_12_0;                           // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_6; // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_CustomEvent_CameraShake;                    // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39A[0x6];                                      // 0x039A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerController_C*               CallFunc_GetPlayerController_PlayerController;     // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraShakeBase*                       CallFunc_StartCameraShake_ReturnValue;             // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerController_C*               CallFunc_GetPlayerController_PlayerController_1;   // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_14;                             // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_15;                             // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_7;                            // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_6;     // 0x03E0(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_6;     // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_6;   // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_6;    // 0x0408(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_15_0;                           // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
