#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_Singleton

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPC_Singleton.BPC_Singleton_C.ExecuteUbergraph_BPC_Singleton
// 0x0038 (0x0038 - 0x0000)
struct BPC_Singleton_C_ExecuteUbergraph_BPC_Singleton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsOfClass_OutActors;            // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_Singleton_C_ExecuteUbergraph_BPC_Singleton) == 0x000008, "Wrong alignment on BPC_Singleton_C_ExecuteUbergraph_BPC_Singleton");
static_assert(sizeof(BPC_Singleton_C_ExecuteUbergraph_BPC_Singleton) == 0x000038, "Wrong size on BPC_Singleton_C_ExecuteUbergraph_BPC_Singleton");
static_assert(offsetof(BPC_Singleton_C_ExecuteUbergraph_BPC_Singleton, EntryPoint) == 0x000000, "Member 'BPC_Singleton_C_ExecuteUbergraph_BPC_Singleton::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_Singleton_C_ExecuteUbergraph_BPC_Singleton, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BPC_Singleton_C_ExecuteUbergraph_BPC_Singleton::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Singleton_C_ExecuteUbergraph_BPC_Singleton, CallFunc_GetOwner_ReturnValue_1) == 0x000010, "Member 'BPC_Singleton_C_ExecuteUbergraph_BPC_Singleton::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_Singleton_C_ExecuteUbergraph_BPC_Singleton, CallFunc_GetObjectClass_ReturnValue) == 0x000018, "Member 'BPC_Singleton_C_ExecuteUbergraph_BPC_Singleton::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Singleton_C_ExecuteUbergraph_BPC_Singleton, CallFunc_GetAllActorsOfClass_OutActors) == 0x000020, "Member 'BPC_Singleton_C_ExecuteUbergraph_BPC_Singleton::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BPC_Singleton_C_ExecuteUbergraph_BPC_Singleton, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BPC_Singleton_C_ExecuteUbergraph_BPC_Singleton::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Singleton_C_ExecuteUbergraph_BPC_Singleton, CallFunc_Greater_IntInt_ReturnValue) == 0x000034, "Member 'BPC_Singleton_C_ExecuteUbergraph_BPC_Singleton::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

