#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_DeathFaceAnims

#include "Basic.hpp"

#include "S_AvatarHeadMorphTargets_structs.hpp"


namespace SDK::Params
{

// Function BPC_DeathFaceAnims.BPC_DeathFaceAnims_C.Killed (Server)
// 0x0010 (0x0010 - 0x0000)
struct BPC_DeathFaceAnims_C_Killed__Server_ final
{
public:
	class ABP_KillableCharacter_C*                KilledCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Killer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_DeathFaceAnims_C_Killed__Server_) == 0x000008, "Wrong alignment on BPC_DeathFaceAnims_C_Killed__Server_");
static_assert(sizeof(BPC_DeathFaceAnims_C_Killed__Server_) == 0x000010, "Wrong size on BPC_DeathFaceAnims_C_Killed__Server_");
static_assert(offsetof(BPC_DeathFaceAnims_C_Killed__Server_, KilledCharacter) == 0x000000, "Member 'BPC_DeathFaceAnims_C_Killed__Server_::KilledCharacter' has a wrong offset!");
static_assert(offsetof(BPC_DeathFaceAnims_C_Killed__Server_, Killer) == 0x000008, "Member 'BPC_DeathFaceAnims_C_Killed__Server_::Killer' has a wrong offset!");

// Function BPC_DeathFaceAnims.BPC_DeathFaceAnims_C.ExecuteUbergraph_BPC_DeathFaceAnims
// 0x00D0 (0x00D0 - 0x0000)
struct BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_AvatarHeadMorphTargets              CallFunc_Array_Random_OutItem;                     // 0x0008(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ABP_KillableCharacter_C* KilledCharacter, class AActor* Killer)> K2Node_CreateDelegate_OutputDelegate; // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_KillableCharacter_C*                K2Node_DynamicCast_AsBP_Killable_Character;        // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_KillableCharacter_C*                K2Node_CustomEvent_KilledCharacter;                // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Killer;                         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x00B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims) == 0x000008, "Wrong alignment on BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims");
static_assert(sizeof(BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims) == 0x0000D0, "Wrong size on BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims");
static_assert(offsetof(BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims, EntryPoint) == 0x000000, "Member 'BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims, CallFunc_Array_Random_OutItem) == 0x000008, "Member 'BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims, CallFunc_Array_Random_OutIndex) == 0x000058, "Member 'BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims, Temp_int_Array_Index_Variable) == 0x00005C, "Member 'BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims, Temp_int_Loop_Counter_Variable) == 0x000070, "Member 'BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims, CallFunc_GetOwner_ReturnValue) == 0x000078, "Member 'BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims, CallFunc_GetOwner_ReturnValue_1) == 0x000080, "Member 'BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims, K2Node_DynamicCast_AsBP_Killable_Character) == 0x000088, "Member 'BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims::K2Node_DynamicCast_AsBP_Killable_Character' has a wrong offset!");
static_assert(offsetof(BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims, CallFunc_HasAuthority_ReturnValue) == 0x000091, "Member 'BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims, K2Node_CustomEvent_KilledCharacter) == 0x000098, "Member 'BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims::K2Node_CustomEvent_KilledCharacter' has a wrong offset!");
static_assert(offsetof(BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims, K2Node_CustomEvent_Killer) == 0x0000A0, "Member 'BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims::K2Node_CustomEvent_Killer' has a wrong offset!");
static_assert(offsetof(BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x0000B0, "Member 'BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims, CallFunc_Array_Length_ReturnValue) == 0x0000C8, "Member 'BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims, CallFunc_Less_IntInt_ReturnValue) == 0x0000CC, "Member 'BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims, CallFunc_IsValid_ReturnValue_1) == 0x0000CD, "Member 'BPC_DeathFaceAnims_C_ExecuteUbergraph_BPC_DeathFaceAnims::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

