#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_Survivor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_Survivor.BPC_Survivor_C
// 0x0020 (0x03E0 - 0x03C0)
class ABPC_Survivor_C final : public AAIController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_NavDataReference_C*                NavDataReference;                                  // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_AIOptimizer_C*                     AIOptimizer;                                       // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBehaviorTree*                          BehaviorTree;                                      // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPC_Survivor(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_Survivor_C">();
	}
	static class ABPC_Survivor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPC_Survivor_C>();
	}
};
static_assert(alignof(ABPC_Survivor_C) == 0x000008, "Wrong alignment on ABPC_Survivor_C");
static_assert(sizeof(ABPC_Survivor_C) == 0x0003E0, "Wrong size on ABPC_Survivor_C");
static_assert(offsetof(ABPC_Survivor_C, UberGraphFrame) == 0x0003C0, "Member 'ABPC_Survivor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABPC_Survivor_C, NavDataReference) == 0x0003C8, "Member 'ABPC_Survivor_C::NavDataReference' has a wrong offset!");
static_assert(offsetof(ABPC_Survivor_C, AIOptimizer) == 0x0003D0, "Member 'ABPC_Survivor_C::AIOptimizer' has a wrong offset!");
static_assert(offsetof(ABPC_Survivor_C, BehaviorTree) == 0x0003D8, "Member 'ABPC_Survivor_C::BehaviorTree' has a wrong offset!");

}

