#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_PlayerPerceptionSource

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK::Params
{

// Function BPC_PlayerPerceptionSource.BPC_PlayerPerceptionSource_C.ReportNoise
// 0x0040 (0x0040 - 0x0000)
struct BPC_PlayerPerceptionSource_C_ReportNoise final
{
public:
	struct FVector                                NoiseLocation;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Loudness;                                          // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxRange;                                          // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DrawDebugSphere_Radius_ImplicitCast;      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerPerceptionSource_C_ReportNoise) == 0x000008, "Wrong alignment on BPC_PlayerPerceptionSource_C_ReportNoise");
static_assert(sizeof(BPC_PlayerPerceptionSource_C_ReportNoise) == 0x000040, "Wrong size on BPC_PlayerPerceptionSource_C_ReportNoise");
static_assert(offsetof(BPC_PlayerPerceptionSource_C_ReportNoise, NoiseLocation) == 0x000000, "Member 'BPC_PlayerPerceptionSource_C_ReportNoise::NoiseLocation' has a wrong offset!");
static_assert(offsetof(BPC_PlayerPerceptionSource_C_ReportNoise, Loudness) == 0x000018, "Member 'BPC_PlayerPerceptionSource_C_ReportNoise::Loudness' has a wrong offset!");
static_assert(offsetof(BPC_PlayerPerceptionSource_C_ReportNoise, MaxRange) == 0x00001C, "Member 'BPC_PlayerPerceptionSource_C_ReportNoise::MaxRange' has a wrong offset!");
static_assert(offsetof(BPC_PlayerPerceptionSource_C_ReportNoise, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'BPC_PlayerPerceptionSource_C_ReportNoise::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerPerceptionSource_C_ReportNoise, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000028, "Member 'BPC_PlayerPerceptionSource_C_ReportNoise::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPC_PlayerPerceptionSource_C_ReportNoise, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000030, "Member 'BPC_PlayerPerceptionSource_C_ReportNoise::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPC_PlayerPerceptionSource_C_ReportNoise, CallFunc_DrawDebugSphere_Radius_ImplicitCast) == 0x000038, "Member 'BPC_PlayerPerceptionSource_C_ReportNoise::CallFunc_DrawDebugSphere_Radius_ImplicitCast' has a wrong offset!");

// Function BPC_PlayerPerceptionSource.BPC_PlayerPerceptionSource_C.ReportPlayerNoise
// 0x0020 (0x0020 - 0x0000)
struct BPC_PlayerPerceptionSource_C_ReportPlayerNoise final
{
public:
	float                                         Loudness;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxRange;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerPerceptionSource_C_ReportPlayerNoise) == 0x000008, "Wrong alignment on BPC_PlayerPerceptionSource_C_ReportPlayerNoise");
static_assert(sizeof(BPC_PlayerPerceptionSource_C_ReportPlayerNoise) == 0x000020, "Wrong size on BPC_PlayerPerceptionSource_C_ReportPlayerNoise");
static_assert(offsetof(BPC_PlayerPerceptionSource_C_ReportPlayerNoise, Loudness) == 0x000000, "Member 'BPC_PlayerPerceptionSource_C_ReportPlayerNoise::Loudness' has a wrong offset!");
static_assert(offsetof(BPC_PlayerPerceptionSource_C_ReportPlayerNoise, MaxRange) == 0x000004, "Member 'BPC_PlayerPerceptionSource_C_ReportPlayerNoise::MaxRange' has a wrong offset!");
static_assert(offsetof(BPC_PlayerPerceptionSource_C_ReportPlayerNoise, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BPC_PlayerPerceptionSource_C_ReportPlayerNoise::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function BPC_PlayerPerceptionSource.BPC_PlayerPerceptionSource_C.Footstep
// 0x0001 (0x0001 - 0x0000)
struct BPC_PlayerPerceptionSource_C_Footstep final
{
public:
	EPhysicalSurface                              Surface;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerPerceptionSource_C_Footstep) == 0x000001, "Wrong alignment on BPC_PlayerPerceptionSource_C_Footstep");
static_assert(sizeof(BPC_PlayerPerceptionSource_C_Footstep) == 0x000001, "Wrong size on BPC_PlayerPerceptionSource_C_Footstep");
static_assert(offsetof(BPC_PlayerPerceptionSource_C_Footstep, Surface) == 0x000000, "Member 'BPC_PlayerPerceptionSource_C_Footstep::Surface' has a wrong offset!");

// Function BPC_PlayerPerceptionSource.BPC_PlayerPerceptionSource_C.ItemEquipped
// 0x0008 (0x0008 - 0x0000)
struct BPC_PlayerPerceptionSource_C_ItemEquipped final
{
public:
	class ABP_InventoryItem_C*                    Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerPerceptionSource_C_ItemEquipped) == 0x000008, "Wrong alignment on BPC_PlayerPerceptionSource_C_ItemEquipped");
static_assert(sizeof(BPC_PlayerPerceptionSource_C_ItemEquipped) == 0x000008, "Wrong size on BPC_PlayerPerceptionSource_C_ItemEquipped");
static_assert(offsetof(BPC_PlayerPerceptionSource_C_ItemEquipped, Item) == 0x000000, "Member 'BPC_PlayerPerceptionSource_C_ItemEquipped::Item' has a wrong offset!");

// Function BPC_PlayerPerceptionSource.BPC_PlayerPerceptionSource_C.OnItemUsed
// 0x0010 (0x0010 - 0x0000)
struct BPC_PlayerPerceptionSource_C_OnItemUsed final
{
public:
	class ABP_InventoryItem_C*                    Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUsed;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerPerceptionSource_C_OnItemUsed) == 0x000008, "Wrong alignment on BPC_PlayerPerceptionSource_C_OnItemUsed");
static_assert(sizeof(BPC_PlayerPerceptionSource_C_OnItemUsed) == 0x000010, "Wrong size on BPC_PlayerPerceptionSource_C_OnItemUsed");
static_assert(offsetof(BPC_PlayerPerceptionSource_C_OnItemUsed, Item) == 0x000000, "Member 'BPC_PlayerPerceptionSource_C_OnItemUsed::Item' has a wrong offset!");
static_assert(offsetof(BPC_PlayerPerceptionSource_C_OnItemUsed, IsUsed) == 0x000008, "Member 'BPC_PlayerPerceptionSource_C_OnItemUsed::IsUsed' has a wrong offset!");

// Function BPC_PlayerPerceptionSource.BPC_PlayerPerceptionSource_C.Interaction
// 0x0010 (0x0010 - 0x0000)
struct BPC_PlayerPerceptionSource_C_Interaction final
{
public:
	TScriptInterface<class IBPI_Interaction_C>    Interaction_0;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerPerceptionSource_C_Interaction) == 0x000008, "Wrong alignment on BPC_PlayerPerceptionSource_C_Interaction");
static_assert(sizeof(BPC_PlayerPerceptionSource_C_Interaction) == 0x000010, "Wrong size on BPC_PlayerPerceptionSource_C_Interaction");
static_assert(offsetof(BPC_PlayerPerceptionSource_C_Interaction, Interaction_0) == 0x000000, "Member 'BPC_PlayerPerceptionSource_C_Interaction::Interaction_0' has a wrong offset!");

// Function BPC_PlayerPerceptionSource.BPC_PlayerPerceptionSource_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BPC_PlayerPerceptionSource_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerPerceptionSource_C_ReceiveTick) == 0x000004, "Wrong alignment on BPC_PlayerPerceptionSource_C_ReceiveTick");
static_assert(sizeof(BPC_PlayerPerceptionSource_C_ReceiveTick) == 0x000004, "Wrong size on BPC_PlayerPerceptionSource_C_ReceiveTick");
static_assert(offsetof(BPC_PlayerPerceptionSource_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BPC_PlayerPerceptionSource_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BPC_PlayerPerceptionSource.BPC_PlayerPerceptionSource_C.ExecuteUbergraph_BPC_PlayerPerceptionSource
// 0x0228 (0x0228 - 0x0000)
struct BPC_PlayerPerceptionSource_C_ExecuteUbergraph_BPC_PlayerPerceptionSource final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_LowPolyAvatar_C*                   K2Node_DynamicCast_AsABP_Low_Poly_Avatar;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_InventoryItem_C*                    K2Node_CustomEvent_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              K2Node_CustomEvent_Surface;                        // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerCharacter_C*                K2Node_DynamicCast_AsBP_UPPlayer_Character;        // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_InventoryItem_C*                    K2Node_CustomEvent_Item;                           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsUsed;                         // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Flashlight_C*                       K2Node_DynamicCast_AsBP_Flashlight;                // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TScriptInterface<class IBPI_Interaction_C> Interaction)> K2Node_CreateDelegate_OutputDelegate_1; // 0x00CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue_1;      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0148(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0170(0x0008)(NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Interaction_C>    K2Node_CustomEvent_Interaction;                    // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInteractNoise_NoiseOnInteract;         // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetInteractNoise_NoiseRange;              // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ABP_InventoryItem_C* Item, bool IsUsed)> K2Node_CreateDelegate_OutputDelegate_3; // 0x01B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPhysicalSurface Surface)>     K2Node_CreateDelegate_OutputDelegate_4;            // 0x01C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ABP_InventoryItem_C* Item)> K2Node_CreateDelegate_OutputDelegate_5;         // 0x01EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ReportPlayerNoise_MaxRange_ImplicitCast;  // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ReportPlayerNoise_MaxRange_ImplicitCast_1; // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ReportPlayerNoise_MaxRange_ImplicitCast_2; // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ReportNoise_MaxRange_ImplicitCast;        // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ReportNoise_MaxRange_ImplicitCast_1;      // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ReportPlayerNoise_MaxRange_ImplicitCast_3; // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerPerceptionSource_C_ExecuteUbergraph_BPC_PlayerPerceptionSource) == 0x000008, "Wrong alignment on BPC_PlayerPerceptionSource_C_ExecuteUbergraph_BPC_PlayerPerceptionSource");
static_assert(sizeof(BPC_PlayerPerceptionSource_C_ExecuteUbergraph_BPC_PlayerPerceptionSource) == 0x000228, "Wrong size on BPC_PlayerPerceptionSource_C_ExecuteUbergraph_BPC_PlayerPerceptionSource");
static_assert(offsetof(BPC_PlayerPerceptionSource_C_ExecuteUbergraph_BPC_PlayerPerceptionSource, EntryPoint) == 0x000000, "Member 'BPC_PlayerPerceptionSource_C_ExecuteUbergraph_BPC_PlayerPerceptionSource::EntryPoint' has a wrong offset!");
