#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_FearSource

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPC_FearSource.BPC_FearSource_C.GetFearSettings
// 0x0038 (0x0038 - 0x0000)
struct BPC_FearSource_C_GetFearSettings final
{
public:
	class ABP_UPPlayerCharacter_C*                Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActive_0;                                        // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FearPerSecond_0;                                   // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxFear_0;                                         // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CheckSight_0;                                      // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        JumpFear_0;                                        // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_FearSource_C_GetFearSettings) == 0x000008, "Wrong alignment on BPC_FearSource_C_GetFearSettings");
static_assert(sizeof(BPC_FearSource_C_GetFearSettings) == 0x000038, "Wrong size on BPC_FearSource_C_GetFearSettings");
static_assert(offsetof(BPC_FearSource_C_GetFearSettings, Player) == 0x000000, "Member 'BPC_FearSource_C_GetFearSettings::Player' has a wrong offset!");
static_assert(offsetof(BPC_FearSource_C_GetFearSettings, IsActive_0) == 0x000008, "Member 'BPC_FearSource_C_GetFearSettings::IsActive_0' has a wrong offset!");
static_assert(offsetof(BPC_FearSource_C_GetFearSettings, FearPerSecond_0) == 0x000010, "Member 'BPC_FearSource_C_GetFearSettings::FearPerSecond_0' has a wrong offset!");
static_assert(offsetof(BPC_FearSource_C_GetFearSettings, MaxFear_0) == 0x000018, "Member 'BPC_FearSource_C_GetFearSettings::MaxFear_0' has a wrong offset!");
static_assert(offsetof(BPC_FearSource_C_GetFearSettings, CheckSight_0) == 0x000020, "Member 'BPC_FearSource_C_GetFearSettings::CheckSight_0' has a wrong offset!");
static_assert(offsetof(BPC_FearSource_C_GetFearSettings, JumpFear_0) == 0x000028, "Member 'BPC_FearSource_C_GetFearSettings::JumpFear_0' has a wrong offset!");
static_assert(offsetof(BPC_FearSource_C_GetFearSettings, CallFunc_IsActive_ReturnValue) == 0x000030, "Member 'BPC_FearSource_C_GetFearSettings::CallFunc_IsActive_ReturnValue' has a wrong offset!");

// Function BPC_FearSource.BPC_FearSource_C.ExecuteUbergraph_BPC_FearSource
// 0x0090 (0x0090 - 0x0000)
struct BPC_FearSource_C_ExecuteUbergraph_BPC_FearSource final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CallFunc_AddComponentByClass_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_FearSource_C_ExecuteUbergraph_BPC_FearSource) == 0x000010, "Wrong alignment on BPC_FearSource_C_ExecuteUbergraph_BPC_FearSource");
static_assert(sizeof(BPC_FearSource_C_ExecuteUbergraph_BPC_FearSource) == 0x000090, "Wrong size on BPC_FearSource_C_ExecuteUbergraph_BPC_FearSource");
static_assert(offsetof(BPC_FearSource_C_ExecuteUbergraph_BPC_FearSource, EntryPoint) == 0x000000, "Member 'BPC_FearSource_C_ExecuteUbergraph_BPC_FearSource::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_FearSource_C_ExecuteUbergraph_BPC_FearSource, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BPC_FearSource_C_ExecuteUbergraph_BPC_FearSource::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_FearSource_C_ExecuteUbergraph_BPC_FearSource, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BPC_FearSource_C_ExecuteUbergraph_BPC_FearSource::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_FearSource_C_ExecuteUbergraph_BPC_FearSource, CallFunc_AddComponentByClass_ReturnValue) == 0x000070, "Member 'BPC_FearSource_C_ExecuteUbergraph_BPC_FearSource::CallFunc_AddComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_FearSource_C_ExecuteUbergraph_BPC_FearSource, CallFunc_GetOwner_ReturnValue_1) == 0x000078, "Member 'BPC_FearSource_C_ExecuteUbergraph_BPC_FearSource::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_FearSource_C_ExecuteUbergraph_BPC_FearSource, CallFunc_HasAuthority_ReturnValue) == 0x000080, "Member 'BPC_FearSource_C_ExecuteUbergraph_BPC_FearSource::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_FearSource_C_ExecuteUbergraph_BPC_FearSource, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000081, "Member 'BPC_FearSource_C_ExecuteUbergraph_BPC_FearSource::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_FearSource_C_ExecuteUbergraph_BPC_FearSource, CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast) == 0x000084, "Member 'BPC_FearSource_C_ExecuteUbergraph_BPC_FearSource::CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast' has a wrong offset!");

}

