#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_ScoringComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPC_ScoringComponent.BPC_ScoringComponent_C.GetBounds
// 0x0070 (0x0070 - 0x0000)
struct BPC_ScoringComponent_C_GetBounds final
{
public:
	struct FVector                                Origin;                                            // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoxExtent;                                         // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_GetAttachParent_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_ScoringComponent_C_GetBounds) == 0x000008, "Wrong alignment on BPC_ScoringComponent_C_GetBounds");
static_assert(sizeof(BPC_ScoringComponent_C_GetBounds) == 0x000070, "Wrong size on BPC_ScoringComponent_C_GetBounds");
static_assert(offsetof(BPC_ScoringComponent_C_GetBounds, Origin) == 0x000000, "Member 'BPC_ScoringComponent_C_GetBounds::Origin' has a wrong offset!");
static_assert(offsetof(BPC_ScoringComponent_C_GetBounds, BoxExtent) == 0x000018, "Member 'BPC_ScoringComponent_C_GetBounds::BoxExtent' has a wrong offset!");
static_assert(offsetof(BPC_ScoringComponent_C_GetBounds, CallFunc_GetAttachParent_ReturnValue) == 0x000030, "Member 'BPC_ScoringComponent_C_GetBounds::CallFunc_GetAttachParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_ScoringComponent_C_GetBounds, CallFunc_GetComponentBounds_Origin) == 0x000038, "Member 'BPC_ScoringComponent_C_GetBounds::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BPC_ScoringComponent_C_GetBounds, CallFunc_GetComponentBounds_BoxExtent) == 0x000050, "Member 'BPC_ScoringComponent_C_GetBounds::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BPC_ScoringComponent_C_GetBounds, CallFunc_GetComponentBounds_SphereRadius) == 0x000068, "Member 'BPC_ScoringComponent_C_GetBounds::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");

// Function BPC_ScoringComponent.BPC_ScoringComponent_C.CanScore
// 0x0018 (0x0018 - 0x0000)
struct BPC_ScoringComponent_C_CanScore final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetAttachParent_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_ScoringComponent_C_CanScore) == 0x000008, "Wrong alignment on BPC_ScoringComponent_C_CanScore");
static_assert(sizeof(BPC_ScoringComponent_C_CanScore) == 0x000018, "Wrong size on BPC_ScoringComponent_C_CanScore");
static_assert(offsetof(BPC_ScoringComponent_C_CanScore, Result) == 0x000000, "Member 'BPC_ScoringComponent_C_CanScore::Result' has a wrong offset!");
static_assert(offsetof(BPC_ScoringComponent_C_CanScore, CallFunc_GetAttachParent_ReturnValue) == 0x000008, "Member 'BPC_ScoringComponent_C_CanScore::CallFunc_GetAttachParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_ScoringComponent_C_CanScore, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BPC_ScoringComponent_C_CanScore::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BPC_ScoringComponent.BPC_ScoringComponent_C.ExecuteUbergraph_BPC_ScoringComponent
// 0x0030 (0x0030 - 0x0000)
struct BPC_ScoringComponent_C_ExecuteUbergraph_BPC_ScoringComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPGameMode_C*                       K2Node_DynamicCast_AsBP_UPGame_Mode;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_ScoringComponent_C_ExecuteUbergraph_BPC_ScoringComponent) == 0x000008, "Wrong alignment on BPC_ScoringComponent_C_ExecuteUbergraph_BPC_ScoringComponent");
static_assert(sizeof(BPC_ScoringComponent_C_ExecuteUbergraph_BPC_ScoringComponent) == 0x000030, "Wrong size on BPC_ScoringComponent_C_ExecuteUbergraph_BPC_ScoringComponent");
static_assert(offsetof(BPC_ScoringComponent_C_ExecuteUbergraph_BPC_ScoringComponent, EntryPoint) == 0x000000, "Member 'BPC_ScoringComponent_C_ExecuteUbergraph_BPC_ScoringComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_ScoringComponent_C_ExecuteUbergraph_BPC_ScoringComponent, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BPC_ScoringComponent_C_ExecuteUbergraph_BPC_ScoringComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_ScoringComponent_C_ExecuteUbergraph_BPC_ScoringComponent, CallFunc_HasAuthority_ReturnValue) == 0x000010, "Member 'BPC_ScoringComponent_C_ExecuteUbergraph_BPC_ScoringComponent::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_ScoringComponent_C_ExecuteUbergraph_BPC_ScoringComponent, CallFunc_GetGameMode_ReturnValue) == 0x000018, "Member 'BPC_ScoringComponent_C_ExecuteUbergraph_BPC_ScoringComponent::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_ScoringComponent_C_ExecuteUbergraph_BPC_ScoringComponent, K2Node_DynamicCast_AsBP_UPGame_Mode) == 0x000020, "Member 'BPC_ScoringComponent_C_ExecuteUbergraph_BPC_ScoringComponent::K2Node_DynamicCast_AsBP_UPGame_Mode' has a wrong offset!");
static_assert(offsetof(BPC_ScoringComponent_C_ExecuteUbergraph_BPC_ScoringComponent, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPC_ScoringComponent_C_ExecuteUbergraph_BPC_ScoringComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

