#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_PlayerAvatar

#include "Basic.hpp"

#include "S_AvatarBoots_structs.hpp"
#include "S_AvatarBag_structs.hpp"
#include "S_AvatarHelmet_structs.hpp"
#include "S_PlayerAvatar_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_PlayerAvatar_structs.hpp"


namespace SDK::Params
{

// Function BPC_PlayerAvatar.BPC_PlayerAvatar_C.GetAvatarDefinition
// 0x0228 (0x0228 - 0x0000)
struct BPC_PlayerAvatar_C_GetAvatarDefinition final
{
public:
	bool                                          IsValid;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PlayerAvatar                        Avatar;                                            // 0x0008(0x00A0)(Parm, OutParm, HasGetValueTypeHash)
	struct FS_PlayerAvatar                        _Avatar;                                           // 0x00A8(0x00A0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          CallFunc_Map_IsNotEmpty_ReturnValue;               // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_IsNotEmpty_ReturnValue_1;             // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_IsNotEmpty_ReturnValue_2;             // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14B[0x5];                                      // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          CallFunc_Map_Find_Value;                           // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          CallFunc_Map_Find_Value_1;                         // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          CallFunc_Map_Find_Value_2;                         // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PlayerAvatar                        CallFunc_Map_Find_Value_3;                         // 0x0180(0x00A0)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_3;                   // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerAvatar_C_GetAvatarDefinition) == 0x000008, "Wrong alignment on BPC_PlayerAvatar_C_GetAvatarDefinition");
static_assert(sizeof(BPC_PlayerAvatar_C_GetAvatarDefinition) == 0x000228, "Wrong size on BPC_PlayerAvatar_C_GetAvatarDefinition");
static_assert(offsetof(BPC_PlayerAvatar_C_GetAvatarDefinition, IsValid) == 0x000000, "Member 'BPC_PlayerAvatar_C_GetAvatarDefinition::IsValid' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetAvatarDefinition, Avatar) == 0x000008, "Member 'BPC_PlayerAvatar_C_GetAvatarDefinition::Avatar' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetAvatarDefinition, _Avatar) == 0x0000A8, "Member 'BPC_PlayerAvatar_C_GetAvatarDefinition::_Avatar' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetAvatarDefinition, CallFunc_Map_IsNotEmpty_ReturnValue) == 0x000148, "Member 'BPC_PlayerAvatar_C_GetAvatarDefinition::CallFunc_Map_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetAvatarDefinition, CallFunc_Map_IsNotEmpty_ReturnValue_1) == 0x000149, "Member 'BPC_PlayerAvatar_C_GetAvatarDefinition::CallFunc_Map_IsNotEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetAvatarDefinition, CallFunc_Map_IsNotEmpty_ReturnValue_2) == 0x00014A, "Member 'BPC_PlayerAvatar_C_GetAvatarDefinition::CallFunc_Map_IsNotEmpty_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetAvatarDefinition, CallFunc_Map_Find_Value) == 0x000150, "Member 'BPC_PlayerAvatar_C_GetAvatarDefinition::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetAvatarDefinition, CallFunc_Map_Find_ReturnValue) == 0x000158, "Member 'BPC_PlayerAvatar_C_GetAvatarDefinition::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetAvatarDefinition, CallFunc_Map_Find_Value_1) == 0x000160, "Member 'BPC_PlayerAvatar_C_GetAvatarDefinition::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetAvatarDefinition, CallFunc_Map_Find_ReturnValue_1) == 0x000168, "Member 'BPC_PlayerAvatar_C_GetAvatarDefinition::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetAvatarDefinition, CallFunc_Map_Find_Value_2) == 0x000170, "Member 'BPC_PlayerAvatar_C_GetAvatarDefinition::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetAvatarDefinition, CallFunc_Map_Find_ReturnValue_2) == 0x000178, "Member 'BPC_PlayerAvatar_C_GetAvatarDefinition::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetAvatarDefinition, CallFunc_Map_Find_Value_3) == 0x000180, "Member 'BPC_PlayerAvatar_C_GetAvatarDefinition::CallFunc_Map_Find_Value_3' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetAvatarDefinition, CallFunc_Map_Find_ReturnValue_3) == 0x000220, "Member 'BPC_PlayerAvatar_C_GetAvatarDefinition::CallFunc_Map_Find_ReturnValue_3' has a wrong offset!");

// Function BPC_PlayerAvatar.BPC_PlayerAvatar_C.GetAvatar
// 0x0148 (0x0148 - 0x0000)
struct BPC_PlayerAvatar_C_GetAvatar final
{
public:
	struct FS_PlayerAvatar                        Avatar;                                            // 0x0000(0x00A0)(Parm, OutParm, HasGetValueTypeHash)
	struct FS_PlayerAvatar                        CallFunc_Map_Find_Value;                           // 0x00A0(0x00A0)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerAvatar_C_GetAvatar) == 0x000008, "Wrong alignment on BPC_PlayerAvatar_C_GetAvatar");
static_assert(sizeof(BPC_PlayerAvatar_C_GetAvatar) == 0x000148, "Wrong size on BPC_PlayerAvatar_C_GetAvatar");
static_assert(offsetof(BPC_PlayerAvatar_C_GetAvatar, Avatar) == 0x000000, "Member 'BPC_PlayerAvatar_C_GetAvatar::Avatar' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetAvatar, CallFunc_Map_Find_Value) == 0x0000A0, "Member 'BPC_PlayerAvatar_C_GetAvatar::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetAvatar, CallFunc_Map_Find_ReturnValue) == 0x000140, "Member 'BPC_PlayerAvatar_C_GetAvatar::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function BPC_PlayerAvatar.BPC_PlayerAvatar_C.GetEyesMorphTargetValues
// 0x00D0 (0x00D0 - 0x0000)
struct BPC_PlayerAvatar_C_GetEyesMorphTargetValues final
{
public:
	struct FRotator                               EyesRotation;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        Up;                                                // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Down;                                              // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Right;                                             // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Left;                                              // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_3;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_1;     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_2;     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_3;     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues) == 0x000008, "Wrong alignment on BPC_PlayerAvatar_C_GetEyesMorphTargetValues");
static_assert(sizeof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues) == 0x0000D0, "Wrong size on BPC_PlayerAvatar_C_GetEyesMorphTargetValues");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, EyesRotation) == 0x000000, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::EyesRotation' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, Up) == 0x000018, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::Up' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, Down) == 0x000020, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::Down' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, Right) == 0x000028, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::Right' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, Left) == 0x000030, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::Left' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, CallFunc_BreakRotator_Roll) == 0x000038, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, CallFunc_BreakRotator_Pitch) == 0x00003C, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, CallFunc_BreakRotator_Yaw) == 0x000040, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000044, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000045, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000048, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000050, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, CallFunc_SelectFloat_ReturnValue) == 0x000058, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000060, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000061, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, CallFunc_SelectFloat_ReturnValue_1) == 0x000068, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000070, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x000078, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, CallFunc_SelectFloat_ReturnValue_2) == 0x000080, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, CallFunc_SelectFloat_ReturnValue_3) == 0x000088, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::CallFunc_SelectFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000090, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000098, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, CallFunc_Divide_DoubleDouble_A_ImplicitCast_1) == 0x0000A0, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::CallFunc_Divide_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x0000A8, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, CallFunc_Greater_DoubleDouble_A_ImplicitCast_1) == 0x0000B0, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::CallFunc_Greater_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, CallFunc_Divide_DoubleDouble_A_ImplicitCast_2) == 0x0000B8, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::CallFunc_Divide_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, CallFunc_Divide_DoubleDouble_A_ImplicitCast_3) == 0x0000C0, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::CallFunc_Divide_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_GetEyesMorphTargetValues, CallFunc_Less_DoubleDouble_A_ImplicitCast_1) == 0x0000C8, "Member 'BPC_PlayerAvatar_C_GetEyesMorphTargetValues::CallFunc_Less_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

// Function BPC_PlayerAvatar.BPC_PlayerAvatar_C.AvatarChanged
// 0x0001 (0x0001 - 0x0000)
struct BPC_PlayerAvatar_C_AvatarChanged final
{
public:
	E_PlayerAvatar                                Avatar;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerAvatar_C_AvatarChanged) == 0x000001, "Wrong alignment on BPC_PlayerAvatar_C_AvatarChanged");
static_assert(sizeof(BPC_PlayerAvatar_C_AvatarChanged) == 0x000001, "Wrong size on BPC_PlayerAvatar_C_AvatarChanged");
static_assert(offsetof(BPC_PlayerAvatar_C_AvatarChanged, Avatar) == 0x000000, "Member 'BPC_PlayerAvatar_C_AvatarChanged::Avatar' has a wrong offset!");

// Function BPC_PlayerAvatar.BPC_PlayerAvatar_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BPC_PlayerAvatar_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerAvatar_C_ReceiveTick) == 0x000004, "Wrong alignment on BPC_PlayerAvatar_C_ReceiveTick");
static_assert(sizeof(BPC_PlayerAvatar_C_ReceiveTick) == 0x000004, "Wrong size on BPC_PlayerAvatar_C_ReceiveTick");
static_assert(offsetof(BPC_PlayerAvatar_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BPC_PlayerAvatar_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BPC_PlayerAvatar.BPC_PlayerAvatar_C.SetHelmet
// 0x0050 (0x0050 - 0x0000)
struct BPC_PlayerAvatar_C_SetHelmet final
{
public:
	struct FS_AvatarHelmet                        Helmet_0;                                          // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerAvatar_C_SetHelmet) == 0x000008, "Wrong alignment on BPC_PlayerAvatar_C_SetHelmet");
static_assert(sizeof(BPC_PlayerAvatar_C_SetHelmet) == 0x000050, "Wrong size on BPC_PlayerAvatar_C_SetHelmet");
static_assert(offsetof(BPC_PlayerAvatar_C_SetHelmet, Helmet_0) == 0x000000, "Member 'BPC_PlayerAvatar_C_SetHelmet::Helmet_0' has a wrong offset!");

// Function BPC_PlayerAvatar.BPC_PlayerAvatar_C.SetBag
// 0x0050 (0x0050 - 0x0000)
struct BPC_PlayerAvatar_C_SetBag final
{
public:
	struct FS_AvatarBag                           Bag_0;                                             // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerAvatar_C_SetBag) == 0x000008, "Wrong alignment on BPC_PlayerAvatar_C_SetBag");
static_assert(sizeof(BPC_PlayerAvatar_C_SetBag) == 0x000050, "Wrong size on BPC_PlayerAvatar_C_SetBag");
static_assert(offsetof(BPC_PlayerAvatar_C_SetBag, Bag_0) == 0x000000, "Member 'BPC_PlayerAvatar_C_SetBag::Bag_0' has a wrong offset!");

// Function BPC_PlayerAvatar.BPC_PlayerAvatar_C.SetBoots
// 0x0050 (0x0050 - 0x0000)
struct BPC_PlayerAvatar_C_SetBoots final
{
public:
	struct FS_AvatarBoots                         Boots_0;                                           // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerAvatar_C_SetBoots) == 0x000008, "Wrong alignment on BPC_PlayerAvatar_C_SetBoots");
static_assert(sizeof(BPC_PlayerAvatar_C_SetBoots) == 0x000050, "Wrong size on BPC_PlayerAvatar_C_SetBoots");
static_assert(offsetof(BPC_PlayerAvatar_C_SetBoots, Boots_0) == 0x000000, "Member 'BPC_PlayerAvatar_C_SetBoots::Boots_0' has a wrong offset!");

// Function BPC_PlayerAvatar.BPC_PlayerAvatar_C.ExecuteUbergraph_BPC_PlayerAvatar
// 0x0218 (0x0218 - 0x0000)
struct BPC_PlayerAvatar_C_ExecuteUbergraph_BPC_PlayerAvatar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerCharacter_C*                K2Node_DynamicCast_AsBP_UPPlayer_Character;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerState_C*                    CallFunc_GetPlayerState_PlayerState;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerController_C*               CallFunc_GetPlayerController_PlayerController;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_PlayerAvatarSelection_C*             CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_PlayerAvatar                                K2Node_CustomEvent_Avatar;                         // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetEyesMorphTargetValues_Up;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetEyesMorphTargetValues_Down;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetEyesMorphTargetValues_Right;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetEyesMorphTargetValues_Left;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_AvatarHelmet                        K2Node_CustomEvent_Helmet;                         // 0x0070(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_GetAvatarDefinition_IsValid;              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PlayerAvatar                        CallFunc_GetAvatarDefinition_Avatar;               // 0x00C8(0x00A0)(HasGetValueTypeHash)
	struct FS_AvatarBag                           K2Node_CustomEvent_Bag;                            // 0x0168(0x0050)(HasGetValueTypeHash)
	struct FS_AvatarBoots                         K2Node_CustomEvent_Boots;                          // 0x01B8(0x0050)(HasGetValueTypeHash)
	float                                         CallFunc_SetMorphTarget_Value_ImplicitCast;        // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMorphTarget_Value_ImplicitCast_1;      // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMorphTarget_Value_ImplicitCast_2;      // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMorphTarget_Value_ImplicitCast_3;      // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PlayerAvatar_C_ExecuteUbergraph_BPC_PlayerAvatar) == 0x000008, "Wrong alignment on BPC_PlayerAvatar_C_ExecuteUbergraph_BPC_PlayerAvatar");
static_assert(sizeof(BPC_PlayerAvatar_C_ExecuteUbergraph_BPC_PlayerAvatar) == 0x000218, "Wrong size on BPC_PlayerAvatar_C_ExecuteUbergraph_BPC_PlayerAvatar");
static_assert(offsetof(BPC_PlayerAvatar_C_ExecuteUbergraph_BPC_PlayerAvatar, EntryPoint) == 0x000000, "Member 'BPC_PlayerAvatar_C_ExecuteUbergraph_BPC_PlayerAvatar::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_PlayerAvatar_C_ExecuteUbergraph_BPC_PlayerAvatar, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BPC_PlayerAvatar_C_ExecuteUbergraph_BPC_PlayerAvatar::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
