#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_Killer

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_Killer.BPI_Killer_C.HasHarmed (All)
// 0x0010 (0x0010 - 0x0000)
struct BPI_Killer_C_HasHarmed__All_ final
{
public:
	TScriptInterface<class IBPI_Killable_C>       HarmedActor;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Killer_C_HasHarmed__All_) == 0x000008, "Wrong alignment on BPI_Killer_C_HasHarmed__All_");
static_assert(sizeof(BPI_Killer_C_HasHarmed__All_) == 0x000010, "Wrong size on BPI_Killer_C_HasHarmed__All_");
static_assert(offsetof(BPI_Killer_C_HasHarmed__All_, HarmedActor) == 0x000000, "Member 'BPI_Killer_C_HasHarmed__All_::HarmedActor' has a wrong offset!");

// Function BPI_Killer.BPI_Killer_C.HasHarmed (Server)
// 0x0010 (0x0010 - 0x0000)
struct BPI_Killer_C_HasHarmed__Server_ final
{
public:
	TScriptInterface<class IBPI_Killable_C>       HarmedActor;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Killer_C_HasHarmed__Server_) == 0x000008, "Wrong alignment on BPI_Killer_C_HasHarmed__Server_");
static_assert(sizeof(BPI_Killer_C_HasHarmed__Server_) == 0x000010, "Wrong size on BPI_Killer_C_HasHarmed__Server_");
static_assert(offsetof(BPI_Killer_C_HasHarmed__Server_, HarmedActor) == 0x000000, "Member 'BPI_Killer_C_HasHarmed__Server_::HarmedActor' has a wrong offset!");

// Function BPI_Killer.BPI_Killer_C.HasKilled (All)
// 0x0010 (0x0010 - 0x0000)
struct BPI_Killer_C_HasKilled__All_ final
{
public:
	TScriptInterface<class IBPI_Killable_C>       KilledActor;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Killer_C_HasKilled__All_) == 0x000008, "Wrong alignment on BPI_Killer_C_HasKilled__All_");
static_assert(sizeof(BPI_Killer_C_HasKilled__All_) == 0x000010, "Wrong size on BPI_Killer_C_HasKilled__All_");
static_assert(offsetof(BPI_Killer_C_HasKilled__All_, KilledActor) == 0x000000, "Member 'BPI_Killer_C_HasKilled__All_::KilledActor' has a wrong offset!");

// Function BPI_Killer.BPI_Killer_C.HasKilled (Server)
// 0x0010 (0x0010 - 0x0000)
struct BPI_Killer_C_HasKilled__Server_ final
{
public:
	TScriptInterface<class IBPI_Killable_C>       KilledActor;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Killer_C_HasKilled__Server_) == 0x000008, "Wrong alignment on BPI_Killer_C_HasKilled__Server_");
static_assert(sizeof(BPI_Killer_C_HasKilled__Server_) == 0x000010, "Wrong size on BPI_Killer_C_HasKilled__Server_");
static_assert(offsetof(BPI_Killer_C_HasKilled__Server_, KilledActor) == 0x000000, "Member 'BPI_Killer_C_HasKilled__Server_::KilledActor' has a wrong offset!");

}

