#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_FloatBBCompare

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTD_FloatBBCompare.BTD_FloatBBCompare_C.PerformConditionCheckAI
// 0x0080 (0x0080 - 0x0000)
struct BTD_FloatBBCompare_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _SecondValue;                                      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _FirstValue;                                       // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBlackboardValueAsFloat_ReturnValue;    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBlackboardValueAsFloat_ReturnValue_1;  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_EqualEqual_DoubleDouble_B_ImplicitCast;   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_B_ImplicitCast;    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTD_FloatBBCompare_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BTD_FloatBBCompare_C_PerformConditionCheckAI");
static_assert(sizeof(BTD_FloatBBCompare_C_PerformConditionCheckAI) == 0x000080, "Wrong size on BTD_FloatBBCompare_C_PerformConditionCheckAI");
static_assert(offsetof(BTD_FloatBBCompare_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BTD_FloatBBCompare_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTD_FloatBBCompare_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BTD_FloatBBCompare_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTD_FloatBBCompare_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BTD_FloatBBCompare_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_FloatBBCompare_C_PerformConditionCheckAI, _SecondValue) == 0x000014, "Member 'BTD_FloatBBCompare_C_PerformConditionCheckAI::_SecondValue' has a wrong offset!");
static_assert(offsetof(BTD_FloatBBCompare_C_PerformConditionCheckAI, _FirstValue) == 0x000018, "Member 'BTD_FloatBBCompare_C_PerformConditionCheckAI::_FirstValue' has a wrong offset!");
static_assert(offsetof(BTD_FloatBBCompare_C_PerformConditionCheckAI, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x00001C, "Member 'BTD_FloatBBCompare_C_PerformConditionCheckAI::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_FloatBBCompare_C_PerformConditionCheckAI, K2Node_SwitchEnum_CmpSuccess) == 0x00001D, "Member 'BTD_FloatBBCompare_C_PerformConditionCheckAI::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BTD_FloatBBCompare_C_PerformConditionCheckAI, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00001E, "Member 'BTD_FloatBBCompare_C_PerformConditionCheckAI::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_FloatBBCompare_C_PerformConditionCheckAI, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x00001F, "Member 'BTD_FloatBBCompare_C_PerformConditionCheckAI::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_FloatBBCompare_C_PerformConditionCheckAI, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000020, "Member 'BTD_FloatBBCompare_C_PerformConditionCheckAI::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_FloatBBCompare_C_PerformConditionCheckAI, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000021, "Member 'BTD_FloatBBCompare_C_PerformConditionCheckAI::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_FloatBBCompare_C_PerformConditionCheckAI, CallFunc_GetBlackboardValueAsFloat_ReturnValue) == 0x000024, "Member 'BTD_FloatBBCompare_C_PerformConditionCheckAI::CallFunc_GetBlackboardValueAsFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_FloatBBCompare_C_PerformConditionCheckAI, CallFunc_GetBlackboardValueAsFloat_ReturnValue_1) == 0x000028, "Member 'BTD_FloatBBCompare_C_PerformConditionCheckAI::CallFunc_GetBlackboardValueAsFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTD_FloatBBCompare_C_PerformConditionCheckAI, CallFunc_EqualEqual_DoubleDouble_B_ImplicitCast) == 0x000030, "Member 'BTD_FloatBBCompare_C_PerformConditionCheckAI::CallFunc_EqualEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTD_FloatBBCompare_C_PerformConditionCheckAI, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x000038, "Member 'BTD_FloatBBCompare_C_PerformConditionCheckAI::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTD_FloatBBCompare_C_PerformConditionCheckAI, CallFunc_LessEqual_DoubleDouble_B_ImplicitCast) == 0x000040, "Member 'BTD_FloatBBCompare_C_PerformConditionCheckAI::CallFunc_LessEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTD_FloatBBCompare_C_PerformConditionCheckAI, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x000048, "Member 'BTD_FloatBBCompare_C_PerformConditionCheckAI::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTD_FloatBBCompare_C_PerformConditionCheckAI, CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast) == 0x000050, "Member 'BTD_FloatBBCompare_C_PerformConditionCheckAI::CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTD_FloatBBCompare_C_PerformConditionCheckAI, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x000058, "Member 'BTD_FloatBBCompare_C_PerformConditionCheckAI::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTD_FloatBBCompare_C_PerformConditionCheckAI, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000060, "Member 'BTD_FloatBBCompare_C_PerformConditionCheckAI::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTD_FloatBBCompare_C_PerformConditionCheckAI, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000068, "Member 'BTD_FloatBBCompare_C_PerformConditionCheckAI::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTD_FloatBBCompare_C_PerformConditionCheckAI, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000070, "Member 'BTD_FloatBBCompare_C_PerformConditionCheckAI::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTD_FloatBBCompare_C_PerformConditionCheckAI, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000078, "Member 'BTD_FloatBBCompare_C_PerformConditionCheckAI::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

