#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_SurvivorInteriorPerception

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTS_SurvivorInteriorPerception.BTS_SurvivorInteriorPerception_C.ExecuteUbergraph_BTS_SurvivorInteriorPerception
// 0x0058 (0x0058 - 0x0000)
struct BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                CallFunc_FetchPerception_Player;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FetchPerception_PlayerDistance;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Parent_Enemy_C*                     CallFunc_FetchPerception_Threat;                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FetchPerception_ThreatDistance;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast_1; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception) == 0x000008, "Wrong alignment on BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception");
static_assert(sizeof(BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception) == 0x000058, "Wrong size on BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception, EntryPoint) == 0x000000, "Member 'BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception, K2Node_Event_OwnerController) == 0x000008, "Member 'BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception, CallFunc_FetchPerception_Player) == 0x000020, "Member 'BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception::CallFunc_FetchPerception_Player' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception, CallFunc_FetchPerception_PlayerDistance) == 0x000028, "Member 'BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception::CallFunc_FetchPerception_PlayerDistance' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception, CallFunc_FetchPerception_Threat) == 0x000030, "Member 'BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception::CallFunc_FetchPerception_Threat' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception, CallFunc_FetchPerception_ThreatDistance) == 0x000038, "Member 'BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception::CallFunc_FetchPerception_ThreatDistance' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000040, "Member 'BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception, CallFunc_Not_PreBool_ReturnValue) == 0x000049, "Member 'BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception, CallFunc_IsValid_ReturnValue_1) == 0x00004A, "Member 'BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception, CallFunc_BooleanAND_ReturnValue) == 0x00004B, "Member 'BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception, CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast) == 0x00004C, "Member 'BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception::CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception, CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast_1) == 0x000050, "Member 'BTS_SurvivorInteriorPerception_C_ExecuteUbergraph_BTS_SurvivorInteriorPerception::CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast_1' has a wrong offset!");

// Function BTS_SurvivorInteriorPerception.BTS_SurvivorInteriorPerception_C.FetchPerception
// 0x0138 (0x0138 - 0x0000)
struct BTS_SurvivorInteriorPerception_C_FetchPerception final
{
public:
	class AAIController*                          Controller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  Pawn;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UAISense>                   SenseToUse;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ABP_UPPlayerCharacter_C*                Player;                                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        PlayerDistance;                                    // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Parent_Enemy_C*                     Threat;                                            // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        ThreatDistance;                                    // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ThreatDistance;                                   // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Parent_Enemy_C*                     _Threat;                                           // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                        _PlayerDistance;                                   // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerCharacter_C*                _Player;                                           // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FVector                                _PawnLocation;                                     // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAIPerceptionComponent*                 CallFunc_GetAIPerceptionComponent_ReturnValue;     // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetKnownPerceivedActors_OutActors;        // 0x00A0(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Parent_Enemy_C*                     K2Node_DynamicCast_AsBP_Parent_Enemy;              // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                K2Node_DynamicCast_AsBP_UPPlayer_Character;        // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue_1;            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x2];                                      // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_SurvivorInteriorPerception_C_FetchPerception) == 0x000008, "Wrong alignment on BTS_SurvivorInteriorPerception_C_FetchPerception");
static_assert(sizeof(BTS_SurvivorInteriorPerception_C_FetchPerception) == 0x000138, "Wrong size on BTS_SurvivorInteriorPerception_C_FetchPerception");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, Controller) == 0x000000, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::Controller' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, Pawn) == 0x000008, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::Pawn' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, SenseToUse) == 0x000010, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::SenseToUse' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, Player) == 0x000018, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::Player' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, PlayerDistance) == 0x000020, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::PlayerDistance' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, Threat) == 0x000028, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::Threat' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, ThreatDistance) == 0x000030, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::ThreatDistance' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, _ThreatDistance) == 0x000038, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::_ThreatDistance' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, _Threat) == 0x000040, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::_Threat' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, _PlayerDistance) == 0x000048, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::_PlayerDistance' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, _Player) == 0x000050, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::_Player' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, _PawnLocation) == 0x000058, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::_PawnLocation' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000078, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, CallFunc_GetAIPerceptionComponent_ReturnValue) == 0x000090, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::CallFunc_GetAIPerceptionComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, Temp_int_Array_Index_Variable) == 0x000098, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, CallFunc_GetKnownPerceivedActors_OutActors) == 0x0000A0, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::CallFunc_GetKnownPerceivedActors_OutActors' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, K2Node_DynamicCast_AsBP_Parent_Enemy) == 0x0000C0, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::K2Node_DynamicCast_AsBP_Parent_Enemy' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, K2Node_DynamicCast_AsBP_UPPlayer_Character) == 0x0000D0, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::K2Node_DynamicCast_AsBP_UPPlayer_Character' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000E0, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0000F8, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, CallFunc_BooleanOR_ReturnValue) == 0x000110, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, CallFunc_Not_PreBool_ReturnValue) == 0x000111, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, CallFunc_Vector_Distance_ReturnValue) == 0x000118, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000120, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, Temp_int_Loop_Counter_Variable) == 0x000124, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, CallFunc_Vector_Distance_ReturnValue_1) == 0x000128, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000130, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, CallFunc_Less_IntInt_ReturnValue) == 0x000131, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_FetchPerception, CallFunc_Add_IntInt_ReturnValue) == 0x000134, "Member 'BTS_SurvivorInteriorPerception_C_FetchPerception::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BTS_SurvivorInteriorPerception.BTS_SurvivorInteriorPerception_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTS_SurvivorInteriorPerception_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_SurvivorInteriorPerception_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTS_SurvivorInteriorPerception_C_ReceiveTickAI");
static_assert(sizeof(BTS_SurvivorInteriorPerception_C_ReceiveTickAI) == 0x000018, "Wrong size on BTS_SurvivorInteriorPerception_C_ReceiveTickAI");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTS_SurvivorInteriorPerception_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTS_SurvivorInteriorPerception_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorPerception_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTS_SurvivorInteriorPerception_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

