#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_LineOfSight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTS_LineOfSight.BTS_LineOfSight_C.ExecuteUbergraph_BTS_LineOfSight
// 0x0190 (0x0190 - 0x0000)
struct BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_KillableCharacter_C*                K2Node_DynamicCast_AsBP_Killable_Character;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetEyesLocation_EyesLocation;             // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x00A0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInFrustrum_Result;                      // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight) == 0x000008, "Wrong alignment on BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight");
static_assert(sizeof(BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight) == 0x000190, "Wrong size on BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight");
static_assert(offsetof(BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight, EntryPoint) == 0x000000, "Member 'BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000008, "Member 'BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight, K2Node_DynamicCast_AsBP_Killable_Character) == 0x000010, "Member 'BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight::K2Node_DynamicCast_AsBP_Killable_Character' has a wrong offset!");
static_assert(offsetof(BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight, CallFunc_GetControlRotation_ReturnValue) == 0x000020, "Member 'BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight, CallFunc_GetEyesLocation_EyesLocation) == 0x000038, "Member 'BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight::CallFunc_GetEyesLocation_EyesLocation' has a wrong offset!");
static_assert(offsetof(BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight, K2Node_Event_OwnerController) == 0x000058, "Member 'BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight, K2Node_Event_ControlledPawn) == 0x000060, "Member 'BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight, K2Node_Event_DeltaSeconds) == 0x000068, "Member 'BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight, K2Node_MakeArray_Array) == 0x000070, "Member 'BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000080, "Member 'BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight, CallFunc_IsValid_ReturnValue_1) == 0x000098, "Member 'BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight, CallFunc_LineTraceSingle_OutHit) == 0x0000A0, "Member 'BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight, CallFunc_LineTraceSingle_ReturnValue) == 0x000188, "Member 'BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight, CallFunc_Not_PreBool_ReturnValue) == 0x000189, "Member 'BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight, CallFunc_IsInFrustrum_Result) == 0x00018A, "Member 'BTS_LineOfSight_C_ExecuteUbergraph_BTS_LineOfSight::CallFunc_IsInFrustrum_Result' has a wrong offset!");

// Function BTS_LineOfSight.BTS_LineOfSight_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTS_LineOfSight_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_LineOfSight_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTS_LineOfSight_C_ReceiveTickAI");
static_assert(sizeof(BTS_LineOfSight_C_ReceiveTickAI) == 0x000018, "Wrong size on BTS_LineOfSight_C_ReceiveTickAI");
static_assert(offsetof(BTS_LineOfSight_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTS_LineOfSight_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_LineOfSight_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTS_LineOfSight_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_LineOfSight_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTS_LineOfSight_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

