#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_SurvivorInteriorSpeeds

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTS_SurvivorInteriorSpeeds.BTS_SurvivorInteriorSpeeds_C
// 0x00A8 (0x0140 - 0x0098)
class UBTS_SurvivorInteriorSpeeds_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 PatrolSpeedKey;                                    // 0x00A0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 PanicSpeed;                                        // 0x00C8(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 FollowSpeed;                                       // 0x00F0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 FastFollowSpeed;                                   // 0x0118(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTS_SurvivorInteriorSpeeds(int32 EntryPoint);
	void ReceiveActivationAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTS_SurvivorInteriorSpeeds_C">();
	}
	static class UBTS_SurvivorInteriorSpeeds_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTS_SurvivorInteriorSpeeds_C>();
	}
};
static_assert(alignof(UBTS_SurvivorInteriorSpeeds_C) == 0x000008, "Wrong alignment on UBTS_SurvivorInteriorSpeeds_C");
static_assert(sizeof(UBTS_SurvivorInteriorSpeeds_C) == 0x000140, "Wrong size on UBTS_SurvivorInteriorSpeeds_C");
static_assert(offsetof(UBTS_SurvivorInteriorSpeeds_C, UberGraphFrame) == 0x000098, "Member 'UBTS_SurvivorInteriorSpeeds_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTS_SurvivorInteriorSpeeds_C, PatrolSpeedKey) == 0x0000A0, "Member 'UBTS_SurvivorInteriorSpeeds_C::PatrolSpeedKey' has a wrong offset!");
static_assert(offsetof(UBTS_SurvivorInteriorSpeeds_C, PanicSpeed) == 0x0000C8, "Member 'UBTS_SurvivorInteriorSpeeds_C::PanicSpeed' has a wrong offset!");
static_assert(offsetof(UBTS_SurvivorInteriorSpeeds_C, FollowSpeed) == 0x0000F0, "Member 'UBTS_SurvivorInteriorSpeeds_C::FollowSpeed' has a wrong offset!");
static_assert(offsetof(UBTS_SurvivorInteriorSpeeds_C, FastFollowSpeed) == 0x000118, "Member 'UBTS_SurvivorInteriorSpeeds_C::FastFollowSpeed' has a wrong offset!");

}

