#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_TargetIsLookingUpdater

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTS_TargetIsLookingUpdater.BTS_TargetIsLookingUpdater_C.ExecuteUbergraph_BTS_TargetIsLookingUpdater
// 0x0108 (0x0108 - 0x0000)
struct BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_KillableCharacter_C*                K2Node_DynamicCast_AsBP_Killable_Character;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue_1;                        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue_2;                        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_2;     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EB[0x5];                                       // 0x00EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_A_ImplicitCast;                       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_A_ImplicitCast_1;                     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_A_ImplicitCast_2;                     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater) == 0x000008, "Wrong alignment on BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater");
static_assert(sizeof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater) == 0x000108, "Wrong size on BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, EntryPoint) == 0x000000, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, K2Node_Event_OwnerController) == 0x000008, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000038, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, K2Node_DynamicCast_AsBP_Killable_Character) == 0x000040, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::K2Node_DynamicCast_AsBP_Killable_Character' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000050, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, CallFunc_FindLookAtRotation_ReturnValue) == 0x000068, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, CallFunc_GetController_ReturnValue) == 0x000080, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, CallFunc_GetControlRotation_ReturnValue) == 0x000088, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, CallFunc_NormalizedDeltaRotator_ReturnValue) == 0x0000A0, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::CallFunc_NormalizedDeltaRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, CallFunc_BreakRotator_Roll) == 0x0000B8, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, CallFunc_BreakRotator_Pitch) == 0x0000BC, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, CallFunc_BreakRotator_Yaw) == 0x0000C0, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, CallFunc_Abs_ReturnValue) == 0x0000C8, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, CallFunc_Abs_ReturnValue_1) == 0x0000D0, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0000D8, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x0000D9, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, CallFunc_Abs_ReturnValue_2) == 0x0000E0, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::CallFunc_Abs_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, CallFunc_LessEqual_DoubleDouble_ReturnValue_2) == 0x0000E8, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::CallFunc_LessEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, CallFunc_BooleanAND_ReturnValue) == 0x0000E9, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, CallFunc_BooleanAND_ReturnValue_1) == 0x0000EA, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, CallFunc_Abs_A_ImplicitCast) == 0x0000F0, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::CallFunc_Abs_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, CallFunc_Abs_A_ImplicitCast_1) == 0x0000F8, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::CallFunc_Abs_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater, CallFunc_Abs_A_ImplicitCast_2) == 0x000100, "Member 'BTS_TargetIsLookingUpdater_C_ExecuteUbergraph_BTS_TargetIsLookingUpdater::CallFunc_Abs_A_ImplicitCast_2' has a wrong offset!");

// Function BTS_TargetIsLookingUpdater.BTS_TargetIsLookingUpdater_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTS_TargetIsLookingUpdater_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_TargetIsLookingUpdater_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTS_TargetIsLookingUpdater_C_ReceiveTickAI");
static_assert(sizeof(BTS_TargetIsLookingUpdater_C_ReceiveTickAI) == 0x000018, "Wrong size on BTS_TargetIsLookingUpdater_C_ReceiveTickAI");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTS_TargetIsLookingUpdater_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTS_TargetIsLookingUpdater_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_TargetIsLookingUpdater_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTS_TargetIsLookingUpdater_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

