#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_Stalker_AngerUpdater

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTS_Stalker_AngerUpdater.BTS_Stalker_AngerUpdater_C.ExecuteUbergraph_BTS_Stalker_AngerUpdater
// 0x0080 (0x0080 - 0x0000)
struct BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBlackboardValueAsFloat_ReturnValue;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBlackboardValueAsBool_ReturnValue;     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBlackboardValueAsFloat_ReturnValue_1;  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Stalker_C*                          K2Node_DynamicCast_AsBP_Stalker;                   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater) == 0x000008, "Wrong alignment on BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater");
static_assert(sizeof(BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater) == 0x000080, "Wrong size on BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater");
static_assert(offsetof(BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater, EntryPoint) == 0x000000, "Member 'BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater, CallFunc_GetBlackboardValueAsFloat_ReturnValue) == 0x000004, "Member 'BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater::CallFunc_GetBlackboardValueAsFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater, CallFunc_GetBlackboardValueAsBool_ReturnValue) == 0x000008, "Member 'BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater::CallFunc_GetBlackboardValueAsBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater, K2Node_Event_OwnerController) == 0x000010, "Member 'BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater, K2Node_Event_ControlledPawn) == 0x000018, "Member 'BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000028, "Member 'BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater, CallFunc_GetBlackboardValueAsFloat_ReturnValue_1) == 0x000030, "Member 'BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater::CallFunc_GetBlackboardValueAsFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000038, "Member 'BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000040, "Member 'BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater, CallFunc_FClamp_ReturnValue) == 0x000048, "Member 'BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater, K2Node_DynamicCast_AsBP_Stalker) == 0x000050, "Member 'BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater::K2Node_DynamicCast_AsBP_Stalker' has a wrong offset!");
static_assert(offsetof(BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000060, "Member 'BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000068, "Member 'BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000070, "Member 'BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater, CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast) == 0x000078, "Member 'BTS_Stalker_AngerUpdater_C_ExecuteUbergraph_BTS_Stalker_AngerUpdater::CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast' has a wrong offset!");

// Function BTS_Stalker_AngerUpdater.BTS_Stalker_AngerUpdater_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTS_Stalker_AngerUpdater_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_Stalker_AngerUpdater_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTS_Stalker_AngerUpdater_C_ReceiveTickAI");
static_assert(sizeof(BTS_Stalker_AngerUpdater_C_ReceiveTickAI) == 0x000018, "Wrong size on BTS_Stalker_AngerUpdater_C_ReceiveTickAI");
static_assert(offsetof(BTS_Stalker_AngerUpdater_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTS_Stalker_AngerUpdater_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_Stalker_AngerUpdater_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTS_Stalker_AngerUpdater_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_Stalker_AngerUpdater_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTS_Stalker_AngerUpdater_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

