#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_SurvivorInteriorSpeeds

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTS_SurvivorInteriorSpeeds.BTS_SurvivorInteriorSpeeds_C.ExecuteUbergraph_BTS_SurvivorInteriorSpeeds
// 0x0048 (0x0048 - 0x0000)
struct BTS_SurvivorInteriorSpeeds_C_ExecuteUbergraph_BTS_SurvivorInteriorSpeeds final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Survivor_Interior_C*                K2Node_DynamicCast_AsBP_Survivor_Interior;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast_1; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast_2; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast_3; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_SurvivorInteriorSpeeds_C_ExecuteUbergraph_BTS_SurvivorInteriorSpeeds) == 0x000008, "Wrong alignment on BTS_SurvivorInteriorSpeeds_C_ExecuteUbergraph_BTS_SurvivorInteriorSpeeds");
static_assert(sizeof(BTS_SurvivorInteriorSpeeds_C_ExecuteUbergraph_BTS_SurvivorInteriorSpeeds) == 0x000048, "Wrong size on BTS_SurvivorInteriorSpeeds_C_ExecuteUbergraph_BTS_SurvivorInteriorSpeeds");
static_assert(offsetof(BTS_SurvivorInteriorSpeeds_C_ExecuteUbergraph_BTS_SurvivorInteriorSpeeds, EntryPoint) == 0x000000, "Member 'BTS_SurvivorInteriorSpeeds_C_ExecuteUbergraph_BTS_SurvivorInteriorSpeeds::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorSpeeds_C_ExecuteUbergraph_BTS_SurvivorInteriorSpeeds, K2Node_Event_OwnerController) == 0x000008, "Member 'BTS_SurvivorInteriorSpeeds_C_ExecuteUbergraph_BTS_SurvivorInteriorSpeeds::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorSpeeds_C_ExecuteUbergraph_BTS_SurvivorInteriorSpeeds, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTS_SurvivorInteriorSpeeds_C_ExecuteUbergraph_BTS_SurvivorInteriorSpeeds::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorSpeeds_C_ExecuteUbergraph_BTS_SurvivorInteriorSpeeds, CallFunc_K2_GetPawn_ReturnValue) == 0x000018, "Member 'BTS_SurvivorInteriorSpeeds_C_ExecuteUbergraph_BTS_SurvivorInteriorSpeeds::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorSpeeds_C_ExecuteUbergraph_BTS_SurvivorInteriorSpeeds, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BTS_SurvivorInteriorSpeeds_C_ExecuteUbergraph_BTS_SurvivorInteriorSpeeds::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorSpeeds_C_ExecuteUbergraph_BTS_SurvivorInteriorSpeeds, K2Node_DynamicCast_AsBP_Survivor_Interior) == 0x000028, "Member 'BTS_SurvivorInteriorSpeeds_C_ExecuteUbergraph_BTS_SurvivorInteriorSpeeds::K2Node_DynamicCast_AsBP_Survivor_Interior' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorSpeeds_C_ExecuteUbergraph_BTS_SurvivorInteriorSpeeds, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BTS_SurvivorInteriorSpeeds_C_ExecuteUbergraph_BTS_SurvivorInteriorSpeeds::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorSpeeds_C_ExecuteUbergraph_BTS_SurvivorInteriorSpeeds, CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast) == 0x000034, "Member 'BTS_SurvivorInteriorSpeeds_C_ExecuteUbergraph_BTS_SurvivorInteriorSpeeds::CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorSpeeds_C_ExecuteUbergraph_BTS_SurvivorInteriorSpeeds, CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast_1) == 0x000038, "Member 'BTS_SurvivorInteriorSpeeds_C_ExecuteUbergraph_BTS_SurvivorInteriorSpeeds::CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorSpeeds_C_ExecuteUbergraph_BTS_SurvivorInteriorSpeeds, CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast_2) == 0x00003C, "Member 'BTS_SurvivorInteriorSpeeds_C_ExecuteUbergraph_BTS_SurvivorInteriorSpeeds::CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorSpeeds_C_ExecuteUbergraph_BTS_SurvivorInteriorSpeeds, CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast_3) == 0x000040, "Member 'BTS_SurvivorInteriorSpeeds_C_ExecuteUbergraph_BTS_SurvivorInteriorSpeeds::CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast_3' has a wrong offset!");

// Function BTS_SurvivorInteriorSpeeds.BTS_SurvivorInteriorSpeeds_C.ReceiveActivationAI
// 0x0010 (0x0010 - 0x0000)
struct BTS_SurvivorInteriorSpeeds_C_ReceiveActivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_SurvivorInteriorSpeeds_C_ReceiveActivationAI) == 0x000008, "Wrong alignment on BTS_SurvivorInteriorSpeeds_C_ReceiveActivationAI");
static_assert(sizeof(BTS_SurvivorInteriorSpeeds_C_ReceiveActivationAI) == 0x000010, "Wrong size on BTS_SurvivorInteriorSpeeds_C_ReceiveActivationAI");
static_assert(offsetof(BTS_SurvivorInteriorSpeeds_C_ReceiveActivationAI, OwnerController) == 0x000000, "Member 'BTS_SurvivorInteriorSpeeds_C_ReceiveActivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_SurvivorInteriorSpeeds_C_ReceiveActivationAI, ControlledPawn) == 0x000008, "Member 'BTS_SurvivorInteriorSpeeds_C_ReceiveActivationAI::ControlledPawn' has a wrong offset!");

}

