#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_LookAtTarget

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTS_LookAtTarget.BTS_LookAtTarget_C.ExecuteUbergraph_BTS_LookAtTarget
// 0x0078 (0x0078 - 0x0000)
struct BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_CustomEvent_Controller;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_Pawn;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ForceDisable;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterMovementComponent*            CallFunc_GetComponentByClass_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController_2;                    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_2;                     // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget) == 0x000008, "Wrong alignment on BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget");
static_assert(sizeof(BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget) == 0x000078, "Wrong size on BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget");
static_assert(offsetof(BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget, EntryPoint) == 0x000000, "Member 'BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget, K2Node_CustomEvent_Controller) == 0x000008, "Member 'BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget::K2Node_CustomEvent_Controller' has a wrong offset!");
static_assert(offsetof(BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget, K2Node_CustomEvent_Pawn) == 0x000010, "Member 'BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget::K2Node_CustomEvent_Pawn' has a wrong offset!");
static_assert(offsetof(BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget, K2Node_CustomEvent_ForceDisable) == 0x000018, "Member 'BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget::K2Node_CustomEvent_ForceDisable' has a wrong offset!");
static_assert(offsetof(BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000020, "Member 'BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget, CallFunc_GetComponentByClass_ReturnValue) == 0x000030, "Member 'BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget, CallFunc_BooleanAND_ReturnValue) == 0x000038, "Member 'BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget, K2Node_Event_OwnerController) == 0x000040, "Member 'BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget, K2Node_Event_ControlledPawn) == 0x000048, "Member 'BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget, K2Node_Event_OwnerController_1) == 0x000050, "Member 'BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget, K2Node_Event_ControlledPawn_1) == 0x000058, "Member 'BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget, K2Node_Event_OwnerController_2) == 0x000060, "Member 'BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget::K2Node_Event_OwnerController_2' has a wrong offset!");
static_assert(offsetof(BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget, K2Node_Event_ControlledPawn_2) == 0x000068, "Member 'BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget::K2Node_Event_ControlledPawn_2' has a wrong offset!");
static_assert(offsetof(BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget, K2Node_Event_DeltaSeconds) == 0x000070, "Member 'BTS_LookAtTarget_C_ExecuteUbergraph_BTS_LookAtTarget::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BTS_LookAtTarget.BTS_LookAtTarget_C.ReceiveActivationAI
// 0x0010 (0x0010 - 0x0000)
struct BTS_LookAtTarget_C_ReceiveActivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_LookAtTarget_C_ReceiveActivationAI) == 0x000008, "Wrong alignment on BTS_LookAtTarget_C_ReceiveActivationAI");
static_assert(sizeof(BTS_LookAtTarget_C_ReceiveActivationAI) == 0x000010, "Wrong size on BTS_LookAtTarget_C_ReceiveActivationAI");
static_assert(offsetof(BTS_LookAtTarget_C_ReceiveActivationAI, OwnerController) == 0x000000, "Member 'BTS_LookAtTarget_C_ReceiveActivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_LookAtTarget_C_ReceiveActivationAI, ControlledPawn) == 0x000008, "Member 'BTS_LookAtTarget_C_ReceiveActivationAI::ControlledPawn' has a wrong offset!");

// Function BTS_LookAtTarget.BTS_LookAtTarget_C.ReceiveDeactivationAI
// 0x0010 (0x0010 - 0x0000)
struct BTS_LookAtTarget_C_ReceiveDeactivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_LookAtTarget_C_ReceiveDeactivationAI) == 0x000008, "Wrong alignment on BTS_LookAtTarget_C_ReceiveDeactivationAI");
static_assert(sizeof(BTS_LookAtTarget_C_ReceiveDeactivationAI) == 0x000010, "Wrong size on BTS_LookAtTarget_C_ReceiveDeactivationAI");
static_assert(offsetof(BTS_LookAtTarget_C_ReceiveDeactivationAI, OwnerController) == 0x000000, "Member 'BTS_LookAtTarget_C_ReceiveDeactivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_LookAtTarget_C_ReceiveDeactivationAI, ControlledPawn) == 0x000008, "Member 'BTS_LookAtTarget_C_ReceiveDeactivationAI::ControlledPawn' has a wrong offset!");

// Function BTS_LookAtTarget.BTS_LookAtTarget_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTS_LookAtTarget_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_LookAtTarget_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTS_LookAtTarget_C_ReceiveTickAI");
static_assert(sizeof(BTS_LookAtTarget_C_ReceiveTickAI) == 0x000018, "Wrong size on BTS_LookAtTarget_C_ReceiveTickAI");
static_assert(offsetof(BTS_LookAtTarget_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTS_LookAtTarget_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_LookAtTarget_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTS_LookAtTarget_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_LookAtTarget_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTS_LookAtTarget_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

// Function BTS_LookAtTarget.BTS_LookAtTarget_C.UpdateFocus
// 0x0018 (0x0018 - 0x0000)
struct BTS_LookAtTarget_C_UpdateFocus final
{
public:
	class AAIController*                          Controller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  Pawn;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ForceDisable;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_LookAtTarget_C_UpdateFocus) == 0x000008, "Wrong alignment on BTS_LookAtTarget_C_UpdateFocus");
static_assert(sizeof(BTS_LookAtTarget_C_UpdateFocus) == 0x000018, "Wrong size on BTS_LookAtTarget_C_UpdateFocus");
static_assert(offsetof(BTS_LookAtTarget_C_UpdateFocus, Controller) == 0x000000, "Member 'BTS_LookAtTarget_C_UpdateFocus::Controller' has a wrong offset!");
static_assert(offsetof(BTS_LookAtTarget_C_UpdateFocus, Pawn) == 0x000008, "Member 'BTS_LookAtTarget_C_UpdateFocus::Pawn' has a wrong offset!");
static_assert(offsetof(BTS_LookAtTarget_C_UpdateFocus, ForceDisable) == 0x000010, "Member 'BTS_LookAtTarget_C_UpdateFocus::ForceDisable' has a wrong offset!");

}

