#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_SetSpeed

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_SetSpeed.BTT_SetSpeed_C.ExecuteUbergraph_BTT_SetSpeed
// 0x0030 (0x0030 - 0x0000)
struct BTT_SetSpeed_C_ExecuteUbergraph_BTT_SetSpeed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBlackboardValueAsFloat_ReturnValue;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterMovementComponent*            CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_SetSpeed_C_ExecuteUbergraph_BTT_SetSpeed) == 0x000008, "Wrong alignment on BTT_SetSpeed_C_ExecuteUbergraph_BTT_SetSpeed");
static_assert(sizeof(BTT_SetSpeed_C_ExecuteUbergraph_BTT_SetSpeed) == 0x000030, "Wrong size on BTT_SetSpeed_C_ExecuteUbergraph_BTT_SetSpeed");
static_assert(offsetof(BTT_SetSpeed_C_ExecuteUbergraph_BTT_SetSpeed, EntryPoint) == 0x000000, "Member 'BTT_SetSpeed_C_ExecuteUbergraph_BTT_SetSpeed::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_SetSpeed_C_ExecuteUbergraph_BTT_SetSpeed, CallFunc_GetBlackboardValueAsFloat_ReturnValue) == 0x000004, "Member 'BTT_SetSpeed_C_ExecuteUbergraph_BTT_SetSpeed::CallFunc_GetBlackboardValueAsFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_SetSpeed_C_ExecuteUbergraph_BTT_SetSpeed, K2Node_Event_OwnerController) == 0x000008, "Member 'BTT_SetSpeed_C_ExecuteUbergraph_BTT_SetSpeed::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_SetSpeed_C_ExecuteUbergraph_BTT_SetSpeed, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTT_SetSpeed_C_ExecuteUbergraph_BTT_SetSpeed::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_SetSpeed_C_ExecuteUbergraph_BTT_SetSpeed, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BTT_SetSpeed_C_ExecuteUbergraph_BTT_SetSpeed::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_SetSpeed_C_ExecuteUbergraph_BTT_SetSpeed, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BTT_SetSpeed_C_ExecuteUbergraph_BTT_SetSpeed::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_SetSpeed_C_ExecuteUbergraph_BTT_SetSpeed, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'BTT_SetSpeed_C_ExecuteUbergraph_BTT_SetSpeed::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BTT_SetSpeed.BTT_SetSpeed_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_SetSpeed_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_SetSpeed_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_SetSpeed_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_SetSpeed_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_SetSpeed_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_SetSpeed_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_SetSpeed_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_SetSpeed_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_SetSpeed_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

