#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_GetLandingPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_GetLandingPoint.BTT_GetLandingPoint_C
// 0x0060 (0x0108 - 0x00A8)
class UBTT_GetLandingPoint_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 TargetKey;                                         // 0x00B0(0x0028)(Edit, BlueprintVisible)
	float                                         SearchRadius;                                      // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 Result_Location_Key;                               // 0x00E0(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTT_GetLandingPoint(int32 EntryPoint);
	void GetLandingPoint(const struct FVector& TargetLocation, class AAIController* AIController, bool* Success, struct FVector* LandingPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_GetLandingPoint_C">();
	}
	static class UBTT_GetLandingPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_GetLandingPoint_C>();
	}
};
static_assert(alignof(UBTT_GetLandingPoint_C) == 0x000008, "Wrong alignment on UBTT_GetLandingPoint_C");
static_assert(sizeof(UBTT_GetLandingPoint_C) == 0x000108, "Wrong size on UBTT_GetLandingPoint_C");
static_assert(offsetof(UBTT_GetLandingPoint_C, UberGraphFrame) == 0x0000A8, "Member 'UBTT_GetLandingPoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_GetLandingPoint_C, TargetKey) == 0x0000B0, "Member 'UBTT_GetLandingPoint_C::TargetKey' has a wrong offset!");
static_assert(offsetof(UBTT_GetLandingPoint_C, SearchRadius) == 0x0000D8, "Member 'UBTT_GetLandingPoint_C::SearchRadius' has a wrong offset!");
static_assert(offsetof(UBTT_GetLandingPoint_C, Result_Location_Key) == 0x0000E0, "Member 'UBTT_GetLandingPoint_C::Result_Location_Key' has a wrong offset!");

}

