#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_ShootWeapons

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_ShootWeapons.BTT_ShootWeapons_C
// 0x0038 (0x00E0 - 0x00A8)
class UBTT_ShootWeapons_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UObject*                                Target;                                            // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 Target_Key;                                        // 0x00B8(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTT_ShootWeapons(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_ShootWeapons_C">();
	}
	static class UBTT_ShootWeapons_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_ShootWeapons_C>();
	}
};
static_assert(alignof(UBTT_ShootWeapons_C) == 0x000008, "Wrong alignment on UBTT_ShootWeapons_C");
static_assert(sizeof(UBTT_ShootWeapons_C) == 0x0000E0, "Wrong size on UBTT_ShootWeapons_C");
static_assert(offsetof(UBTT_ShootWeapons_C, UberGraphFrame) == 0x0000A8, "Member 'UBTT_ShootWeapons_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_ShootWeapons_C, Target) == 0x0000B0, "Member 'UBTT_ShootWeapons_C::Target' has a wrong offset!");
static_assert(offsetof(UBTT_ShootWeapons_C, Target_Key) == 0x0000B8, "Member 'UBTT_ShootWeapons_C::Target_Key' has a wrong offset!");

}

