#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_SetBoolean

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_SetBoolean.BTT_SetBoolean_C
// 0x0038 (0x00E0 - 0x00A8)
class UBTT_SetBoolean_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 Key;                                               // 0x00B0(0x0028)(Edit, BlueprintVisible)
	bool                                          Value;                                             // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTT_SetBoolean(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_SetBoolean_C">();
	}
	static class UBTT_SetBoolean_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_SetBoolean_C>();
	}
};
static_assert(alignof(UBTT_SetBoolean_C) == 0x000008, "Wrong alignment on UBTT_SetBoolean_C");
static_assert(sizeof(UBTT_SetBoolean_C) == 0x0000E0, "Wrong size on UBTT_SetBoolean_C");
static_assert(offsetof(UBTT_SetBoolean_C, UberGraphFrame) == 0x0000A8, "Member 'UBTT_SetBoolean_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_SetBoolean_C, Key) == 0x0000B0, "Member 'UBTT_SetBoolean_C::Key' has a wrong offset!");
static_assert(offsetof(UBTT_SetBoolean_C, Value) == 0x0000D8, "Member 'UBTT_SetBoolean_C::Value' has a wrong offset!");

}

