#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_DestroyDoor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTT_DestroyDoor.BTT_DestroyDoor_C.AbortTask
// 0x0020 (0x0020 - 0x0000)
struct BTT_DestroyDoor_C_AbortTask final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Parent_Enemy_C*                     K2Node_DynamicCast_AsBP_Parent_Enemy;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_DestroyDoor_C_AbortTask) == 0x000008, "Wrong alignment on BTT_DestroyDoor_C_AbortTask");
static_assert(sizeof(BTT_DestroyDoor_C_AbortTask) == 0x000020, "Wrong size on BTT_DestroyDoor_C_AbortTask");
static_assert(offsetof(BTT_DestroyDoor_C_AbortTask, OwnerController) == 0x000000, "Member 'BTT_DestroyDoor_C_AbortTask::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_AbortTask, ControlledPawn) == 0x000008, "Member 'BTT_DestroyDoor_C_AbortTask::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_AbortTask, K2Node_DynamicCast_AsBP_Parent_Enemy) == 0x000010, "Member 'BTT_DestroyDoor_C_AbortTask::K2Node_DynamicCast_AsBP_Parent_Enemy' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_AbortTask, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BTT_DestroyDoor_C_AbortTask::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BTT_DestroyDoor.BTT_DestroyDoor_C.EndTask
// 0x0040 (0x0040 - 0x0000)
struct BTT_DestroyDoor_C_EndTask final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Parent_Enemy_C*                     K2Node_DynamicCast_AsBP_Parent_Enemy;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDoorReadyToDestroy_ReturnValue;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_DestroyDoor_C_EndTask) == 0x000008, "Wrong alignment on BTT_DestroyDoor_C_EndTask");
static_assert(sizeof(BTT_DestroyDoor_C_EndTask) == 0x000040, "Wrong size on BTT_DestroyDoor_C_EndTask");
static_assert(offsetof(BTT_DestroyDoor_C_EndTask, OwnerController) == 0x000000, "Member 'BTT_DestroyDoor_C_EndTask::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_EndTask, ControlledPawn) == 0x000008, "Member 'BTT_DestroyDoor_C_EndTask::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_EndTask, K2Node_DynamicCast_AsBP_Parent_Enemy) == 0x000010, "Member 'BTT_DestroyDoor_C_EndTask::K2Node_DynamicCast_AsBP_Parent_Enemy' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_EndTask, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BTT_DestroyDoor_C_EndTask::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_EndTask, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'BTT_DestroyDoor_C_EndTask::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_EndTask, CallFunc_IsDoorReadyToDestroy_ReturnValue) == 0x000038, "Member 'BTT_DestroyDoor_C_EndTask::CallFunc_IsDoorReadyToDestroy_ReturnValue' has a wrong offset!");

// Function BTT_DestroyDoor.BTT_DestroyDoor_C.GetDestinationPoint
// 0x00D0 (0x00D0 - 0x0000)
struct BTT_DestroyDoor_C_GetDestinationPoint final
{
public:
	class AAIController*                          Controller_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Parent_Enemy_C*                     Pawn_0;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Point;                                             // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetImmediateMoveDestination_ReturnValue;  // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_DestroyDoor_C_GetDestinationPoint) == 0x000008, "Wrong alignment on BTT_DestroyDoor_C_GetDestinationPoint");
static_assert(sizeof(BTT_DestroyDoor_C_GetDestinationPoint) == 0x0000D0, "Wrong size on BTT_DestroyDoor_C_GetDestinationPoint");
static_assert(offsetof(BTT_DestroyDoor_C_GetDestinationPoint, Controller_0) == 0x000000, "Member 'BTT_DestroyDoor_C_GetDestinationPoint::Controller_0' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_GetDestinationPoint, Pawn_0) == 0x000008, "Member 'BTT_DestroyDoor_C_GetDestinationPoint::Pawn_0' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_GetDestinationPoint, Point) == 0x000010, "Member 'BTT_DestroyDoor_C_GetDestinationPoint::Point' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_GetDestinationPoint, CallFunc_GetImmediateMoveDestination_ReturnValue) == 0x000028, "Member 'BTT_DestroyDoor_C_GetDestinationPoint::CallFunc_GetImmediateMoveDestination_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_GetDestinationPoint, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'BTT_DestroyDoor_C_GetDestinationPoint::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_GetDestinationPoint, CallFunc_Add_VectorVector_ReturnValue) == 0x000058, "Member 'BTT_DestroyDoor_C_GetDestinationPoint::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_GetDestinationPoint, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000070, "Member 'BTT_DestroyDoor_C_GetDestinationPoint::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_GetDestinationPoint, CallFunc_Normal_ReturnValue) == 0x000088, "Member 'BTT_DestroyDoor_C_GetDestinationPoint::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_GetDestinationPoint, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000A0, "Member 'BTT_DestroyDoor_C_GetDestinationPoint::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_GetDestinationPoint, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000B8, "Member 'BTT_DestroyDoor_C_GetDestinationPoint::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");

// Function BTT_DestroyDoor.BTT_DestroyDoor_C.GetDoor
// 0x0028 (0x0028 - 0x0000)
struct BTT_DestroyDoor_C_GetDoor final
{
public:
	class ABP_InteractableDoor_C*                 Door_0;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_InteractableDoor_C*                 K2Node_DynamicCast_AsBP_Interactable_Door;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_DestroyDoor_C_GetDoor) == 0x000008, "Wrong alignment on BTT_DestroyDoor_C_GetDoor");
static_assert(sizeof(BTT_DestroyDoor_C_GetDoor) == 0x000028, "Wrong size on BTT_DestroyDoor_C_GetDoor");
static_assert(offsetof(BTT_DestroyDoor_C_GetDoor, Door_0) == 0x000000, "Member 'BTT_DestroyDoor_C_GetDoor::Door_0' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_GetDoor, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000008, "Member 'BTT_DestroyDoor_C_GetDoor::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_GetDoor, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BTT_DestroyDoor_C_GetDoor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_GetDoor, K2Node_DynamicCast_AsBP_Interactable_Door) == 0x000018, "Member 'BTT_DestroyDoor_C_GetDoor::K2Node_DynamicCast_AsBP_Interactable_Door' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_GetDoor, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTT_DestroyDoor_C_GetDoor::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BTT_DestroyDoor.BTT_DestroyDoor_C.IsDoorReadyToDestroy
// 0x0010 (0x0010 - 0x0000)
struct BTT_DestroyDoor_C_IsDoorReadyToDestroy final
{
public:
	class ABP_InteractableDoor_C*                 Door_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_DestroyDoor_C_IsDoorReadyToDestroy) == 0x000008, "Wrong alignment on BTT_DestroyDoor_C_IsDoorReadyToDestroy");
static_assert(sizeof(BTT_DestroyDoor_C_IsDoorReadyToDestroy) == 0x000010, "Wrong size on BTT_DestroyDoor_C_IsDoorReadyToDestroy");
static_assert(offsetof(BTT_DestroyDoor_C_IsDoorReadyToDestroy, Door_0) == 0x000000, "Member 'BTT_DestroyDoor_C_IsDoorReadyToDestroy::Door_0' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_IsDoorReadyToDestroy, ReturnValue) == 0x000008, "Member 'BTT_DestroyDoor_C_IsDoorReadyToDestroy::ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_IsDoorReadyToDestroy, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'BTT_DestroyDoor_C_IsDoorReadyToDestroy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_IsDoorReadyToDestroy, CallFunc_Not_PreBool_ReturnValue) == 0x00000A, "Member 'BTT_DestroyDoor_C_IsDoorReadyToDestroy::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_IsDoorReadyToDestroy, CallFunc_BooleanAND_ReturnValue) == 0x00000B, "Member 'BTT_DestroyDoor_C_IsDoorReadyToDestroy::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BTT_DestroyDoor.BTT_DestroyDoor_C.TryStartTask
// 0x0030 (0x0030 - 0x0000)
struct BTT_DestroyDoor_C_TryStartTask final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InstantFinish;                                     // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Parent_Enemy_C*                     K2Node_DynamicCast_AsBP_Parent_Enemy;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_InteractableDoor_C*                 CallFunc_GetDoor_Door;                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_DestroyDoor_C_TryStartTask) == 0x000008, "Wrong alignment on BTT_DestroyDoor_C_TryStartTask");
static_assert(sizeof(BTT_DestroyDoor_C_TryStartTask) == 0x000030, "Wrong size on BTT_DestroyDoor_C_TryStartTask");
static_assert(offsetof(BTT_DestroyDoor_C_TryStartTask, OwnerController) == 0x000000, "Member 'BTT_DestroyDoor_C_TryStartTask::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_TryStartTask, ControlledPawn) == 0x000008, "Member 'BTT_DestroyDoor_C_TryStartTask::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_TryStartTask, Success) == 0x000010, "Member 'BTT_DestroyDoor_C_TryStartTask::Success' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_TryStartTask, InstantFinish) == 0x000011, "Member 'BTT_DestroyDoor_C_TryStartTask::InstantFinish' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_TryStartTask, K2Node_DynamicCast_AsBP_Parent_Enemy) == 0x000018, "Member 'BTT_DestroyDoor_C_TryStartTask::K2Node_DynamicCast_AsBP_Parent_Enemy' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_TryStartTask, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTT_DestroyDoor_C_TryStartTask::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_TryStartTask, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'BTT_DestroyDoor_C_TryStartTask::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DestroyDoor_C_TryStartTask, CallFunc_GetDoor_Door) == 0x000028, "Member 'BTT_DestroyDoor_C_TryStartTask::CallFunc_GetDoor_Door' has a wrong offset!");

}

