#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_Batogon_GetFlightLocationAbove

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTT_Batogon_GetFlightLocationAbove.BTT_Batogon_GetFlightLocationAbove_C.ExecuteUbergraph_BTT_Batogon_GetFlightLocationAbove
// 0x0070 (0x0070 - 0x0000)
struct BTT_Batogon_GetFlightLocationAbove_C_ExecuteUbergraph_BTT_Batogon_GetFlightLocationAbove final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Batogon_C*                          K2Node_DynamicCast_AsBP_Batogon;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue;   // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_Batogon_GetFlightLocationAbove_C_ExecuteUbergraph_BTT_Batogon_GetFlightLocationAbove) == 0x000008, "Wrong alignment on BTT_Batogon_GetFlightLocationAbove_C_ExecuteUbergraph_BTT_Batogon_GetFlightLocationAbove");
static_assert(sizeof(BTT_Batogon_GetFlightLocationAbove_C_ExecuteUbergraph_BTT_Batogon_GetFlightLocationAbove) == 0x000070, "Wrong size on BTT_Batogon_GetFlightLocationAbove_C_ExecuteUbergraph_BTT_Batogon_GetFlightLocationAbove");
static_assert(offsetof(BTT_Batogon_GetFlightLocationAbove_C_ExecuteUbergraph_BTT_Batogon_GetFlightLocationAbove, EntryPoint) == 0x000000, "Member 'BTT_Batogon_GetFlightLocationAbove_C_ExecuteUbergraph_BTT_Batogon_GetFlightLocationAbove::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_Batogon_GetFlightLocationAbove_C_ExecuteUbergraph_BTT_Batogon_GetFlightLocationAbove, K2Node_Event_OwnerController) == 0x000008, "Member 'BTT_Batogon_GetFlightLocationAbove_C_ExecuteUbergraph_BTT_Batogon_GetFlightLocationAbove::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_Batogon_GetFlightLocationAbove_C_ExecuteUbergraph_BTT_Batogon_GetFlightLocationAbove, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTT_Batogon_GetFlightLocationAbove_C_ExecuteUbergraph_BTT_Batogon_GetFlightLocationAbove::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_Batogon_GetFlightLocationAbove_C_ExecuteUbergraph_BTT_Batogon_GetFlightLocationAbove, K2Node_DynamicCast_AsBP_Batogon) == 0x000018, "Member 'BTT_Batogon_GetFlightLocationAbove_C_ExecuteUbergraph_BTT_Batogon_GetFlightLocationAbove::K2Node_DynamicCast_AsBP_Batogon' has a wrong offset!");
static_assert(offsetof(BTT_Batogon_GetFlightLocationAbove_C_ExecuteUbergraph_BTT_Batogon_GetFlightLocationAbove, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTT_Batogon_GetFlightLocationAbove_C_ExecuteUbergraph_BTT_Batogon_GetFlightLocationAbove::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_Batogon_GetFlightLocationAbove_C_ExecuteUbergraph_BTT_Batogon_GetFlightLocationAbove, CallFunc_GetBlackboardValueAsVector_ReturnValue) == 0x000028, "Member 'BTT_Batogon_GetFlightLocationAbove_C_ExecuteUbergraph_BTT_Batogon_GetFlightLocationAbove::CallFunc_GetBlackboardValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_Batogon_GetFlightLocationAbove_C_ExecuteUbergraph_BTT_Batogon_GetFlightLocationAbove, CallFunc_BreakVector_X) == 0x000040, "Member 'BTT_Batogon_GetFlightLocationAbove_C_ExecuteUbergraph_BTT_Batogon_GetFlightLocationAbove::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BTT_Batogon_GetFlightLocationAbove_C_ExecuteUbergraph_BTT_Batogon_GetFlightLocationAbove, CallFunc_BreakVector_Y) == 0x000048, "Member 'BTT_Batogon_GetFlightLocationAbove_C_ExecuteUbergraph_BTT_Batogon_GetFlightLocationAbove::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BTT_Batogon_GetFlightLocationAbove_C_ExecuteUbergraph_BTT_Batogon_GetFlightLocationAbove, CallFunc_BreakVector_Z) == 0x000050, "Member 'BTT_Batogon_GetFlightLocationAbove_C_ExecuteUbergraph_BTT_Batogon_GetFlightLocationAbove::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BTT_Batogon_GetFlightLocationAbove_C_ExecuteUbergraph_BTT_Batogon_GetFlightLocationAbove, CallFunc_MakeVector_ReturnValue) == 0x000058, "Member 'BTT_Batogon_GetFlightLocationAbove_C_ExecuteUbergraph_BTT_Batogon_GetFlightLocationAbove::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function BTT_Batogon_GetFlightLocationAbove.BTT_Batogon_GetFlightLocationAbove_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_Batogon_GetFlightLocationAbove_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_Batogon_GetFlightLocationAbove_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_Batogon_GetFlightLocationAbove_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_Batogon_GetFlightLocationAbove_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_Batogon_GetFlightLocationAbove_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_Batogon_GetFlightLocationAbove_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_Batogon_GetFlightLocationAbove_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_Batogon_GetFlightLocationAbove_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_Batogon_GetFlightLocationAbove_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

