#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_PickDestination

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_PickDestination.BTT_PickDestination_C
// 0x0060 (0x0108 - 0x00A8)
class UBTT_PickDestination_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 Destination;                                       // 0x00B0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 HasDestination;                                    // 0x00D8(0x0028)(Edit, BlueprintVisible)
	TSubclassOf<class AActor>                     Actor_Class_Places_to_go;                          // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTT_PickDestination(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_PickDestination_C">();
	}
	static class UBTT_PickDestination_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_PickDestination_C>();
	}
};
static_assert(alignof(UBTT_PickDestination_C) == 0x000008, "Wrong alignment on UBTT_PickDestination_C");
static_assert(sizeof(UBTT_PickDestination_C) == 0x000108, "Wrong size on UBTT_PickDestination_C");
static_assert(offsetof(UBTT_PickDestination_C, UberGraphFrame) == 0x0000A8, "Member 'UBTT_PickDestination_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_PickDestination_C, Destination) == 0x0000B0, "Member 'UBTT_PickDestination_C::Destination' has a wrong offset!");
static_assert(offsetof(UBTT_PickDestination_C, HasDestination) == 0x0000D8, "Member 'UBTT_PickDestination_C::HasDestination' has a wrong offset!");
static_assert(offsetof(UBTT_PickDestination_C, Actor_Class_Places_to_go) == 0x000100, "Member 'UBTT_PickDestination_C::Actor_Class_Places_to_go' has a wrong offset!");

}

