#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_SurvivorEscape

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_SurvivorEscape.BTT_SurvivorEscape_C.ExecuteUbergraph_BTT_SurvivorEscape
// 0x0030 (0x0030 - 0x0000)
struct BTT_SurvivorEscape_C_ExecuteUbergraph_BTT_SurvivorEscape final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x0018(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_SurvivorEscape_C_ExecuteUbergraph_BTT_SurvivorEscape) == 0x000008, "Wrong alignment on BTT_SurvivorEscape_C_ExecuteUbergraph_BTT_SurvivorEscape");
static_assert(sizeof(BTT_SurvivorEscape_C_ExecuteUbergraph_BTT_SurvivorEscape) == 0x000030, "Wrong size on BTT_SurvivorEscape_C_ExecuteUbergraph_BTT_SurvivorEscape");
static_assert(offsetof(BTT_SurvivorEscape_C_ExecuteUbergraph_BTT_SurvivorEscape, EntryPoint) == 0x000000, "Member 'BTT_SurvivorEscape_C_ExecuteUbergraph_BTT_SurvivorEscape::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_SurvivorEscape_C_ExecuteUbergraph_BTT_SurvivorEscape, K2Node_Event_OwnerController) == 0x000008, "Member 'BTT_SurvivorEscape_C_ExecuteUbergraph_BTT_SurvivorEscape::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_SurvivorEscape_C_ExecuteUbergraph_BTT_SurvivorEscape, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTT_SurvivorEscape_C_ExecuteUbergraph_BTT_SurvivorEscape::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_SurvivorEscape_C_ExecuteUbergraph_BTT_SurvivorEscape, CallFunc_GetAttachedActors_OutActors) == 0x000018, "Member 'BTT_SurvivorEscape_C_ExecuteUbergraph_BTT_SurvivorEscape::CallFunc_GetAttachedActors_OutActors' has a wrong offset!");
static_assert(offsetof(BTT_SurvivorEscape_C_ExecuteUbergraph_BTT_SurvivorEscape, CallFunc_Array_IsEmpty_ReturnValue) == 0x000028, "Member 'BTT_SurvivorEscape_C_ExecuteUbergraph_BTT_SurvivorEscape::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");

// Function BTT_SurvivorEscape.BTT_SurvivorEscape_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_SurvivorEscape_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_SurvivorEscape_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_SurvivorEscape_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_SurvivorEscape_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_SurvivorEscape_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_SurvivorEscape_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_SurvivorEscape_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_SurvivorEscape_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_SurvivorEscape_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

