#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_StopMovement

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_StopMovement.BTT_StopMovement_C.ExecuteUbergraph_BTT_StopMovement
// 0x0020 (0x0020 - 0x0000)
struct BTT_StopMovement_C_ExecuteUbergraph_BTT_StopMovement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_StopMovement_C_ExecuteUbergraph_BTT_StopMovement) == 0x000008, "Wrong alignment on BTT_StopMovement_C_ExecuteUbergraph_BTT_StopMovement");
static_assert(sizeof(BTT_StopMovement_C_ExecuteUbergraph_BTT_StopMovement) == 0x000020, "Wrong size on BTT_StopMovement_C_ExecuteUbergraph_BTT_StopMovement");
static_assert(offsetof(BTT_StopMovement_C_ExecuteUbergraph_BTT_StopMovement, EntryPoint) == 0x000000, "Member 'BTT_StopMovement_C_ExecuteUbergraph_BTT_StopMovement::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_StopMovement_C_ExecuteUbergraph_BTT_StopMovement, K2Node_Event_OwnerController) == 0x000008, "Member 'BTT_StopMovement_C_ExecuteUbergraph_BTT_StopMovement::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_StopMovement_C_ExecuteUbergraph_BTT_StopMovement, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTT_StopMovement_C_ExecuteUbergraph_BTT_StopMovement::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_StopMovement_C_ExecuteUbergraph_BTT_StopMovement, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BTT_StopMovement_C_ExecuteUbergraph_BTT_StopMovement::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BTT_StopMovement.BTT_StopMovement_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_StopMovement_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_StopMovement_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_StopMovement_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_StopMovement_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_StopMovement_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_StopMovement_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_StopMovement_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_StopMovement_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_StopMovement_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

