#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_JumpToAttack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_JumpToAttack.BTT_JumpToAttack_C
// 0x0040 (0x00E8 - 0x00A8)
class UBTT_JumpToAttack_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 Target_Key;                                        // 0x00B0(0x0028)(Edit, BlueprintVisible)
	double                                        PredictionTime;                                    // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Insect_C*                           Insect;                                            // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTT_JumpToAttack(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_JumpToAttack_C">();
	}
	static class UBTT_JumpToAttack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_JumpToAttack_C>();
	}
};
static_assert(alignof(UBTT_JumpToAttack_C) == 0x000008, "Wrong alignment on UBTT_JumpToAttack_C");
static_assert(sizeof(UBTT_JumpToAttack_C) == 0x0000E8, "Wrong size on UBTT_JumpToAttack_C");
static_assert(offsetof(UBTT_JumpToAttack_C, UberGraphFrame) == 0x0000A8, "Member 'UBTT_JumpToAttack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_JumpToAttack_C, Target_Key) == 0x0000B0, "Member 'UBTT_JumpToAttack_C::Target_Key' has a wrong offset!");
static_assert(offsetof(UBTT_JumpToAttack_C, PredictionTime) == 0x0000D8, "Member 'UBTT_JumpToAttack_C::PredictionTime' has a wrong offset!");
static_assert(offsetof(UBTT_JumpToAttack_C, Insect) == 0x0000E0, "Member 'UBTT_JumpToAttack_C::Insect' has a wrong offset!");

}

