#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_AttachToTarget

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_AttachToTarget.BTT_AttachToTarget_C.ExecuteUbergraph_BTT_AttachToTarget
// 0x0040 (0x0040 - 0x0000)
struct BTT_AttachToTarget_C_ExecuteUbergraph_BTT_AttachToTarget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Parent_Enemy_C*                     K2Node_DynamicCast_AsBP_Parent_Enemy;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_KillableCharacter_C*                K2Node_DynamicCast_AsBP_Killable_Character;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AttachToTarget_C_ExecuteUbergraph_BTT_AttachToTarget) == 0x000008, "Wrong alignment on BTT_AttachToTarget_C_ExecuteUbergraph_BTT_AttachToTarget");
static_assert(sizeof(BTT_AttachToTarget_C_ExecuteUbergraph_BTT_AttachToTarget) == 0x000040, "Wrong size on BTT_AttachToTarget_C_ExecuteUbergraph_BTT_AttachToTarget");
static_assert(offsetof(BTT_AttachToTarget_C_ExecuteUbergraph_BTT_AttachToTarget, EntryPoint) == 0x000000, "Member 'BTT_AttachToTarget_C_ExecuteUbergraph_BTT_AttachToTarget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_AttachToTarget_C_ExecuteUbergraph_BTT_AttachToTarget, K2Node_Event_OwnerController) == 0x000008, "Member 'BTT_AttachToTarget_C_ExecuteUbergraph_BTT_AttachToTarget::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AttachToTarget_C_ExecuteUbergraph_BTT_AttachToTarget, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTT_AttachToTarget_C_ExecuteUbergraph_BTT_AttachToTarget::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_AttachToTarget_C_ExecuteUbergraph_BTT_AttachToTarget, K2Node_DynamicCast_AsBP_Parent_Enemy) == 0x000018, "Member 'BTT_AttachToTarget_C_ExecuteUbergraph_BTT_AttachToTarget::K2Node_DynamicCast_AsBP_Parent_Enemy' has a wrong offset!");
static_assert(offsetof(BTT_AttachToTarget_C_ExecuteUbergraph_BTT_AttachToTarget, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTT_AttachToTarget_C_ExecuteUbergraph_BTT_AttachToTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_AttachToTarget_C_ExecuteUbergraph_BTT_AttachToTarget, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000028, "Member 'BTT_AttachToTarget_C_ExecuteUbergraph_BTT_AttachToTarget::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AttachToTarget_C_ExecuteUbergraph_BTT_AttachToTarget, K2Node_DynamicCast_AsBP_Killable_Character) == 0x000030, "Member 'BTT_AttachToTarget_C_ExecuteUbergraph_BTT_AttachToTarget::K2Node_DynamicCast_AsBP_Killable_Character' has a wrong offset!");
static_assert(offsetof(BTT_AttachToTarget_C_ExecuteUbergraph_BTT_AttachToTarget, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BTT_AttachToTarget_C_ExecuteUbergraph_BTT_AttachToTarget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BTT_AttachToTarget.BTT_AttachToTarget_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_AttachToTarget_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AttachToTarget_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_AttachToTarget_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_AttachToTarget_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_AttachToTarget_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_AttachToTarget_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_AttachToTarget_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AttachToTarget_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_AttachToTarget_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

