#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_GetActorLocation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_GetActorLocation.BTT_GetActorLocation_C
// 0x0058 (0x0100 - 0x00A8)
class UBTT_GetActorLocation_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 ActorKey;                                          // 0x00B0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 ActorLocationKey;                                  // 0x00D8(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTT_GetActorLocation(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_GetActorLocation_C">();
	}
	static class UBTT_GetActorLocation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_GetActorLocation_C>();
	}
};
static_assert(alignof(UBTT_GetActorLocation_C) == 0x000008, "Wrong alignment on UBTT_GetActorLocation_C");
static_assert(sizeof(UBTT_GetActorLocation_C) == 0x000100, "Wrong size on UBTT_GetActorLocation_C");
static_assert(offsetof(UBTT_GetActorLocation_C, UberGraphFrame) == 0x0000A8, "Member 'UBTT_GetActorLocation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_GetActorLocation_C, ActorKey) == 0x0000B0, "Member 'UBTT_GetActorLocation_C::ActorKey' has a wrong offset!");
static_assert(offsetof(UBTT_GetActorLocation_C, ActorLocationKey) == 0x0000D8, "Member 'UBTT_GetActorLocation_C::ActorLocationKey' has a wrong offset!");

}

