#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_SetIsAttacking

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_SetIsAttacking.BTT_SetIsAttacking_C
// 0x0038 (0x00E0 - 0x00A8)
class UBTT_SetIsAttacking_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 IsAttackingKey;                                    // 0x00B0(0x0028)(Edit, BlueprintVisible)
	bool                                          IsAttacking;                                       // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ExecuteUbergraph_BTT_SetIsAttacking(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_SetIsAttacking_C">();
	}
	static class UBTT_SetIsAttacking_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_SetIsAttacking_C>();
	}
};
static_assert(alignof(UBTT_SetIsAttacking_C) == 0x000008, "Wrong alignment on UBTT_SetIsAttacking_C");
static_assert(sizeof(UBTT_SetIsAttacking_C) == 0x0000E0, "Wrong size on UBTT_SetIsAttacking_C");
static_assert(offsetof(UBTT_SetIsAttacking_C, UberGraphFrame) == 0x0000A8, "Member 'UBTT_SetIsAttacking_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_SetIsAttacking_C, IsAttackingKey) == 0x0000B0, "Member 'UBTT_SetIsAttacking_C::IsAttackingKey' has a wrong offset!");
static_assert(offsetof(UBTT_SetIsAttacking_C, IsAttacking) == 0x0000D8, "Member 'UBTT_SetIsAttacking_C::IsAttacking' has a wrong offset!");

}

