#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_CameroidCapture

#include "Basic.hpp"

#include "S_CameroidActorScore_structs.hpp"
#include "E_ScoringTag_structs.hpp"
#include "E_ScoringCategory_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_CameroidCapture.S_CameroidCapture
// 0x0040 (0x0040 - 0x0000)
struct FS_CameroidCapture final
{
public:
	int32                                         Id_40_3E0588E54DC08C69529F89AD190A7781;            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         SteamId_42_39072B3746DA88C7F49259B9E1C8DD31;       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_CameroidActorScore>          ActorsScores_14_49FFBB4548E6E31F47D1F5B2B4AFDE88;  // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<E_ScoringTag>                          Tags_27_22E8F7B64B4137DE978A4FA5B5D40C3C;          // 0x0020(0x0010)(Edit, BlueprintVisible)
	E_ScoringCategory                             Category_45_D40AE6834BDA8475A7363CB1F0C89117;      // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Score_31_81DFD9D345A8E9BC2A0642BDAF61D033;         // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CameraMultiplier_48_1255F75D4F6E5E07C21019849316C4C6; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_CameroidCapture) == 0x000008, "Wrong alignment on FS_CameroidCapture");
static_assert(sizeof(FS_CameroidCapture) == 0x000040, "Wrong size on FS_CameroidCapture");
static_assert(offsetof(FS_CameroidCapture, Id_40_3E0588E54DC08C69529F89AD190A7781) == 0x000000, "Member 'FS_CameroidCapture::Id_40_3E0588E54DC08C69529F89AD190A7781' has a wrong offset!");
static_assert(offsetof(FS_CameroidCapture, SteamId_42_39072B3746DA88C7F49259B9E1C8DD31) == 0x000008, "Member 'FS_CameroidCapture::SteamId_42_39072B3746DA88C7F49259B9E1C8DD31' has a wrong offset!");
static_assert(offsetof(FS_CameroidCapture, ActorsScores_14_49FFBB4548E6E31F47D1F5B2B4AFDE88) == 0x000010, "Member 'FS_CameroidCapture::ActorsScores_14_49FFBB4548E6E31F47D1F5B2B4AFDE88' has a wrong offset!");
static_assert(offsetof(FS_CameroidCapture, Tags_27_22E8F7B64B4137DE978A4FA5B5D40C3C) == 0x000020, "Member 'FS_CameroidCapture::Tags_27_22E8F7B64B4137DE978A4FA5B5D40C3C' has a wrong offset!");
static_assert(offsetof(FS_CameroidCapture, Category_45_D40AE6834BDA8475A7363CB1F0C89117) == 0x000030, "Member 'FS_CameroidCapture::Category_45_D40AE6834BDA8475A7363CB1F0C89117' has a wrong offset!");
static_assert(offsetof(FS_CameroidCapture, Score_31_81DFD9D345A8E9BC2A0642BDAF61D033) == 0x000034, "Member 'FS_CameroidCapture::Score_31_81DFD9D345A8E9BC2A0642BDAF61D033' has a wrong offset!");
static_assert(offsetof(FS_CameroidCapture, CameraMultiplier_48_1255F75D4F6E5E07C21019849316C4C6) == 0x000038, "Member 'FS_CameroidCapture::CameraMultiplier_48_1255F75D4F6E5E07C21019849316C4C6' has a wrong offset!");

}

