#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_Emote

#include "Basic.hpp"

#include "E_Emote_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_Emote.S_Emote
// 0x0028 (0x0028 - 0x0000)
struct FS_Emote final
{
public:
	E_Emote                                       Emote_2_0F40439A4ED40E0AF6B820A3A791CA70;          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      Animation_5_807C70D045D4195755F4D2ADDE5588D5;      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        MinDuration_8_116BECAE45AEA9560FCC5BA7B4AA0C5B;    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Icon_11_558E333042F6E736958805AB6C80C8CB;          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CameraShake_14_94E8047D47A8756812D6BB87C0AB5899;   // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_Emote) == 0x000008, "Wrong alignment on FS_Emote");
static_assert(sizeof(FS_Emote) == 0x000028, "Wrong size on FS_Emote");
static_assert(offsetof(FS_Emote, Emote_2_0F40439A4ED40E0AF6B820A3A791CA70) == 0x000000, "Member 'FS_Emote::Emote_2_0F40439A4ED40E0AF6B820A3A791CA70' has a wrong offset!");
static_assert(offsetof(FS_Emote, Animation_5_807C70D045D4195755F4D2ADDE5588D5) == 0x000008, "Member 'FS_Emote::Animation_5_807C70D045D4195755F4D2ADDE5588D5' has a wrong offset!");
static_assert(offsetof(FS_Emote, MinDuration_8_116BECAE45AEA9560FCC5BA7B4AA0C5B) == 0x000010, "Member 'FS_Emote::MinDuration_8_116BECAE45AEA9560FCC5BA7B4AA0C5B' has a wrong offset!");
static_assert(offsetof(FS_Emote, Icon_11_558E333042F6E736958805AB6C80C8CB) == 0x000018, "Member 'FS_Emote::Icon_11_558E333042F6E736958805AB6C80C8CB' has a wrong offset!");
static_assert(offsetof(FS_Emote, CameraShake_14_94E8047D47A8756812D6BB87C0AB5899) == 0x000020, "Member 'FS_Emote::CameraShake_14_94E8047D47A8756812D6BB87C0AB5899' has a wrong offset!");

}

