#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_EpisodeDefinition

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_EpisodeDefinition.S_EpisodeDefinition
// 0x0020 (0x0020 - 0x0000)
struct FS_EpisodeDefinition final
{
public:
	int32                                         Difficulty_4_D11D5F4A48922D261853DB95B306C2BA;     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Days_5_016C7647416C3B0F54F172AAE30B84CA;           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Goal_7_57095CC7453F0E027DF368B87B12186D;           // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Reward_9_0E634644461376EB53870B863864DC5A;         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Maps_13_E22643E94C516FD645A6B0BD37EAF94F;          // 0x0010(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FS_EpisodeDefinition) == 0x000008, "Wrong alignment on FS_EpisodeDefinition");
static_assert(sizeof(FS_EpisodeDefinition) == 0x000020, "Wrong size on FS_EpisodeDefinition");
static_assert(offsetof(FS_EpisodeDefinition, Difficulty_4_D11D5F4A48922D261853DB95B306C2BA) == 0x000000, "Member 'FS_EpisodeDefinition::Difficulty_4_D11D5F4A48922D261853DB95B306C2BA' has a wrong offset!");
static_assert(offsetof(FS_EpisodeDefinition, Days_5_016C7647416C3B0F54F172AAE30B84CA) == 0x000004, "Member 'FS_EpisodeDefinition::Days_5_016C7647416C3B0F54F172AAE30B84CA' has a wrong offset!");
static_assert(offsetof(FS_EpisodeDefinition, Goal_7_57095CC7453F0E027DF368B87B12186D) == 0x000008, "Member 'FS_EpisodeDefinition::Goal_7_57095CC7453F0E027DF368B87B12186D' has a wrong offset!");
static_assert(offsetof(FS_EpisodeDefinition, Reward_9_0E634644461376EB53870B863864DC5A) == 0x00000C, "Member 'FS_EpisodeDefinition::Reward_9_0E634644461376EB53870B863864DC5A' has a wrong offset!");
static_assert(offsetof(FS_EpisodeDefinition, Maps_13_E22643E94C516FD645A6B0BD37EAF94F) == 0x000010, "Member 'FS_EpisodeDefinition::Maps_13_E22643E94C516FD645A6B0BD37EAF94F' has a wrong offset!");

}

