#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_FrozenRagdoll

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_FrozenRagdoll.S_FrozenRagdoll
// 0x0040 (0x0040 - 0x0000)
struct FS_FrozenRagdoll final
{
public:
	TArray<struct FVector>                        Positions_7_9641FAC54A87279BC7DABDB5AFF88132;      // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<struct FRotator>                       Rotations_3_CBD99BEA4DBC7C1F6456F88023444CEA;      // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<struct FVector>                        Velocities_11_FFD41348478F73FEC72CC29C8276C2A3;    // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<struct FVector>                        AngularVelocities_13_92A5585C43E035EA41D89A9C585DD04F; // 0x0030(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FS_FrozenRagdoll) == 0x000008, "Wrong alignment on FS_FrozenRagdoll");
static_assert(sizeof(FS_FrozenRagdoll) == 0x000040, "Wrong size on FS_FrozenRagdoll");
static_assert(offsetof(FS_FrozenRagdoll, Positions_7_9641FAC54A87279BC7DABDB5AFF88132) == 0x000000, "Member 'FS_FrozenRagdoll::Positions_7_9641FAC54A87279BC7DABDB5AFF88132' has a wrong offset!");
static_assert(offsetof(FS_FrozenRagdoll, Rotations_3_CBD99BEA4DBC7C1F6456F88023444CEA) == 0x000010, "Member 'FS_FrozenRagdoll::Rotations_3_CBD99BEA4DBC7C1F6456F88023444CEA' has a wrong offset!");
static_assert(offsetof(FS_FrozenRagdoll, Velocities_11_FFD41348478F73FEC72CC29C8276C2A3) == 0x000020, "Member 'FS_FrozenRagdoll::Velocities_11_FFD41348478F73FEC72CC29C8276C2A3' has a wrong offset!");
static_assert(offsetof(FS_FrozenRagdoll, AngularVelocities_13_92A5585C43E035EA41D89A9C585DD04F) == 0x000030, "Member 'FS_FrozenRagdoll::AngularVelocities_13_92A5585C43E035EA41D89A9C585DD04F' has a wrong offset!");

}

