#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_InventoryItem

#include "Basic.hpp"

#include "E_InventoryItem_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_InventoryItem.S_InventoryItem
// 0x0068 (0x0068 - 0x0000)
struct FS_InventoryItem final
{
public:
	E_InventoryItem                               Item_21_DB455F21428F6C520F40338B53941CC5;          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_37_043B27C042362B36E1C9E0A63C586440;          // 0x0008(0x0018)(Edit, BlueprintVisible)
	class UTexture2D*                             Icon_6_1DA468F4409D69D62C900C8353B8E5D3;           // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Actor_16_A51C7023493C49AD1F583F9E82DE99F6;         // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Socket_13_4D53B5E043ED32BE5D2AC0AAE28850C1;        // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 PickupItem_24_552656C449C49DEE07667489935376C1;    // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Persistent_19_EA2EB6E94FDA271196ACA3ADD6E049B1;    // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Price_27_9A8917204779C3183BB8E0A39C57DC94;         // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Description_34_38218FF9436BB6230B74D3B8757B4C73;   // 0x0048(0x0018)(Edit, BlueprintVisible)
	bool                                          CanStore_36_A4657DA34B3E0F0828E02687E9161F15;      // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_InventoryItem) == 0x000008, "Wrong alignment on FS_InventoryItem");
static_assert(sizeof(FS_InventoryItem) == 0x000068, "Wrong size on FS_InventoryItem");
static_assert(offsetof(FS_InventoryItem, Item_21_DB455F21428F6C520F40338B53941CC5) == 0x000000, "Member 'FS_InventoryItem::Item_21_DB455F21428F6C520F40338B53941CC5' has a wrong offset!");
static_assert(offsetof(FS_InventoryItem, Name_37_043B27C042362B36E1C9E0A63C586440) == 0x000008, "Member 'FS_InventoryItem::Name_37_043B27C042362B36E1C9E0A63C586440' has a wrong offset!");
static_assert(offsetof(FS_InventoryItem, Icon_6_1DA468F4409D69D62C900C8353B8E5D3) == 0x000020, "Member 'FS_InventoryItem::Icon_6_1DA468F4409D69D62C900C8353B8E5D3' has a wrong offset!");
static_assert(offsetof(FS_InventoryItem, Actor_16_A51C7023493C49AD1F583F9E82DE99F6) == 0x000028, "Member 'FS_InventoryItem::Actor_16_A51C7023493C49AD1F583F9E82DE99F6' has a wrong offset!");
static_assert(offsetof(FS_InventoryItem, Socket_13_4D53B5E043ED32BE5D2AC0AAE28850C1) == 0x000030, "Member 'FS_InventoryItem::Socket_13_4D53B5E043ED32BE5D2AC0AAE28850C1' has a wrong offset!");
static_assert(offsetof(FS_InventoryItem, PickupItem_24_552656C449C49DEE07667489935376C1) == 0x000038, "Member 'FS_InventoryItem::PickupItem_24_552656C449C49DEE07667489935376C1' has a wrong offset!");
static_assert(offsetof(FS_InventoryItem, Persistent_19_EA2EB6E94FDA271196ACA3ADD6E049B1) == 0x000040, "Member 'FS_InventoryItem::Persistent_19_EA2EB6E94FDA271196ACA3ADD6E049B1' has a wrong offset!");
static_assert(offsetof(FS_InventoryItem, Price_27_9A8917204779C3183BB8E0A39C57DC94) == 0x000044, "Member 'FS_InventoryItem::Price_27_9A8917204779C3183BB8E0A39C57DC94' has a wrong offset!");
static_assert(offsetof(FS_InventoryItem, Description_34_38218FF9436BB6230B74D3B8757B4C73) == 0x000048, "Member 'FS_InventoryItem::Description_34_38218FF9436BB6230B74D3B8757B4C73' has a wrong offset!");
static_assert(offsetof(FS_InventoryItem, CanStore_36_A4657DA34B3E0F0828E02687E9161F15) == 0x000060, "Member 'FS_InventoryItem::CanStore_36_A4657DA34B3E0F0828E02687E9161F15' has a wrong offset!");

}

