#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_RareSpawn

#include "Basic.hpp"

#include "E_Spawnable_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_RareSpawn.S_RareSpawn
// 0x0068 (0x0068 - 0x0000)
struct FS_RareSpawn final
{
public:
	double                                        MinTime_10_9E4DE9234DC07014052989A140AEA1A4;       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxTime_12_95AA60EA42FA50481975DDA289FB7553;       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpawnChance_8_E799D6914394616BD890EAB7DB14CFF3;    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<E_Spawnable, int32>                      Spawnables_18_7740468A439034F2C76558A22464B3DD;    // 0x0018(0x0050)(Edit, BlueprintVisible)
};
static_assert(alignof(FS_RareSpawn) == 0x000008, "Wrong alignment on FS_RareSpawn");
static_assert(sizeof(FS_RareSpawn) == 0x000068, "Wrong size on FS_RareSpawn");
static_assert(offsetof(FS_RareSpawn, MinTime_10_9E4DE9234DC07014052989A140AEA1A4) == 0x000000, "Member 'FS_RareSpawn::MinTime_10_9E4DE9234DC07014052989A140AEA1A4' has a wrong offset!");
static_assert(offsetof(FS_RareSpawn, MaxTime_12_95AA60EA42FA50481975DDA289FB7553) == 0x000008, "Member 'FS_RareSpawn::MaxTime_12_95AA60EA42FA50481975DDA289FB7553' has a wrong offset!");
static_assert(offsetof(FS_RareSpawn, SpawnChance_8_E799D6914394616BD890EAB7DB14CFF3) == 0x000010, "Member 'FS_RareSpawn::SpawnChance_8_E799D6914394616BD890EAB7DB14CFF3' has a wrong offset!");
static_assert(offsetof(FS_RareSpawn, Spawnables_18_7740468A439034F2C76558A22464B3DD) == 0x000018, "Member 'FS_RareSpawn::Spawnables_18_7740468A439034F2C76558A22464B3DD' has a wrong offset!");

}

