#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_SpawnWaveElement

#include "Basic.hpp"

#include "E_SpawnContext_structs.hpp"
#include "E_Spawnable_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_SpawnWaveElement.S_SpawnWaveElement
// 0x0020 (0x0020 - 0x0000)
struct FS_SpawnWaveElement final
{
public:
	int32                                         MinCount_13_67741AD9486594C4E2D9DDB11D884D1B;      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxCount_10_067DC6E3423014E05E3376A2E1EC3D64;      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SpawnContext                                Context_9_358053654F07B2536C63EF86B1EC066F;        // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<E_Spawnable>                           Spawnables_6_CAD9DA5C40A33EF3156DA290676B9680;     // 0x0010(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FS_SpawnWaveElement) == 0x000008, "Wrong alignment on FS_SpawnWaveElement");
static_assert(sizeof(FS_SpawnWaveElement) == 0x000020, "Wrong size on FS_SpawnWaveElement");
static_assert(offsetof(FS_SpawnWaveElement, MinCount_13_67741AD9486594C4E2D9DDB11D884D1B) == 0x000000, "Member 'FS_SpawnWaveElement::MinCount_13_67741AD9486594C4E2D9DDB11D884D1B' has a wrong offset!");
static_assert(offsetof(FS_SpawnWaveElement, MaxCount_10_067DC6E3423014E05E3376A2E1EC3D64) == 0x000004, "Member 'FS_SpawnWaveElement::MaxCount_10_067DC6E3423014E05E3376A2E1EC3D64' has a wrong offset!");
static_assert(offsetof(FS_SpawnWaveElement, Context_9_358053654F07B2536C63EF86B1EC066F) == 0x000008, "Member 'FS_SpawnWaveElement::Context_9_358053654F07B2536C63EF86B1EC066F' has a wrong offset!");
static_assert(offsetof(FS_SpawnWaveElement, Spawnables_6_CAD9DA5C40A33EF3156DA290676B9680) == 0x000010, "Member 'FS_SpawnWaveElement::Spawnables_6_CAD9DA5C40A33EF3156DA290676B9680' has a wrong offset!");

}

