#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_SpawnRules

#include "Basic.hpp"

#include "E_Spawnable_structs.hpp"
#include "S_SpawnWave_structs.hpp"
#include "S_VariantsProbabilities_structs.hpp"
#include "S_RareSpawn_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_SpawnRules.S_SpawnRules
// 0x0070 (0x0070 - 0x0000)
struct FS_SpawnRules final
{
public:
	TArray<struct FS_SpawnWave>                   SpawnWaves_7_3F4CC64845BC89B3CF08E38A3AC89080;     // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<struct FS_RareSpawn>                   RareSpawns_8_101062864F43DFBF6415DBB9D566C89F;     // 0x0010(0x0010)(Edit, BlueprintVisible)
	TMap<E_Spawnable, struct FS_VariantsProbabilities> Variants_16_B5783BD44D248BC965260E9C35671EC4; // 0x0020(0x0050)(Edit, BlueprintVisible)
};
static_assert(alignof(FS_SpawnRules) == 0x000008, "Wrong alignment on FS_SpawnRules");
static_assert(sizeof(FS_SpawnRules) == 0x000070, "Wrong size on FS_SpawnRules");
static_assert(offsetof(FS_SpawnRules, SpawnWaves_7_3F4CC64845BC89B3CF08E38A3AC89080) == 0x000000, "Member 'FS_SpawnRules::SpawnWaves_7_3F4CC64845BC89B3CF08E38A3AC89080' has a wrong offset!");
static_assert(offsetof(FS_SpawnRules, RareSpawns_8_101062864F43DFBF6415DBB9D566C89F) == 0x000010, "Member 'FS_SpawnRules::RareSpawns_8_101062864F43DFBF6415DBB9D566C89F' has a wrong offset!");
static_assert(offsetof(FS_SpawnRules, Variants_16_B5783BD44D248BC965260E9C35671EC4) == 0x000020, "Member 'FS_SpawnRules::Variants_16_B5783BD44D248BC965260E9C35671EC4' has a wrong offset!");

}

