#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_RulesBorder

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct ST_RulesBorder.ST_RulesBorder
// 0x0028 (0x0028 - 0x0000)
struct FST_RulesBorder final
{
public:
	class UStaticMesh*                            SimpleBorder_8_F8E2EFE54FF3FA76E67CB881BBF19BBE;   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CornerBorder_7_413B6B0C4E647B21752E57BD0C8B6CF9;   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            ConcaveCornerBorder_14_903DC65E4C99DEEF21FFE5846DEA14BE; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CornerSplineBorder_6_1B7C6F7D471861D895AB858F22554C3F; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            EndBorder_11_C120F20F4827954CAF6F1AB46215DF81;     // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_RulesBorder) == 0x000008, "Wrong alignment on FST_RulesBorder");
static_assert(sizeof(FST_RulesBorder) == 0x000028, "Wrong size on FST_RulesBorder");
static_assert(offsetof(FST_RulesBorder, SimpleBorder_8_F8E2EFE54FF3FA76E67CB881BBF19BBE) == 0x000000, "Member 'FST_RulesBorder::SimpleBorder_8_F8E2EFE54FF3FA76E67CB881BBF19BBE' has a wrong offset!");
static_assert(offsetof(FST_RulesBorder, CornerBorder_7_413B6B0C4E647B21752E57BD0C8B6CF9) == 0x000008, "Member 'FST_RulesBorder::CornerBorder_7_413B6B0C4E647B21752E57BD0C8B6CF9' has a wrong offset!");
static_assert(offsetof(FST_RulesBorder, ConcaveCornerBorder_14_903DC65E4C99DEEF21FFE5846DEA14BE) == 0x000010, "Member 'FST_RulesBorder::ConcaveCornerBorder_14_903DC65E4C99DEEF21FFE5846DEA14BE' has a wrong offset!");
static_assert(offsetof(FST_RulesBorder, CornerSplineBorder_6_1B7C6F7D471861D895AB858F22554C3F) == 0x000018, "Member 'FST_RulesBorder::CornerSplineBorder_6_1B7C6F7D471861D895AB858F22554C3F' has a wrong offset!");
static_assert(offsetof(FST_RulesBorder, EndBorder_11_C120F20F4827954CAF6F1AB46215DF81) == 0x000020, "Member 'FST_RulesBorder::EndBorder_11_C120F20F4827954CAF6F1AB46215DF81' has a wrong offset!");

}

