#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SteamIntegrationKit

#include "Basic.hpp"

#include "SteamIntegrationKit_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "OnlineSubsystemUtils_structs.hpp"


namespace SDK
{

// Class SteamIntegrationKit.HostMigrationSubsystem
// 0x0040 (0x0070 - 0x0030)
class UHostMigrationSubsystem final : public UGameInstanceSubsystem
{
public:
	TMulticastInlineDelegate<void(const struct FSIK_SteamId& LobbyID, bool bLocalPlayerHost)> OnHostMigration; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x30];                                      // 0x0040(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void StartHostMigration(const struct FSIK_SteamId& LobbyID);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HostMigrationSubsystem">();
	}
	static class UHostMigrationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHostMigrationSubsystem>();
	}
};
static_assert(alignof(UHostMigrationSubsystem) == 0x000008, "Wrong alignment on UHostMigrationSubsystem");
static_assert(sizeof(UHostMigrationSubsystem) == 0x000070, "Wrong size on UHostMigrationSubsystem");
static_assert(offsetof(UHostMigrationSubsystem, OnHostMigration) == 0x000030, "Member 'UHostMigrationSubsystem::OnHostMigration' has a wrong offset!");

// Class SteamIntegrationKit.SIK_RemoveDependency_AsyncFunction
// 0x0060 (0x0090 - 0x0030)
class USIK_RemoveDependency_AsyncFunction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(ESIK_Result Result, const struct FSIK_PublishedFileId& ParentPublishedFileID, const struct FSIK_PublishedFileId& ChildPublishedFileID)> OnSuccess; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(ESIK_Result Result, const struct FSIK_PublishedFileId& ParentPublishedFileID, const struct FSIK_PublishedFileId& ChildPublishedFileID)> OnFailure; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x40];                                      // 0x0050(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USIK_RemoveDependency_AsyncFunction* RemoveDependency(const struct FSIK_PublishedFileId& ParentPublishedFileID, const struct FSIK_PublishedFileId& ChildPublishedFileID);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SIK_RemoveDependency_AsyncFunction">();
	}
	static class USIK_RemoveDependency_AsyncFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USIK_RemoveDependency_AsyncFunction>();
	}
};
static_assert(alignof(USIK_RemoveDependency_AsyncFunction) == 0x000008, "Wrong alignment on USIK_RemoveDependency_AsyncFunction");
static_assert(sizeof(USIK_RemoveDependency_AsyncFunction) == 0x000090, "Wrong size on USIK_RemoveDependency_AsyncFunction");
static_assert(offsetof(USIK_RemoveDependency_AsyncFunction, OnSuccess) == 0x000030, "Member 'USIK_RemoveDependency_AsyncFunction::OnSuccess' has a wrong offset!");
static_assert(offsetof(USIK_RemoveDependency_AsyncFunction, OnFailure) == 0x000040, "Member 'USIK_RemoveDependency_AsyncFunction::OnFailure' has a wrong offset!");

// Class SteamIntegrationKit.SIKSettings
// 0x00A8 (0x00E0 - 0x0038)
class USIKSettings final : public UDeveloperSettings
{
public:
	class FString                                 GameVersion;                                       // 0x0038(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SteamAppId;                                        // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SteamDevAppId;                                     // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRelaunchInSteam;                                  // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         GameServerPort;                                    // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         P2PConnectionTimeout;                              // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESIK_BuildConfiguration                       BuildConfiguration;                                // 0x005C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         MapsToCook;                                        // 0x0060(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 DepotIds;                                          // 0x0070(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 BranchName;                                        // 0x0080(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Username;                                          // 0x0090(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Password;                                          // 0x00A0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerName;                                        // 0x00B0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerDescription;                                 // 0x00C0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerGameDir;                                     // 0x00D0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SIKSettings">();
	}
	static class USIKSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USIKSettings>();
	}
};
static_assert(alignof(USIKSettings) == 0x000008, "Wrong alignment on USIKSettings");
static_assert(sizeof(USIKSettings) == 0x0000E0, "Wrong size on USIKSettings");
static_assert(offsetof(USIKSettings, GameVersion) == 0x000038, "Member 'USIKSettings::GameVersion' has a wrong offset!");
static_assert(offsetof(USIKSettings, SteamAppId) == 0x000048, "Member 'USIKSettings::SteamAppId' has a wrong offset!");
static_assert(offsetof(USIKSettings, SteamDevAppId) == 0x00004C, "Member 'USIKSettings::SteamDevAppId' has a wrong offset!");
static_assert(offsetof(USIKSettings, bRelaunchInSteam) == 0x000050, "Member 'USIKSettings::bRelaunchInSteam' has a wrong offset!");
static_assert(offsetof(USIKSettings, GameServerPort) == 0x000054, "Member 'USIKSettings::GameServerPort' has a wrong offset!");
static_assert(offsetof(USIKSettings, P2PConnectionTimeout) == 0x000058, "Member 'USIKSettings::P2PConnectionTimeout' has a wrong offset!");
static_assert(offsetof(USIKSettings, BuildConfiguration) == 0x00005C, "Member 'USIKSettings::BuildConfiguration' has a wrong offset!");
static_assert(offsetof(USIKSettings, MapsToCook) == 0x000060, "Member 'USIKSettings::MapsToCook' has a wrong offset!");
static_assert(offsetof(USIKSettings, DepotIds) == 0x000070, "Member 'USIKSettings::DepotIds' has a wrong offset!");
static_assert(offsetof(USIKSettings, BranchName) == 0x000080, "Member 'USIKSettings::BranchName' has a wrong offset!");
static_assert(offsetof(USIKSettings, Username) == 0x000090, "Member 'USIKSettings::Username' has a wrong offset!");
static_assert(offsetof(USIKSettings, Password) == 0x0000A0, "Member 'USIKSettings::Password' has a wrong offset!");
static_assert(offsetof(USIKSettings, ServerName) == 0x0000B0, "Member 'USIKSettings::ServerName' has a wrong offset!");
static_assert(offsetof(USIKSettings, ServerDescription) == 0x0000C0, "Member 'USIKSettings::ServerDescription' has a wrong offset!");
static_assert(offsetof(USIKSettings, ServerGameDir) == 0x0000D0, "Member 'USIKSettings::ServerGameDir' has a wrong offset!");

// Class SteamIntegrationKit.SIK_AddAppDependency_AsyncFunction
// 0x0060 (0x0090 - 0x0030)
class USIK_AddAppDependency_AsyncFunction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(ESIK_Result Result, const struct FSIK_PublishedFileId& PublishedFileId, const struct FSIK_AppId& AppID)> OnSuccess; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(ESIK_Result Result, const struct FSIK_PublishedFileId& PublishedFileId, const struct FSIK_AppId& AppID)> OnFailure; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x40];                                      // 0x0050(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USIK_AddAppDependency_AsyncFunction* AddAppDependency(const struct FSIK_PublishedFileId& PublishedFileId, const struct FSIK_AppId& AppID);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SIK_AddAppDependency_AsyncFunction">();
	}
	static class USIK_AddAppDependency_AsyncFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USIK_AddAppDependency_AsyncFunction>();
	}
};
static_assert(alignof(USIK_AddAppDependency_AsyncFunction) == 0x000008, "Wrong alignment on USIK_AddAppDependency_AsyncFunction");
static_assert(sizeof(USIK_AddAppDependency_AsyncFunction) == 0x000090, "Wrong size on USIK_AddAppDependency_AsyncFunction");
static_assert(offsetof(USIK_AddAppDependency_AsyncFunction, OnSuccess) == 0x000030, "Member 'USIK_AddAppDependency_AsyncFunction::OnSuccess' has a wrong offset!");
static_assert(offsetof(USIK_AddAppDependency_AsyncFunction, OnFailure) == 0x000040, "Member 'USIK_AddAppDependency_AsyncFunction::OnFailure' has a wrong offset!");

// Class SteamIntegrationKit.SIK_AddDependency_AsyncFunction
// 0x0060 (0x0090 - 0x0030)
class USIK_AddDependency_AsyncFunction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(ESIK_Result Result, const struct FSIK_PublishedFileId& ParentPublishedFileID, const struct FSIK_PublishedFileId& ChildPublishedFileID)> OnSuccess; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(ESIK_Result Result, const struct FSIK_PublishedFileId& ParentPublishedFileID, const struct FSIK_PublishedFileId& ChildPublishedFileID)> OnFailure; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x40];                                      // 0x0050(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USIK_AddDependency_AsyncFunction* AddDependency(const struct FSIK_PublishedFileId& ParentPublishedFileID, const struct FSIK_PublishedFileId& ChildPublishedFileID);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SIK_AddDependency_AsyncFunction">();
	}
	static class USIK_AddDependency_AsyncFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USIK_AddDependency_AsyncFunction>();
	}
};
static_assert(alignof(USIK_AddDependency_AsyncFunction) == 0x000008, "Wrong alignment on USIK_AddDependency_AsyncFunction");
static_assert(sizeof(USIK_AddDependency_AsyncFunction) == 0x000090, "Wrong size on USIK_AddDependency_AsyncFunction");
static_assert(offsetof(USIK_AddDependency_AsyncFunction, OnSuccess) == 0x000030, "Member 'USIK_AddDependency_AsyncFunction::OnSuccess' has a wrong offset!");
static_assert(offsetof(USIK_AddDependency_AsyncFunction, OnFailure) == 0x000040, "Member 'USIK_AddDependency_AsyncFunction::OnFailure' has a wrong offset!");

// Class SteamIntegrationKit.SIK_AddItemToFavorites_AsyncFunction
// 0x0060 (0x0090 - 0x0030)
class USIK_AddItemToFavorites_AsyncFunction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(ESIK_Result Result, const struct FSIK_PublishedFileId& PublishedFileId, bool bWasAddRequest)> OnSuccess; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(ESIK_Result Result, const struct FSIK_PublishedFileId& PublishedFileId, bool bWasAddRequest)> OnFailure; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x40];                                      // 0x0050(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USIK_AddItemToFavorites_AsyncFunction* AddItemToFavorites(const struct FSIK_AppId& AppID, const struct FSIK_PublishedFileId& PublishedFileId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SIK_AddItemToFavorites_AsyncFunction">();
	}
	static class USIK_AddItemToFavorites_AsyncFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USIK_AddItemToFavorites_AsyncFunction>();
	}
};
static_assert(alignof(USIK_AddItemToFavorites_AsyncFunction) == 0x000008, "Wrong alignment on USIK_AddItemToFavorites_AsyncFunction");
static_assert(sizeof(USIK_AddItemToFavorites_AsyncFunction) == 0x000090, "Wrong size on USIK_AddItemToFavorites_AsyncFunction");
static_assert(offsetof(USIK_AddItemToFavorites_AsyncFunction, OnSuccess) == 0x000030, "Member 'USIK_AddItemToFavorites_AsyncFunction::OnSuccess' has a wrong offset!");
static_assert(offsetof(USIK_AddItemToFavorites_AsyncFunction, OnFailure) == 0x000040, "Member 'USIK_AddItemToFavorites_AsyncFunction::OnFailure' has a wrong offset!");

// Class SteamIntegrationKit.SIK_RequestEncryptedAppTicket_AsyncFunction
// 0x0060 (0x0090 - 0x0030)
class USIK_RequestEncryptedAppTicket_AsyncFunction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(ESIK_Result Result)> OnSuccess;                                    // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(ESIK_Result Result)> OnFailure;                                    // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x40];                                      // 0x0050(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USIK_RequestEncryptedAppTicket_AsyncFunction* RequestEncryptedAppTicket(const TArray<uint8>& EncryptedAppTicket);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SIK_RequestEncryptedAppTicket_AsyncFunction">();
	}
	static class USIK_RequestEncryptedAppTicket_AsyncFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USIK_RequestEncryptedAppTicket_AsyncFunction>();
	}
};
static_assert(alignof(USIK_RequestEncryptedAppTicket_AsyncFunction) == 0x000008, "Wrong alignment on USIK_RequestEncryptedAppTicket_AsyncFunction");
static_assert(sizeof(USIK_RequestEncryptedAppTicket_AsyncFunction) == 0x000090, "Wrong size on USIK_RequestEncryptedAppTicket_AsyncFunction");
static_assert(offsetof(USIK_RequestEncryptedAppTicket_AsyncFunction, OnSuccess) == 0x000030, "Member 'USIK_RequestEncryptedAppTicket_AsyncFunction::OnSuccess' has a wrong offset!");
static_assert(offsetof(USIK_RequestEncryptedAppTicket_AsyncFunction, OnFailure) == 0x000040, "Member 'USIK_RequestEncryptedAppTicket_AsyncFunction::OnFailure' has a wrong offset!");

// Class SteamIntegrationKit.SIK_AppLibrary
// 0x0000 (0x0028 - 0x0028)
class USIK_AppLibrary final : public UBlueprintFunctionLibrary
{
public:
	static int32 GetAppBuildID();
	static class FString GetAppInstallDir(int32 AppID);
	static struct FSIK_SteamId GetAppOwner();
	static TArray<class FString> GetAvailableGameLanguages();
	static bool GetCurrentBetaName(class FString* Name_0);
	static class FString GetCurrentGameLanguage();
	static int32 GetDLCCount();
	static bool GetDLCDataByIndex(int32 Index_0, struct FSIK_AppId* AppID, bool* Available, class FString* Name_0);
	static bool GetDLCDownloadProgress(const struct FSIK_AppId& AppID, int64* BytesDownloaded, int64* BytesTotal);
	static int32 GetEarliestPurchaseUnixTime(const struct FSIK_AppId& AppID);
	static TArray<int32> GetInstalledDepots(const struct FSIK_AppId& AppID);
	static int32 GetLaunchCommandLine(class FString* CommandLine);
	static class FString GetLaunchQueryParam(const class FString& Key);
	static void InstallDLC(const struct FSIK_AppId& AppID);
	static bool IsAppInstalled(const struct FSIK_AppId& AppID);
	static bool IsCybercafe();
	static bool IsDLCInstalled(int32 AppID);
	static bool IsLowViolence();
	static bool IsSubscribed();
	static bool IsSubscribedApp(int32 AppID);
	static bool IsSubscribedFromFamilySharing();
	static bool IsSubscribedFromFreeWeekend();
	static bool IsTimedTrial(int32* SecondsAllowed, int32* SecondsPlayed);
	static bool IsVACBanned();
	static bool MarkContentCorrupt(bool MissingFilesOnly);
	static void UninstallDLC(const struct FSIK_AppId& AppID);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SIK_AppLibrary">();
	}
	static class USIK_AppLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<USIK_AppLibrary>();
	}
};
static_assert(alignof(USIK_AppLibrary) == 0x000008, "Wrong alignment on USIK_AppLibrary");
static_assert(sizeof(USIK_AppLibrary) == 0x000028, "Wrong size on USIK_AppLibrary");

// Class SteamIntegrationKit.SIK_AppSubsystem
// 0x00C0 (0x00F0 - 0x0030)
class USIK_AppSubsystem final : public UGameInstanceSubsystem
{
public:
	TMulticastInlineDelegate<void(int32 AppID)>   OnDlcInstalled;                                    // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(ESIK_Result Result, int32 FileSize, int32 Flags, const TArray<uint8>& SHA)> OnFileDetails; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnNewUrlLaunchParameters;                          // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 AppID, bool bIsOffline, int32 SecondsAllowed, int32 SecondsPlayed)> OnTimedTrialStatus; // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x80];                                      // 0x0070(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SIK_AppSubsystem">();
	}
	static class USIK_AppSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USIK_AppSubsystem>();
	}
};
static_assert(alignof(USIK_AppSubsystem) == 0x000008, "Wrong alignment on USIK_AppSubsystem");
static_assert(sizeof(USIK_AppSubsystem) == 0x0000F0, "Wrong size on USIK_AppSubsystem");
static_assert(offsetof(USIK_AppSubsystem, OnDlcInstalled) == 0x000030, "Member 'USIK_AppSubsystem::OnDlcInstalled' has a wrong offset!");
static_assert(offsetof(USIK_AppSubsystem, OnFileDetails) == 0x000040, "Member 'USIK_AppSubsystem::OnFileDetails' has a wrong offset!");
static_assert(offsetof(USIK_AppSubsystem, OnNewUrlLaunchParameters) == 0x000050, "Member 'USIK_AppSubsystem::OnNewUrlLaunchParameters' has a wrong offset!");
static_assert(offsetof(USIK_AppSubsystem, OnTimedTrialStatus) == 0x000060, "Member 'USIK_AppSubsystem::OnTimedTrialStatus' has a wrong offset!");

// Class SteamIntegrationKit.SIK_RemoteStorageSubsystem
// 0x0180 (0x01B0 - 0x0030)
class USIK_RemoteStorageSubsystem final : public UGameInstanceSubsystem
{
public:
	TMulticastInlineDelegate<void(ESIK_Result Result, const struct FSIK_UGCHandle& UGCHandle, int32 AppID, const class FString& Filename, int32 Size, const struct FSIK_SteamId& SteamIDOwner)> OnRemoteStorageDownloadUGCResult; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(ESIK_Result Result, const struct FSIK_UGCHandle& FileHandle, const class FString& Filename)> OnRemoteStorageFileShareResult; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(ESIK_Result Result)> OnRemoteStorageFileWriteAsyncComplete;        // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FSIK_PublishedFileId& PublishedFileId, const struct FSIK_AppId& AppID)> OnRemoteStoragePublishedFileSubscribedComplete; // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FSIK_PublishedFileId& PublishedFileId, const struct FSIK_AppId& AppID)> OnRemoteStoragePublishedFileUnsubscribedComplete; // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FSIK_PublishedFileId& PublishedFileId, ESIK_Result Result)> OnRemoteStorageSubscribePublishedFileResult; // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FSIK_PublishedFileId& PublishedFileId, ESIK_Result Result)> OnRemoteStorageUnsubscribePublishedFileResult; // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRemoteStorageLocalFileChange;                    // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_B0[0x100];                                     // 0x00B0(0x0100)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SIK_RemoteStorageSubsystem">();
	}
	static class USIK_RemoteStorageSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USIK_RemoteStorageSubsystem>();
	}
};
static_assert(alignof(USIK_RemoteStorageSubsystem) == 0x000008, "Wrong alignment on USIK_RemoteStorageSubsystem");
static_assert(sizeof(USIK_RemoteStorageSubsystem) == 0x0001B0, "Wrong size on USIK_RemoteStorageSubsystem");
static_assert(offsetof(USIK_RemoteStorageSubsystem, OnRemoteStorageDownloadUGCResult) == 0x000030, "Member 'USIK_RemoteStorageSubsystem::OnRemoteStorageDownloadUGCResult' has a wrong offset!");
static_assert(offsetof(USIK_RemoteStorageSubsystem, OnRemoteStorageFileShareResult) == 0x000040, "Member 'USIK_RemoteStorageSubsystem::OnRemoteStorageFileShareResult' has a wrong offset!");
static_assert(offsetof(USIK_RemoteStorageSubsystem, OnRemoteStorageFileWriteAsyncComplete) == 0x000050, "Member 'USIK_RemoteStorageSubsystem::OnRemoteStorageFileWriteAsyncComplete' has a wrong offset!");
static_assert(offsetof(USIK_RemoteStorageSubsystem, OnRemoteStoragePublishedFileSubscribedComplete) == 0x000060, "Member 'USIK_RemoteStorageSubsystem::OnRemoteStoragePublishedFileSubscribedComplete' has a wrong offset!");
static_assert(offsetof(USIK_RemoteStorageSubsystem, OnRemoteStoragePublishedFileUnsubscribedComplete) == 0x000070, "Member 'USIK_RemoteStorageSubsystem::OnRemoteStoragePublishedFileUnsubscribedComplete' has a wrong offset!");
static_assert(offsetof(USIK_RemoteStorageSubsystem, OnRemoteStorageSubscribePublishedFileResult) == 0x000080, "Member 'USIK_RemoteStorageSubsystem::OnRemoteStorageSubscribePublishedFileResult' has a wrong offset!");
static_assert(offsetof(USIK_RemoteStorageSubsystem, OnRemoteStorageUnsubscribePublishedFileResult) == 0x000090, "Member 'USIK_RemoteStorageSubsystem::OnRemoteStorageUnsubscribePublishedFileResult' has a wrong offset!");
static_assert(offsetof(USIK_RemoteStorageSubsystem, OnRemoteStorageLocalFileChange) == 0x0000A0, "Member 'USIK_RemoteStorageSubsystem::OnRemoteStorageLocalFileChange' has a wrong offset!");

// Class SteamIntegrationKit.SIK_AssociateWithClan_AsyncFunction
// 0x0058 (0x0088 - 0x0030)
class USIK_AssociateWithClan_AsyncFunction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const ESIK_Result& Result)> OnSuccess;                             // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const ESIK_Result& Result)> OnFailure;                             // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x38];                                      // 0x0050(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USIK_AssociateWithClan_AsyncFunction* AssociateWithClan(const struct FSIK_SteamId& SteamIdClan);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SIK_AssociateWithClan_AsyncFunction">();
	}
	static class USIK_AssociateWithClan_AsyncFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USIK_AssociateWithClan_AsyncFunction>();
	}
};
static_assert(alignof(USIK_AssociateWithClan_AsyncFunction) == 0x000008, "Wrong alignment on USIK_AssociateWithClan_AsyncFunction");
static_assert(sizeof(USIK_AssociateWithClan_AsyncFunction) == 0x000088, "Wrong size on USIK_AssociateWithClan_AsyncFunction");
static_assert(offsetof(USIK_AssociateWithClan_AsyncFunction, OnSuccess) == 0x000030, "Member 'USIK_AssociateWithClan_AsyncFunction::OnSuccess' has a wrong offset!");
static_assert(offsetof(USIK_AssociateWithClan_AsyncFunction, OnFailure) == 0x000040, "Member 'USIK_AssociateWithClan_AsyncFunction::OnFailure' has a wrong offset!");

// Class SteamIntegrationKit.SIK_FindLeaderboard_AsyncFunction
// 0x0060 (0x0090 - 0x0030)
class USIK_FindLeaderboard_AsyncFunction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(int32 LeaderboardID)> OnSuccess;                                   // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 LeaderboardID)> OnFailure;                                   // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x40];                                      // 0x0050(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USIK_FindLeaderboard_AsyncFunction* FindLeaderboard(const class FString& LeaderboardName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SIK_FindLeaderboard_AsyncFunction">();
	}
	static class USIK_FindLeaderboard_AsyncFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USIK_FindLeaderboard_AsyncFunction>();
	}
};
static_assert(alignof(USIK_FindLeaderboard_AsyncFunction) == 0x000008, "Wrong alignment on USIK_FindLeaderboard_AsyncFunction");
static_assert(sizeof(USIK_FindLeaderboard_AsyncFunction) == 0x000090, "Wrong size on USIK_FindLeaderboard_AsyncFunction");
static_assert(offsetof(USIK_FindLeaderboard_AsyncFunction, OnSuccess) == 0x000030, "Member 'USIK_FindLeaderboard_AsyncFunction::OnSuccess' has a wrong offset!");
static_assert(offsetof(USIK_FindLeaderboard_AsyncFunction, OnFailure) == 0x000040, "Member 'USIK_FindLeaderboard_AsyncFunction::OnFailure' has a wrong offset!");

// Class SteamIntegrationKit.SIK_ChangeNumOpenSlots_AsyncFunction
// 0x0060 (0x0090 - 0x0030)
class USIK_ChangeNumOpenSlots_AsyncFunction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const ESIK_Result Result)> OnSuccess;                              // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const ESIK_Result Result)> OnFailure;                              // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x40];                                      // 0x0050(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USIK_ChangeNumOpenSlots_AsyncFunction* ChangeNumOpenSlots(const struct FSIK_PartyBeaconID& PartyBeaconID, int32 OpenSlots);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SIK_ChangeNumOpenSlots_AsyncFunction">();
	}
	static class USIK_ChangeNumOpenSlots_AsyncFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USIK_ChangeNumOpenSlots_AsyncFunction>();
	}
};
static_assert(alignof(USIK_ChangeNumOpenSlots_AsyncFunction) == 0x000008, "Wrong alignment on USIK_ChangeNumOpenSlots_AsyncFunction");
static_assert(sizeof(USIK_ChangeNumOpenSlots_AsyncFunction) == 0x000090, "Wrong size on USIK_ChangeNumOpenSlots_AsyncFunction");
static_assert(offsetof(USIK_ChangeNumOpenSlots_AsyncFunction, OnSuccess) == 0x000030, "Member 'USIK_ChangeNumOpenSlots_AsyncFunction::OnSuccess' has a wrong offset!");
static_assert(offsetof(USIK_ChangeNumOpenSlots_AsyncFunction, OnFailure) == 0x000040, "Member 'USIK_ChangeNumOpenSlots_AsyncFunction::OnFailure' has a wrong offset!");

// Class SteamIntegrationKit.SIK_ComputeNewPlayerCompatibility_AsyncFunction
// 0x0058 (0x0088 - 0x0030)
class USIK_ComputeNewPlayerCompatibility_AsyncFunction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const ESIK_Result& Result, int32 PlayersThatDontLikeCandidate, int32 PlayersThatCandidateDoesntLike, int32 ClanPlayersThatDontLikeCandidate)> OnSuccess; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const ESIK_Result& Result, int32 PlayersThatDontLikeCandidate, int32 PlayersThatCandidateDoesntLike, int32 ClanPlayersThatDontLikeCandidate)> OnFailure; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x38];                                      // 0x0050(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USIK_ComputeNewPlayerCompatibility_AsyncFunction* ComputeNewPlayerCompatibility(const struct FSIK_SteamId& PlayerSteamId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SIK_ComputeNewPlayerCompatibility_AsyncFunction">();
	}
	static class USIK_ComputeNewPlayerCompatibility_AsyncFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USIK_ComputeNewPlayerCompatibility_AsyncFunction>();
	}
};
static_assert(alignof(USIK_ComputeNewPlayerCompatibility_AsyncFunction) == 0x000008, "Wrong alignment on USIK_ComputeNewPlayerCompatibility_AsyncFunction");
static_assert(sizeof(USIK_ComputeNewPlayerCompatibility_AsyncFunction) == 0x000088, "Wrong size on USIK_ComputeNewPlayerCompatibility_AsyncFunction");
static_assert(offsetof(USIK_ComputeNewPlayerCompatibility_AsyncFunction, OnSuccess) == 0x000030, "Member 'USIK_ComputeNewPlayerCompatibility_AsyncFunction::OnSuccess' has a wrong offset!");
static_assert(offsetof(USIK_ComputeNewPlayerCompatibility_AsyncFunction, OnFailure) == 0x000040, "Member 'USIK_ComputeNewPlayerCompatibility_AsyncFunction::OnFailure' has a wrong offset!");

// Class SteamIntegrationKit.SIK_DownloadClanActivityCounts_AsyncFunction
// 0x0060 (0x0090 - 0x0030)
class USIK_DownloadClanActivityCounts_AsyncFunction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void()>              OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnFailure;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x40];                                      // 0x0050(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USIK_DownloadClanActivityCounts_AsyncFunction* DownloadClanActivityCounts(const TArray<int64>& ClanIds);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SIK_DownloadClanActivityCounts_AsyncFunction">();
	}
	static class USIK_DownloadClanActivityCounts_AsyncFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USIK_DownloadClanActivityCounts_AsyncFunction>();
	}
};
static_assert(alignof(USIK_DownloadClanActivityCounts_AsyncFunction) == 0x000008, "Wrong alignment on USIK_DownloadClanActivityCounts_AsyncFunction");
static_assert(sizeof(USIK_DownloadClanActivityCounts_AsyncFunction) == 0x000090, "Wrong size on USIK_DownloadClanActivityCounts_AsyncFunction");
static_assert(offsetof(USIK_DownloadClanActivityCounts_AsyncFunction, OnSuccess) == 0x000030, "Member 'USIK_DownloadClanActivityCounts_AsyncFunction::OnSuccess' has a wrong offset!");
static_assert(offsetof(USIK_DownloadClanActivityCounts_AsyncFunction, OnFailure) == 0x000040, "Member 'USIK_DownloadClanActivityCounts_AsyncFunction::OnFailure' has a wrong offset!");

// Class SteamIntegrationKit.SIK_CreateBeacon_AsyncFunction
// 0x0088 (0x00B8 - 0x0030)
class USIK_CreateBeacon_AsyncFunction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(ESIK_Result Result, const struct FSIK_PartyBeaconID& BeaconID)> OnSuccess; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(ESIK_Result Result, const struct FSIK_PartyBeaconID& BeaconID)> OnFailure; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x68];                                      // 0x0050(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USIK_CreateBeacon_AsyncFunction* CreateBeacon(int32 OpenSlots, const struct FSIK_SteamPartyBeaconLocation& Location, const class FString& ConnectString, const class FString& MetaData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SIK_CreateBeacon_AsyncFunction">();
	}
	static class USIK_CreateBeacon_AsyncFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USIK_CreateBeacon_AsyncFunction>();
	}
};
static_assert(alignof(USIK_CreateBeacon_AsyncFunction) == 0x000008, "Wrong alignment on USIK_CreateBeacon_AsyncFunction");
static_assert(sizeof(USIK_CreateBeacon_AsyncFunction) == 0x0000B8, "Wrong size on USIK_CreateBeacon_AsyncFunction");
static_assert(offsetof(USIK_CreateBeacon_AsyncFunction, OnSuccess) == 0x000030, "Member 'USIK_CreateBeacon_AsyncFunction::OnSuccess' has a wrong offset!");
static_assert(offsetof(USIK_CreateBeacon_AsyncFunction, OnFailure) == 0x000040, "Member 'USIK_CreateBeacon_AsyncFunction::OnFailure' has a wrong offset!");

// Class SteamIntegrationKit.SIK_CreateItem_AsyncFunction
// 0x0058 (0x0088 - 0x0030)
class USIK_CreateItem_AsyncFunction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(ESIK_Result Result, const struct FSIK_PublishedFileId& PublishedFileId, bool bUserNeedsToAcceptWorkshopLegalAgreement)> OnSuccess; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(ESIK_Result Result, const struct FSIK_PublishedFileId& PublishedFileId, bool bUserNeedsToAcceptWorkshopLegalAgreement)> OnFailure; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x38];                                      // 0x0050(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USIK_CreateItem_AsyncFunction* CreateItem(const struct FSIK_AppId& ConsumerAppID, ESIK_WorkshopFileType FileType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SIK_CreateItem_AsyncFunction">();
	}
	static class USIK_CreateItem_AsyncFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USIK_CreateItem_AsyncFunction>();
	}
};
static_assert(alignof(USIK_CreateItem_AsyncFunction) == 0x000008, "Wrong alignment on USIK_CreateItem_AsyncFunction");
static_assert(sizeof(USIK_CreateItem_AsyncFunction) == 0x000088, "Wrong size on USIK_CreateItem_AsyncFunction");
static_assert(offsetof(USIK_CreateItem_AsyncFunction, OnSuccess) == 0x000030, "Member 'USIK_CreateItem_AsyncFunction::OnSuccess' has a wrong offset!");
static_assert(offsetof(USIK_CreateItem_AsyncFunction, OnFailure) == 0x000040, "Member 'USIK_CreateItem_AsyncFunction::OnFailure' has a wrong offset!");

// Class SteamIntegrationKit.SIK_CreateLeaderboard_AsyncFunction
// 0x0068 (0x0098 - 0x0030)
class USIK_CreateLeaderboard_AsyncFunction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(int32 LeaderboardID)> OnSuccess;                                   // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 LeaderboardID)> OnFailure;                                   // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x48];                                      // 0x0050(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USIK_CreateLeaderboard_AsyncFunction* CreateLeaderboard(const class FString& LeaderboardName, ESIK_LeaderboardSortMethod SortMethod, ESIK_LeaderboardDisplayType DisplayType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SIK_CreateLeaderboard_AsyncFunction">();
	}
	static class USIK_CreateLeaderboard_AsyncFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USIK_CreateLeaderboard_AsyncFunction>();
	}
};
static_assert(alignof(USIK_CreateLeaderboard_AsyncFunction) == 0x000008, "Wrong alignment on USIK_CreateLeaderboard_AsyncFunction");
static_assert(sizeof(USIK_CreateLeaderboard_AsyncFunction) == 0x000098, "Wrong size on USIK_CreateLeaderboard_AsyncFunction");
static_assert(offsetof(USIK_CreateLeaderboard_AsyncFunction, OnSuccess) == 0x000030, "Member 'USIK_CreateLeaderboard_AsyncFunction::OnSuccess' has a wrong offset!");
static_assert(offsetof(USIK_CreateLeaderboard_AsyncFunction, OnFailure) == 0x000040, "Member 'USIK_CreateLeaderboard_AsyncFunction::OnFailure' has a wrong offset!");

// Class SteamIntegrationKit.SIK_CreateLobby_AsyncFunction
// 0x0090 (0x00C0 - 0x0030)
class USIK_CreateLobby_AsyncFunction final : public UBlueprintAsyncActionBase
{
public:
	uint8                                         Pad_30[0x70];                                      // 0x0030(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FSIK_SteamId& LobbyID)> OnSuccess;                    // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FSIK_SteamId& LobbyID)> OnFail;                       // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class USIK_CreateLobby_AsyncFunction* CreateSIKLobby(const TMap<class FString, struct FSIKAttribute>& SessionSettings, class FName SessionName, int32 NumberOfPublicConnections, const struct FSIKCreateLobbySettings& ExtraSettings);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SIK_CreateLobby_AsyncFunction">();
	}
	static class USIK_CreateLobby_AsyncFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USIK_CreateLobby_AsyncFunction>();
	}
};
static_assert(alignof(USIK_CreateLobby_AsyncFunction) == 0x000008, "Wrong alignment on USIK_CreateLobby_AsyncFunction");
static_assert(sizeof(USIK_CreateLobby_AsyncFunction) == 0x0000C0, "Wrong size on USIK_CreateLobby_AsyncFunction");
static_assert(offsetof(USIK_CreateLobby_AsyncFunction, OnSuccess) == 0x0000A0, "Member 'USIK_CreateLobby_AsyncFunction::OnSuccess' has a wrong offset!");
static_assert(offsetof(USIK_CreateLobby_AsyncFunction, OnFail) == 0x0000B0, "Member 'USIK_CreateLobby_AsyncFunction::OnFail' has a wrong offset!");

// Class SteamIntegrationKit.SIK_FileShare_AsyncFunction
// 0x0060 (0x0090 - 0x0030)
class USIK_FileShare_AsyncFunction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const ESIK_Result& Result, const class FString& SharedFile, const struct FSIK_UGCHandle& UGCHandle)> OnSuccess; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const ESIK_Result& Result, const class FString& SharedFile, const struct FSIK_UGCHandle& UGCHandle)> OnFailure; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x40];                                      // 0x0050(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USIK_FileShare_AsyncFunction* FileShareAsync(const class FString& Filename);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SIK_FileShare_AsyncFunction">();
	}
	static class USIK_FileShare_AsyncFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USIK_FileShare_AsyncFunction>();
	}
};
static_assert(alignof(USIK_FileShare_AsyncFunction) == 0x000008, "Wrong alignment on USIK_FileShare_AsyncFunction");
static_assert(sizeof(USIK_FileShare_AsyncFunction) == 0x000090, "Wrong size on USIK_FileShare_AsyncFunction");
static_assert(offsetof(USIK_FileShare_AsyncFunction, OnSuccess) == 0x000030, "Member 'USIK_FileShare_AsyncFunction::OnSuccess' has a wrong offset!");
static_assert(offsetof(USIK_FileShare_AsyncFunction, OnFailure) == 0x000040, "Member 'USIK_FileShare_AsyncFunction::OnFailure' has a wrong offset!");

// Class SteamIntegrationKit.SIK_CreateSession_AsyncFunction
// 0x00A0 (0x00D0 - 0x0030)
class USIK_CreateSession_AsyncFunction final : public UBlueprintAsyncActionBase
{
public:
	uint8                                         Pad_30[0x80];                                      // 0x0030(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& SessionID)> OnSuccess;                        // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& SessionID)> OnFail;                           // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class USIK_CreateSession_AsyncFunction* CreateEIKSession(const TMap<class FString, struct FSIKAttribute>& SessionSettings, class FName SessionName, int32 NumberOfPublicConnections, const struct FSIKDedicatedServerSettings& DedicatedServerSettings, const struct FSIK_CreateSessionExtraSettings& ExtraSettings);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SIK_CreateSession_AsyncFunction">();
	}
	static class USIK_CreateSession_AsyncFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USIK_CreateSession_AsyncFunction>();
	}
};
static_assert(alignof(USIK_CreateSession_AsyncFunction) == 0x000008, "Wrong alignment on USIK_CreateSession_AsyncFunction");
static_assert(sizeof(USIK_CreateSession_AsyncFunction) == 0x0000D0, "Wrong size on USIK_CreateSession_AsyncFunction");
static_assert(offsetof(USIK_CreateSession_AsyncFunction, OnSuccess) == 0x0000B0, "Member 'USIK_CreateSession_AsyncFunction::OnSuccess' has a wrong offset!");
static_assert(offsetof(USIK_CreateSession_AsyncFunction, OnFail) == 0x0000C0, "Member 'USIK_CreateSession_AsyncFunction::OnFail' has a wrong offset!");

// Class SteamIntegrationKit.SIK_DeleteItem_AsyncFunction
// 0x0058 (0x0088 - 0x0030)
class USIK_DeleteItem_AsyncFunction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(ESIK_Result Result, const struct FSIK_PublishedFileId& PublishedFileId_t)> OnSuccess; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(ESIK_Result Result, const struct FSIK_PublishedFileId& PublishedFileId_t)> OnFailure; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x38];                                      // 0x0050(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USIK_DeleteItem_AsyncFunction* DeleteItem(const struct FSIK_PublishedFileId& PublishedFileId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SIK_DeleteItem_AsyncFunction">();
	}
	static class USIK_DeleteItem_AsyncFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USIK_DeleteItem_AsyncFunction>();
	}
};
static_assert(alignof(USIK_DeleteItem_AsyncFunction) == 0x000008, "Wrong alignment on USIK_DeleteItem_AsyncFunction");
static_assert(sizeof(USIK_DeleteItem_AsyncFunction) == 0x000088, "Wrong size on USIK_DeleteItem_AsyncFunction");
static_assert(offsetof(USIK_DeleteItem_AsyncFunction, OnSuccess) == 0x000030, "Member 'USIK_DeleteItem_AsyncFunction::OnSuccess' has a wrong offset!");
static_assert(offsetof(USIK_DeleteItem_AsyncFunction, OnFailure) == 0x000040, "Member 'USIK_DeleteItem_AsyncFunction::OnFailure' has a wrong offset!");

// Class SteamIntegrationKit.SIK_DestroySession_AsyncFunction
// 0x0030 (0x0060 - 0x0030)
class USIK_DestroySession_AsyncFunction final : public UBlueprintAsyncActionBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnSuccess;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnFail;                                            // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class USIK_DestroySession_AsyncFunction* DestroySIKSessions(class FName SessionName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SIK_DestroySession_AsyncFunction">();
	}
	static class USIK_DestroySession_AsyncFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USIK_DestroySession_AsyncFunction>();
	}
};
static_assert(alignof(USIK_DestroySession_AsyncFunction) == 0x000008, "Wrong alignment on USIK_DestroySession_AsyncFunction");
static_assert(sizeof(USIK_DestroySession_AsyncFunction) == 0x000060, "Wrong size on USIK_DestroySession_AsyncFunction");
static_assert(offsetof(USIK_DestroySession_AsyncFunction, OnSuccess) == 0x000040, "Member 'USIK_DestroySession_AsyncFunction::OnSuccess' has a wrong offset!");
static_assert(offsetof(USIK_DestroySession_AsyncFunction, OnFail) == 0x000050, "Member 'USIK_DestroySession_AsyncFunction::OnFail' has a wrong offset!");

// Class SteamIntegrationKit.SIK_DownloadLeaderboardEntries_AsyncFunction
// 0x0060 (0x0090 - 0x0030)
class USIK_DownloadLeaderboardEntries_AsyncFunction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const TArray<struct FDownloadedLeaderboardEntry>& LeaderboardEntries)> OnSuccess; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const TArray<struct FDownloadedLeaderboardEntry>& LeaderboardEntries)> OnFailure; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x40];                                      // 0x0050(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USIK_DownloadLeaderboardEntries_AsyncFunction* DownloadLeaderboardEntries(int32 LeaderboardID, int32 RangeStart, int32 RangeEnd, ESIK_LeaderboardDataRequest LeaderboardDataRequest);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SIK_DownloadLeaderboardEntries_AsyncFunction">();
	}
	static class USIK_DownloadLeaderboardEntries_AsyncFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USIK_DownloadLeaderboardEntries_AsyncFunction>();
	}
};
static_assert(alignof(USIK_DownloadLeaderboardEntries_AsyncFunction) == 0x000008, "Wrong alignment on USIK_DownloadLeaderboardEntries_AsyncFunction");
static_assert(sizeof(USIK_DownloadLeaderboardEntries_AsyncFunction) == 0x000090, "Wrong size on USIK_DownloadLeaderboardEntries_AsyncFunction");
static_assert(offsetof(USIK_DownloadLeaderboardEntries_AsyncFunction, OnSuccess) == 0x000030, "Member 'USIK_DownloadLeaderboardEntries_AsyncFunction::OnSuccess' has a wrong offset!");
static_assert(offsetof(USIK_DownloadLeaderboardEntries_AsyncFunction, OnFailure) == 0x000040, "Member 'USIK_DownloadLeaderboardEntries_AsyncFunction::OnFailure' has a wrong offset!");

// Class SteamIntegrationKit.SIK_EnumerateFollowingList_AsyncFunction
// 0x0058 (0x0088 - 0x0030)
class USIK_EnumerateFollowingList_AsyncFunction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const TArray<struct FSIK_SteamId>& FollowingList, int64 ResultsReturned, int64 TotalResults)> OnSuccess; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const TArray<struct FSIK_SteamId>& FollowingList, int64 ResultsReturned, int64 TotalResults)> OnFailure; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x38];                                      // 0x0050(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USIK_EnumerateFollowingList_AsyncFunction* EnumerateFollowingList(int32 StartIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SIK_EnumerateFollowingList_AsyncFunction">();
	}
	static class USIK_EnumerateFollowingList_AsyncFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USIK_EnumerateFollowingList_AsyncFunction>();
	}
};
static_assert(alignof(USIK_EnumerateFollowingList_AsyncFunction) == 0x000008, "Wrong alignment on USIK_EnumerateFollowingList_AsyncFunction");
static_assert(sizeof(USIK_EnumerateFollowingList_AsyncFunction) == 0x000088, "Wrong size on USIK_EnumerateFollowingList_AsyncFunction");
static_assert(offsetof(USIK_EnumerateFollowingList_AsyncFunction, OnSuccess) == 0x000030, "Member 'USIK_EnumerateFollowingList_AsyncFunction::OnSuccess' has a wrong offset!");
static_assert(offsetof(USIK_EnumerateFollowingList_AsyncFunction, OnFailure) == 0x000040, "Member 'USIK_EnumerateFollowingList_AsyncFunction::OnFailure' has a wrong offset!");

// Class SteamIntegrationKit.SIK_FileReadAsync_AsyncFunction
// 0x0068 (0x0098 - 0x0030)
class USIK_FileReadAsync_AsyncFunction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const ESIK_Result& Result, int32 nOffset, int32 nBytesRead, const TArray<uint8>& Data)> OnSuccess; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const ESIK_Result& Result, int32 nOffset, int32 nBytesRead, const TArray<uint8>& Data)> OnFailure; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x48];                                      // 0x0050(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USIK_FileReadAsync_AsyncFunction* FileReadAsync(const class FString& Filename, int32 nOffset, int32 nBytesToRead);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SIK_FileReadAsync_AsyncFunction">();
	}
	static class USIK_FileReadAsync_AsyncFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USIK_FileReadAsync_AsyncFunction>();
	}
};
static_assert(alignof(USIK_FileReadAsync_AsyncFunction) == 0x000008, "Wrong alignment on USIK_FileReadAsync_AsyncFunction");
static_assert(sizeof(USIK_FileReadAsync_AsyncFunction) == 0x000098, "Wrong size on USIK_FileReadAsync_AsyncFunction");
static_assert(offsetof(USIK_FileReadAsync_AsyncFunction, OnSuccess) == 0x000030, "Member 'USIK_FileReadAsync_AsyncFunction::OnSuccess' has a wrong offset!");
static_assert(offsetof(USIK_FileReadAsync_AsyncFunction, OnFailure) == 0x000040, "Member 'USIK_FileReadAsync_AsyncFunction::OnFailure' has a wrong offset!");

// Class SteamIntegrationKit.SIK_FileWriteAsync_AsyncFunction
// 0x0070 (0x00A0 - 0x0030)
class USIK_FileWriteAsync_AsyncFunction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const ESIK_Result& Result)> OnSuccess;                             // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const ESIK_Result& Result)> OnFailure;                             // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x50];                                      // 0x0050(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USIK_FileWriteAsync_AsyncFunction* FileWriteAsync(const class FString& Filename, const TArray<uint8>& FileData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SIK_FileWriteAsync_AsyncFunction">();
	}
	static class USIK_FileWriteAsync_AsyncFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USIK_FileWriteAsync_AsyncFunction>();
	}
};
static_assert(alignof(USIK_FileWriteAsync_AsyncFunction) == 0x000008, "Wrong alignment on USIK_FileWriteAsync_AsyncFunction");
static_assert(sizeof(USIK_FileWriteAsync_AsyncFunction) == 0x0000A0, "Wrong size on USIK_FileWriteAsync_AsyncFunction");
static_assert(offsetof(USIK_FileWriteAsync_AsyncFunction, OnSuccess) == 0x000030, "Member 'USIK_FileWriteAsync_AsyncFunction::OnSuccess' has a wrong offset!");
static_assert(offsetof(USIK_FileWriteAsync_AsyncFunction, OnFailure) == 0x000040, "Member 'USIK_FileWriteAsync_AsyncFunction::OnFailure' has a wrong offset!");

// Class SteamIntegrationKit.SIK_FindSessions_AsyncFunction
// 0x0090 (0x00C0 - 0x0030)
class USIK_FindSessions_AsyncFunction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const TArray<struct FSSessionFindStruct>& SessionResults)> OnSuccess; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const TArray<struct FSSessionFindStruct>& SessionResults)> OnFail; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x70];                                      // 0x0050(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USIK_FindSessions_AsyncFunction* FindSIKSessions(const TMap<class FName, struct FSIKAttribute>& SessionSettings, ESMatchType MatchType, int32 MaxResults, bool bLanSearch, bool bEmptyServerOnly, bool bSecureServerOnly);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SIK_FindSessions_AsyncFunction">();
	}
	static class USIK_FindSessions_AsyncFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USIK_FindSessions_AsyncFunction>();
	}
};
static_assert(alignof(USIK_FindSessions_AsyncFunction) == 0x000008, "Wrong alignment on USIK_FindSessions_AsyncFunction");
static_assert(sizeof(USIK_FindSessions_AsyncFunction) == 0x0000C0, "Wrong size on USIK_FindSessions_AsyncFunction");
static_assert(offsetof(USIK_FindSessions_AsyncFunction, OnSuccess) == 0x000030, "Member 'USIK_FindSessions_AsyncFunction::OnSuccess' has a wrong offset!");
static_assert(offsetof(USIK_FindSessions_AsyncFunction, OnFail) == 0x000040, "Member 'USIK_FindSessions_AsyncFunction::OnFail' has a wrong offset!");

// Class SteamIntegrationKit.SIK_FriendsLibrary
// 0x0000 (0x0028 - 0x0028)
class USIK_FriendsLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ActivateGameOverlay(const class FString& DialogToOpen);
	static void ActivateGameOverlayInviteDialog(const int64& SteamIdLobby);
	static void ActivateGameOverlayToStore(const struct FSIK_AppId& AppID, bool bAddToCartAndShow);
	static void ActivateGameOverlayToUser(const class FString& Dialog, int64 steamIDUser);
	static void ActivateGameOverlayToWebPage(const class FString& URL, bool bUseModal);
	static bool BHasEquippedProfileItem(const struct FSIK_SteamId& steamIDUser, ESIK_ECommunityProfileItemType ItemType);
	static void ClearRichPresence();
	static bool CloseClanChatWindowInSteam(int64 SteamIdClanChat);
	static struct FSIK_SteamId GetChatMemberByIndex(const struct FSIK_SteamId& SteamIdClan, int32 MemberIndex);
	static bool GetClanActivityCounts(const struct FSIK_SteamId& SteamIdClan, int32* Online, int32* InGame, int32* Chatting);
	static struct FSIK_SteamId GetClanByIndex(int32 ClanIndex);
	static int32 GetClanChatMemberCount(const struct FSIK_SteamId& SteamIdClan);
	static int32 GetClanChatMessage(const struct FSIK_SteamId& SteamIdClan, int32 MessageIndex, const TArray<uint8>& Text, struct FSIK_SteamId* steamIDUser, class FString* ChatEntryType);
	static int32 GetClanCount();
	static class FString GetClanName(const struct FSIK_SteamId& SteamIdClan);
	static struct FSIK_SteamId GetClanOfficerByIndex(const struct FSIK_SteamId& SteamIdClan, int32 OfficerIndex);
	static int32 GetClanOfficerCount(const struct FSIK_SteamId& SteamIdClan);
	static struct FSIK_SteamId GetClanOwner(const struct FSIK_SteamId& SteamIdClan);
	static class FString GetClanTag(const struct FSIK_SteamId& SteamIdClan);
	static struct FSIK_SteamId GetCoplayFriend(int32 CoplayFriend);
	static int32 GetCoplayFriendCount();
	static struct FSIK_SteamId GetFriendByIndex(int32 FriendIndex, const TArray<ESIK_FriendFlags>& FriendFlags);
	static struct FSIK_AppId GetFriendCoplayGame(const struct FSIK_SteamId& SteamIdFriend);
	static struct FDateTime GetFriendCoplayTime(const struct FSIK_SteamId& SteamIdFriend);
	static int32 GetFriendCount(const TArray<ESIK_FriendFlags>& FriendFlags);
	static int32 GetFriendCountFromSource(const struct FSIK_SteamId& SteamIdSource);
