#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SteamIntegrationKit

#include "Basic.hpp"

#include "SteamIntegrationKit_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SteamIntegrationKit.HostMigrationSubsystem.StartHostMigration
// 0x0008 (0x0008 - 0x0000)
struct HostMigrationSubsystem_StartHostMigration final
{
public:
	struct FSIK_SteamId                           LobbyID;                                           // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(HostMigrationSubsystem_StartHostMigration) == 0x000008, "Wrong alignment on HostMigrationSubsystem_StartHostMigration");
static_assert(sizeof(HostMigrationSubsystem_StartHostMigration) == 0x000008, "Wrong size on HostMigrationSubsystem_StartHostMigration");
static_assert(offsetof(HostMigrationSubsystem_StartHostMigration, LobbyID) == 0x000000, "Member 'HostMigrationSubsystem_StartHostMigration::LobbyID' has a wrong offset!");

// Function SteamIntegrationKit.SIK_RemoveDependency_AsyncFunction.RemoveDependency
// 0x0018 (0x0018 - 0x0000)
struct SIK_RemoveDependency_AsyncFunction_RemoveDependency final
{
public:
	struct FSIK_PublishedFileId                   ParentPublishedFileID;                             // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FSIK_PublishedFileId                   ChildPublishedFileID;                              // 0x0008(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class USIK_RemoveDependency_AsyncFunction*    ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_RemoveDependency_AsyncFunction_RemoveDependency) == 0x000008, "Wrong alignment on SIK_RemoveDependency_AsyncFunction_RemoveDependency");
static_assert(sizeof(SIK_RemoveDependency_AsyncFunction_RemoveDependency) == 0x000018, "Wrong size on SIK_RemoveDependency_AsyncFunction_RemoveDependency");
static_assert(offsetof(SIK_RemoveDependency_AsyncFunction_RemoveDependency, ParentPublishedFileID) == 0x000000, "Member 'SIK_RemoveDependency_AsyncFunction_RemoveDependency::ParentPublishedFileID' has a wrong offset!");
static_assert(offsetof(SIK_RemoveDependency_AsyncFunction_RemoveDependency, ChildPublishedFileID) == 0x000008, "Member 'SIK_RemoveDependency_AsyncFunction_RemoveDependency::ChildPublishedFileID' has a wrong offset!");
static_assert(offsetof(SIK_RemoveDependency_AsyncFunction_RemoveDependency, ReturnValue) == 0x000010, "Member 'SIK_RemoveDependency_AsyncFunction_RemoveDependency::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AddAppDependency_AsyncFunction.AddAppDependency
// 0x0018 (0x0018 - 0x0000)
struct SIK_AddAppDependency_AsyncFunction_AddAppDependency final
{
public:
	struct FSIK_PublishedFileId                   PublishedFileId;                                   // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FSIK_AppId                             AppID;                                             // 0x0008(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USIK_AddAppDependency_AsyncFunction*    ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_AddAppDependency_AsyncFunction_AddAppDependency) == 0x000008, "Wrong alignment on SIK_AddAppDependency_AsyncFunction_AddAppDependency");
static_assert(sizeof(SIK_AddAppDependency_AsyncFunction_AddAppDependency) == 0x000018, "Wrong size on SIK_AddAppDependency_AsyncFunction_AddAppDependency");
static_assert(offsetof(SIK_AddAppDependency_AsyncFunction_AddAppDependency, PublishedFileId) == 0x000000, "Member 'SIK_AddAppDependency_AsyncFunction_AddAppDependency::PublishedFileId' has a wrong offset!");
static_assert(offsetof(SIK_AddAppDependency_AsyncFunction_AddAppDependency, AppID) == 0x000008, "Member 'SIK_AddAppDependency_AsyncFunction_AddAppDependency::AppID' has a wrong offset!");
static_assert(offsetof(SIK_AddAppDependency_AsyncFunction_AddAppDependency, ReturnValue) == 0x000010, "Member 'SIK_AddAppDependency_AsyncFunction_AddAppDependency::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AddDependency_AsyncFunction.AddDependency
// 0x0018 (0x0018 - 0x0000)
struct SIK_AddDependency_AsyncFunction_AddDependency final
{
public:
	struct FSIK_PublishedFileId                   ParentPublishedFileID;                             // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FSIK_PublishedFileId                   ChildPublishedFileID;                              // 0x0008(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class USIK_AddDependency_AsyncFunction*       ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_AddDependency_AsyncFunction_AddDependency) == 0x000008, "Wrong alignment on SIK_AddDependency_AsyncFunction_AddDependency");
static_assert(sizeof(SIK_AddDependency_AsyncFunction_AddDependency) == 0x000018, "Wrong size on SIK_AddDependency_AsyncFunction_AddDependency");
static_assert(offsetof(SIK_AddDependency_AsyncFunction_AddDependency, ParentPublishedFileID) == 0x000000, "Member 'SIK_AddDependency_AsyncFunction_AddDependency::ParentPublishedFileID' has a wrong offset!");
static_assert(offsetof(SIK_AddDependency_AsyncFunction_AddDependency, ChildPublishedFileID) == 0x000008, "Member 'SIK_AddDependency_AsyncFunction_AddDependency::ChildPublishedFileID' has a wrong offset!");
static_assert(offsetof(SIK_AddDependency_AsyncFunction_AddDependency, ReturnValue) == 0x000010, "Member 'SIK_AddDependency_AsyncFunction_AddDependency::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AddItemToFavorites_AsyncFunction.AddItemToFavorites
// 0x0018 (0x0018 - 0x0000)
struct SIK_AddItemToFavorites_AsyncFunction_AddItemToFavorites final
{
public:
	struct FSIK_AppId                             AppID;                                             // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSIK_PublishedFileId                   PublishedFileId;                                   // 0x0008(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class USIK_AddItemToFavorites_AsyncFunction*  ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_AddItemToFavorites_AsyncFunction_AddItemToFavorites) == 0x000008, "Wrong alignment on SIK_AddItemToFavorites_AsyncFunction_AddItemToFavorites");
static_assert(sizeof(SIK_AddItemToFavorites_AsyncFunction_AddItemToFavorites) == 0x000018, "Wrong size on SIK_AddItemToFavorites_AsyncFunction_AddItemToFavorites");
static_assert(offsetof(SIK_AddItemToFavorites_AsyncFunction_AddItemToFavorites, AppID) == 0x000000, "Member 'SIK_AddItemToFavorites_AsyncFunction_AddItemToFavorites::AppID' has a wrong offset!");
static_assert(offsetof(SIK_AddItemToFavorites_AsyncFunction_AddItemToFavorites, PublishedFileId) == 0x000008, "Member 'SIK_AddItemToFavorites_AsyncFunction_AddItemToFavorites::PublishedFileId' has a wrong offset!");
static_assert(offsetof(SIK_AddItemToFavorites_AsyncFunction_AddItemToFavorites, ReturnValue) == 0x000010, "Member 'SIK_AddItemToFavorites_AsyncFunction_AddItemToFavorites::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_RequestEncryptedAppTicket_AsyncFunction.RequestEncryptedAppTicket
// 0x0018 (0x0018 - 0x0000)
struct SIK_RequestEncryptedAppTicket_AsyncFunction_RequestEncryptedAppTicket final
{
public:
	TArray<uint8>                                 EncryptedAppTicket;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class USIK_RequestEncryptedAppTicket_AsyncFunction* ReturnValue;                                 // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_RequestEncryptedAppTicket_AsyncFunction_RequestEncryptedAppTicket) == 0x000008, "Wrong alignment on SIK_RequestEncryptedAppTicket_AsyncFunction_RequestEncryptedAppTicket");
static_assert(sizeof(SIK_RequestEncryptedAppTicket_AsyncFunction_RequestEncryptedAppTicket) == 0x000018, "Wrong size on SIK_RequestEncryptedAppTicket_AsyncFunction_RequestEncryptedAppTicket");
static_assert(offsetof(SIK_RequestEncryptedAppTicket_AsyncFunction_RequestEncryptedAppTicket, EncryptedAppTicket) == 0x000000, "Member 'SIK_RequestEncryptedAppTicket_AsyncFunction_RequestEncryptedAppTicket::EncryptedAppTicket' has a wrong offset!");
static_assert(offsetof(SIK_RequestEncryptedAppTicket_AsyncFunction_RequestEncryptedAppTicket, ReturnValue) == 0x000010, "Member 'SIK_RequestEncryptedAppTicket_AsyncFunction_RequestEncryptedAppTicket::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AppLibrary.GetAppBuildID
// 0x0004 (0x0004 - 0x0000)
struct SIK_AppLibrary_GetAppBuildID final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_AppLibrary_GetAppBuildID) == 0x000004, "Wrong alignment on SIK_AppLibrary_GetAppBuildID");
static_assert(sizeof(SIK_AppLibrary_GetAppBuildID) == 0x000004, "Wrong size on SIK_AppLibrary_GetAppBuildID");
static_assert(offsetof(SIK_AppLibrary_GetAppBuildID, ReturnValue) == 0x000000, "Member 'SIK_AppLibrary_GetAppBuildID::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AppLibrary.GetAppInstallDir
// 0x0018 (0x0018 - 0x0000)
struct SIK_AppLibrary_GetAppInstallDir final
{
public:
	int32                                         AppID;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_AppLibrary_GetAppInstallDir) == 0x000008, "Wrong alignment on SIK_AppLibrary_GetAppInstallDir");
static_assert(sizeof(SIK_AppLibrary_GetAppInstallDir) == 0x000018, "Wrong size on SIK_AppLibrary_GetAppInstallDir");
static_assert(offsetof(SIK_AppLibrary_GetAppInstallDir, AppID) == 0x000000, "Member 'SIK_AppLibrary_GetAppInstallDir::AppID' has a wrong offset!");
static_assert(offsetof(SIK_AppLibrary_GetAppInstallDir, ReturnValue) == 0x000008, "Member 'SIK_AppLibrary_GetAppInstallDir::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AppLibrary.GetAppOwner
// 0x0008 (0x0008 - 0x0000)
struct SIK_AppLibrary_GetAppOwner final
{
public:
	struct FSIK_SteamId                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_AppLibrary_GetAppOwner) == 0x000008, "Wrong alignment on SIK_AppLibrary_GetAppOwner");
static_assert(sizeof(SIK_AppLibrary_GetAppOwner) == 0x000008, "Wrong size on SIK_AppLibrary_GetAppOwner");
static_assert(offsetof(SIK_AppLibrary_GetAppOwner, ReturnValue) == 0x000000, "Member 'SIK_AppLibrary_GetAppOwner::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AppLibrary.GetAvailableGameLanguages
// 0x0010 (0x0010 - 0x0000)
struct SIK_AppLibrary_GetAvailableGameLanguages final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_AppLibrary_GetAvailableGameLanguages) == 0x000008, "Wrong alignment on SIK_AppLibrary_GetAvailableGameLanguages");
static_assert(sizeof(SIK_AppLibrary_GetAvailableGameLanguages) == 0x000010, "Wrong size on SIK_AppLibrary_GetAvailableGameLanguages");
static_assert(offsetof(SIK_AppLibrary_GetAvailableGameLanguages, ReturnValue) == 0x000000, "Member 'SIK_AppLibrary_GetAvailableGameLanguages::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AppLibrary.GetCurrentBetaName
// 0x0018 (0x0018 - 0x0000)
struct SIK_AppLibrary_GetCurrentBetaName final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SIK_AppLibrary_GetCurrentBetaName) == 0x000008, "Wrong alignment on SIK_AppLibrary_GetCurrentBetaName");
static_assert(sizeof(SIK_AppLibrary_GetCurrentBetaName) == 0x000018, "Wrong size on SIK_AppLibrary_GetCurrentBetaName");
static_assert(offsetof(SIK_AppLibrary_GetCurrentBetaName, Name_0) == 0x000000, "Member 'SIK_AppLibrary_GetCurrentBetaName::Name_0' has a wrong offset!");
static_assert(offsetof(SIK_AppLibrary_GetCurrentBetaName, ReturnValue) == 0x000010, "Member 'SIK_AppLibrary_GetCurrentBetaName::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AppLibrary.GetCurrentGameLanguage
// 0x0010 (0x0010 - 0x0000)
struct SIK_AppLibrary_GetCurrentGameLanguage final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_AppLibrary_GetCurrentGameLanguage) == 0x000008, "Wrong alignment on SIK_AppLibrary_GetCurrentGameLanguage");
static_assert(sizeof(SIK_AppLibrary_GetCurrentGameLanguage) == 0x000010, "Wrong size on SIK_AppLibrary_GetCurrentGameLanguage");
static_assert(offsetof(SIK_AppLibrary_GetCurrentGameLanguage, ReturnValue) == 0x000000, "Member 'SIK_AppLibrary_GetCurrentGameLanguage::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AppLibrary.GetDLCCount
// 0x0004 (0x0004 - 0x0000)
struct SIK_AppLibrary_GetDLCCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_AppLibrary_GetDLCCount) == 0x000004, "Wrong alignment on SIK_AppLibrary_GetDLCCount");
static_assert(sizeof(SIK_AppLibrary_GetDLCCount) == 0x000004, "Wrong size on SIK_AppLibrary_GetDLCCount");
static_assert(offsetof(SIK_AppLibrary_GetDLCCount, ReturnValue) == 0x000000, "Member 'SIK_AppLibrary_GetDLCCount::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AppLibrary.GetDLCDataByIndex
// 0x0028 (0x0028 - 0x0000)
struct SIK_AppLibrary_GetDLCDataByIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSIK_AppId                             AppID;                                             // 0x0004(0x0004)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          Available;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Name_0;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SIK_AppLibrary_GetDLCDataByIndex) == 0x000008, "Wrong alignment on SIK_AppLibrary_GetDLCDataByIndex");
static_assert(sizeof(SIK_AppLibrary_GetDLCDataByIndex) == 0x000028, "Wrong size on SIK_AppLibrary_GetDLCDataByIndex");
static_assert(offsetof(SIK_AppLibrary_GetDLCDataByIndex, Index_0) == 0x000000, "Member 'SIK_AppLibrary_GetDLCDataByIndex::Index_0' has a wrong offset!");
static_assert(offsetof(SIK_AppLibrary_GetDLCDataByIndex, AppID) == 0x000004, "Member 'SIK_AppLibrary_GetDLCDataByIndex::AppID' has a wrong offset!");
static_assert(offsetof(SIK_AppLibrary_GetDLCDataByIndex, Available) == 0x000008, "Member 'SIK_AppLibrary_GetDLCDataByIndex::Available' has a wrong offset!");
static_assert(offsetof(SIK_AppLibrary_GetDLCDataByIndex, Name_0) == 0x000010, "Member 'SIK_AppLibrary_GetDLCDataByIndex::Name_0' has a wrong offset!");
static_assert(offsetof(SIK_AppLibrary_GetDLCDataByIndex, ReturnValue) == 0x000020, "Member 'SIK_AppLibrary_GetDLCDataByIndex::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AppLibrary.GetDLCDownloadProgress
// 0x0020 (0x0020 - 0x0000)
struct SIK_AppLibrary_GetDLCDownloadProgress final
{
public:
	struct FSIK_AppId                             AppID;                                             // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         BytesDownloaded;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         BytesTotal;                                        // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SIK_AppLibrary_GetDLCDownloadProgress) == 0x000008, "Wrong alignment on SIK_AppLibrary_GetDLCDownloadProgress");
static_assert(sizeof(SIK_AppLibrary_GetDLCDownloadProgress) == 0x000020, "Wrong size on SIK_AppLibrary_GetDLCDownloadProgress");
static_assert(offsetof(SIK_AppLibrary_GetDLCDownloadProgress, AppID) == 0x000000, "Member 'SIK_AppLibrary_GetDLCDownloadProgress::AppID' has a wrong offset!");
static_assert(offsetof(SIK_AppLibrary_GetDLCDownloadProgress, BytesDownloaded) == 0x000008, "Member 'SIK_AppLibrary_GetDLCDownloadProgress::BytesDownloaded' has a wrong offset!");
static_assert(offsetof(SIK_AppLibrary_GetDLCDownloadProgress, BytesTotal) == 0x000010, "Member 'SIK_AppLibrary_GetDLCDownloadProgress::BytesTotal' has a wrong offset!");
static_assert(offsetof(SIK_AppLibrary_GetDLCDownloadProgress, ReturnValue) == 0x000018, "Member 'SIK_AppLibrary_GetDLCDownloadProgress::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AppLibrary.GetEarliestPurchaseUnixTime
// 0x0008 (0x0008 - 0x0000)
struct SIK_AppLibrary_GetEarliestPurchaseUnixTime final
{
public:
	struct FSIK_AppId                             AppID;                                             // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_AppLibrary_GetEarliestPurchaseUnixTime) == 0x000004, "Wrong alignment on SIK_AppLibrary_GetEarliestPurchaseUnixTime");
static_assert(sizeof(SIK_AppLibrary_GetEarliestPurchaseUnixTime) == 0x000008, "Wrong size on SIK_AppLibrary_GetEarliestPurchaseUnixTime");
static_assert(offsetof(SIK_AppLibrary_GetEarliestPurchaseUnixTime, AppID) == 0x000000, "Member 'SIK_AppLibrary_GetEarliestPurchaseUnixTime::AppID' has a wrong offset!");
static_assert(offsetof(SIK_AppLibrary_GetEarliestPurchaseUnixTime, ReturnValue) == 0x000004, "Member 'SIK_AppLibrary_GetEarliestPurchaseUnixTime::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AppLibrary.GetInstalledDepots
// 0x0018 (0x0018 - 0x0000)
struct SIK_AppLibrary_GetInstalledDepots final
{
public:
	struct FSIK_AppId                             AppID;                                             // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_AppLibrary_GetInstalledDepots) == 0x000008, "Wrong alignment on SIK_AppLibrary_GetInstalledDepots");
static_assert(sizeof(SIK_AppLibrary_GetInstalledDepots) == 0x000018, "Wrong size on SIK_AppLibrary_GetInstalledDepots");
static_assert(offsetof(SIK_AppLibrary_GetInstalledDepots, AppID) == 0x000000, "Member 'SIK_AppLibrary_GetInstalledDepots::AppID' has a wrong offset!");
static_assert(offsetof(SIK_AppLibrary_GetInstalledDepots, ReturnValue) == 0x000008, "Member 'SIK_AppLibrary_GetInstalledDepots::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AppLibrary.GetLaunchCommandLine
// 0x0018 (0x0018 - 0x0000)
struct SIK_AppLibrary_GetLaunchCommandLine final
{
public:
	class FString                                 CommandLine;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SIK_AppLibrary_GetLaunchCommandLine) == 0x000008, "Wrong alignment on SIK_AppLibrary_GetLaunchCommandLine");
static_assert(sizeof(SIK_AppLibrary_GetLaunchCommandLine) == 0x000018, "Wrong size on SIK_AppLibrary_GetLaunchCommandLine");
static_assert(offsetof(SIK_AppLibrary_GetLaunchCommandLine, CommandLine) == 0x000000, "Member 'SIK_AppLibrary_GetLaunchCommandLine::CommandLine' has a wrong offset!");
static_assert(offsetof(SIK_AppLibrary_GetLaunchCommandLine, ReturnValue) == 0x000010, "Member 'SIK_AppLibrary_GetLaunchCommandLine::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AppLibrary.GetLaunchQueryParam
// 0x0020 (0x0020 - 0x0000)
struct SIK_AppLibrary_GetLaunchQueryParam final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_AppLibrary_GetLaunchQueryParam) == 0x000008, "Wrong alignment on SIK_AppLibrary_GetLaunchQueryParam");
static_assert(sizeof(SIK_AppLibrary_GetLaunchQueryParam) == 0x000020, "Wrong size on SIK_AppLibrary_GetLaunchQueryParam");
static_assert(offsetof(SIK_AppLibrary_GetLaunchQueryParam, Key) == 0x000000, "Member 'SIK_AppLibrary_GetLaunchQueryParam::Key' has a wrong offset!");
static_assert(offsetof(SIK_AppLibrary_GetLaunchQueryParam, ReturnValue) == 0x000010, "Member 'SIK_AppLibrary_GetLaunchQueryParam::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AppLibrary.InstallDLC
// 0x0004 (0x0004 - 0x0000)
struct SIK_AppLibrary_InstallDLC final
{
public:
	struct FSIK_AppId                             AppID;                                             // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_AppLibrary_InstallDLC) == 0x000004, "Wrong alignment on SIK_AppLibrary_InstallDLC");
static_assert(sizeof(SIK_AppLibrary_InstallDLC) == 0x000004, "Wrong size on SIK_AppLibrary_InstallDLC");
static_assert(offsetof(SIK_AppLibrary_InstallDLC, AppID) == 0x000000, "Member 'SIK_AppLibrary_InstallDLC::AppID' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AppLibrary.IsAppInstalled
// 0x0008 (0x0008 - 0x0000)
struct SIK_AppLibrary_IsAppInstalled final
{
public:
	struct FSIK_AppId                             AppID;                                             // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SIK_AppLibrary_IsAppInstalled) == 0x000004, "Wrong alignment on SIK_AppLibrary_IsAppInstalled");
static_assert(sizeof(SIK_AppLibrary_IsAppInstalled) == 0x000008, "Wrong size on SIK_AppLibrary_IsAppInstalled");
static_assert(offsetof(SIK_AppLibrary_IsAppInstalled, AppID) == 0x000000, "Member 'SIK_AppLibrary_IsAppInstalled::AppID' has a wrong offset!");
static_assert(offsetof(SIK_AppLibrary_IsAppInstalled, ReturnValue) == 0x000004, "Member 'SIK_AppLibrary_IsAppInstalled::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AppLibrary.IsCybercafe
// 0x0001 (0x0001 - 0x0000)
struct SIK_AppLibrary_IsCybercafe final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_AppLibrary_IsCybercafe) == 0x000001, "Wrong alignment on SIK_AppLibrary_IsCybercafe");
static_assert(sizeof(SIK_AppLibrary_IsCybercafe) == 0x000001, "Wrong size on SIK_AppLibrary_IsCybercafe");
static_assert(offsetof(SIK_AppLibrary_IsCybercafe, ReturnValue) == 0x000000, "Member 'SIK_AppLibrary_IsCybercafe::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AppLibrary.IsDLCInstalled
// 0x0008 (0x0008 - 0x0000)
struct SIK_AppLibrary_IsDLCInstalled final
{
public:
	int32                                         AppID;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SIK_AppLibrary_IsDLCInstalled) == 0x000004, "Wrong alignment on SIK_AppLibrary_IsDLCInstalled");
static_assert(sizeof(SIK_AppLibrary_IsDLCInstalled) == 0x000008, "Wrong size on SIK_AppLibrary_IsDLCInstalled");
static_assert(offsetof(SIK_AppLibrary_IsDLCInstalled, AppID) == 0x000000, "Member 'SIK_AppLibrary_IsDLCInstalled::AppID' has a wrong offset!");
static_assert(offsetof(SIK_AppLibrary_IsDLCInstalled, ReturnValue) == 0x000004, "Member 'SIK_AppLibrary_IsDLCInstalled::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AppLibrary.IsLowViolence
// 0x0001 (0x0001 - 0x0000)
struct SIK_AppLibrary_IsLowViolence final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_AppLibrary_IsLowViolence) == 0x000001, "Wrong alignment on SIK_AppLibrary_IsLowViolence");
static_assert(sizeof(SIK_AppLibrary_IsLowViolence) == 0x000001, "Wrong size on SIK_AppLibrary_IsLowViolence");
static_assert(offsetof(SIK_AppLibrary_IsLowViolence, ReturnValue) == 0x000000, "Member 'SIK_AppLibrary_IsLowViolence::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AppLibrary.IsSubscribed
// 0x0001 (0x0001 - 0x0000)
struct SIK_AppLibrary_IsSubscribed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_AppLibrary_IsSubscribed) == 0x000001, "Wrong alignment on SIK_AppLibrary_IsSubscribed");
static_assert(sizeof(SIK_AppLibrary_IsSubscribed) == 0x000001, "Wrong size on SIK_AppLibrary_IsSubscribed");
static_assert(offsetof(SIK_AppLibrary_IsSubscribed, ReturnValue) == 0x000000, "Member 'SIK_AppLibrary_IsSubscribed::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AppLibrary.IsSubscribedApp
// 0x0008 (0x0008 - 0x0000)
struct SIK_AppLibrary_IsSubscribedApp final
{
public:
	int32                                         AppID;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SIK_AppLibrary_IsSubscribedApp) == 0x000004, "Wrong alignment on SIK_AppLibrary_IsSubscribedApp");
static_assert(sizeof(SIK_AppLibrary_IsSubscribedApp) == 0x000008, "Wrong size on SIK_AppLibrary_IsSubscribedApp");
static_assert(offsetof(SIK_AppLibrary_IsSubscribedApp, AppID) == 0x000000, "Member 'SIK_AppLibrary_IsSubscribedApp::AppID' has a wrong offset!");
static_assert(offsetof(SIK_AppLibrary_IsSubscribedApp, ReturnValue) == 0x000004, "Member 'SIK_AppLibrary_IsSubscribedApp::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AppLibrary.IsSubscribedFromFamilySharing
// 0x0001 (0x0001 - 0x0000)
struct SIK_AppLibrary_IsSubscribedFromFamilySharing final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_AppLibrary_IsSubscribedFromFamilySharing) == 0x000001, "Wrong alignment on SIK_AppLibrary_IsSubscribedFromFamilySharing");
static_assert(sizeof(SIK_AppLibrary_IsSubscribedFromFamilySharing) == 0x000001, "Wrong size on SIK_AppLibrary_IsSubscribedFromFamilySharing");
static_assert(offsetof(SIK_AppLibrary_IsSubscribedFromFamilySharing, ReturnValue) == 0x000000, "Member 'SIK_AppLibrary_IsSubscribedFromFamilySharing::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AppLibrary.IsSubscribedFromFreeWeekend
// 0x0001 (0x0001 - 0x0000)
struct SIK_AppLibrary_IsSubscribedFromFreeWeekend final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_AppLibrary_IsSubscribedFromFreeWeekend) == 0x000001, "Wrong alignment on SIK_AppLibrary_IsSubscribedFromFreeWeekend");
static_assert(sizeof(SIK_AppLibrary_IsSubscribedFromFreeWeekend) == 0x000001, "Wrong size on SIK_AppLibrary_IsSubscribedFromFreeWeekend");
static_assert(offsetof(SIK_AppLibrary_IsSubscribedFromFreeWeekend, ReturnValue) == 0x000000, "Member 'SIK_AppLibrary_IsSubscribedFromFreeWeekend::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AppLibrary.IsTimedTrial
// 0x000C (0x000C - 0x0000)
struct SIK_AppLibrary_IsTimedTrial final
{
public:
	int32                                         SecondsAllowed;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SecondsPlayed;                                     // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SIK_AppLibrary_IsTimedTrial) == 0x000004, "Wrong alignment on SIK_AppLibrary_IsTimedTrial");
static_assert(sizeof(SIK_AppLibrary_IsTimedTrial) == 0x00000C, "Wrong size on SIK_AppLibrary_IsTimedTrial");
static_assert(offsetof(SIK_AppLibrary_IsTimedTrial, SecondsAllowed) == 0x000000, "Member 'SIK_AppLibrary_IsTimedTrial::SecondsAllowed' has a wrong offset!");
static_assert(offsetof(SIK_AppLibrary_IsTimedTrial, SecondsPlayed) == 0x000004, "Member 'SIK_AppLibrary_IsTimedTrial::SecondsPlayed' has a wrong offset!");
static_assert(offsetof(SIK_AppLibrary_IsTimedTrial, ReturnValue) == 0x000008, "Member 'SIK_AppLibrary_IsTimedTrial::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AppLibrary.IsVACBanned
// 0x0001 (0x0001 - 0x0000)
struct SIK_AppLibrary_IsVACBanned final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_AppLibrary_IsVACBanned) == 0x000001, "Wrong alignment on SIK_AppLibrary_IsVACBanned");
static_assert(sizeof(SIK_AppLibrary_IsVACBanned) == 0x000001, "Wrong size on SIK_AppLibrary_IsVACBanned");
static_assert(offsetof(SIK_AppLibrary_IsVACBanned, ReturnValue) == 0x000000, "Member 'SIK_AppLibrary_IsVACBanned::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AppLibrary.MarkContentCorrupt
// 0x0002 (0x0002 - 0x0000)
struct SIK_AppLibrary_MarkContentCorrupt final
{
public:
	bool                                          MissingFilesOnly;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_AppLibrary_MarkContentCorrupt) == 0x000001, "Wrong alignment on SIK_AppLibrary_MarkContentCorrupt");
static_assert(sizeof(SIK_AppLibrary_MarkContentCorrupt) == 0x000002, "Wrong size on SIK_AppLibrary_MarkContentCorrupt");
static_assert(offsetof(SIK_AppLibrary_MarkContentCorrupt, MissingFilesOnly) == 0x000000, "Member 'SIK_AppLibrary_MarkContentCorrupt::MissingFilesOnly' has a wrong offset!");
static_assert(offsetof(SIK_AppLibrary_MarkContentCorrupt, ReturnValue) == 0x000001, "Member 'SIK_AppLibrary_MarkContentCorrupt::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AppLibrary.UninstallDLC
// 0x0004 (0x0004 - 0x0000)
struct SIK_AppLibrary_UninstallDLC final
{
public:
	struct FSIK_AppId                             AppID;                                             // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_AppLibrary_UninstallDLC) == 0x000004, "Wrong alignment on SIK_AppLibrary_UninstallDLC");
static_assert(sizeof(SIK_AppLibrary_UninstallDLC) == 0x000004, "Wrong size on SIK_AppLibrary_UninstallDLC");
static_assert(offsetof(SIK_AppLibrary_UninstallDLC, AppID) == 0x000000, "Member 'SIK_AppLibrary_UninstallDLC::AppID' has a wrong offset!");

// Function SteamIntegrationKit.SIK_AssociateWithClan_AsyncFunction.AssociateWithClan
// 0x0010 (0x0010 - 0x0000)
struct SIK_AssociateWithClan_AsyncFunction_AssociateWithClan final
{
public:
	struct FSIK_SteamId                           SteamIdClan;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class USIK_AssociateWithClan_AsyncFunction*   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_AssociateWithClan_AsyncFunction_AssociateWithClan) == 0x000008, "Wrong alignment on SIK_AssociateWithClan_AsyncFunction_AssociateWithClan");
static_assert(sizeof(SIK_AssociateWithClan_AsyncFunction_AssociateWithClan) == 0x000010, "Wrong size on SIK_AssociateWithClan_AsyncFunction_AssociateWithClan");
static_assert(offsetof(SIK_AssociateWithClan_AsyncFunction_AssociateWithClan, SteamIdClan) == 0x000000, "Member 'SIK_AssociateWithClan_AsyncFunction_AssociateWithClan::SteamIdClan' has a wrong offset!");
static_assert(offsetof(SIK_AssociateWithClan_AsyncFunction_AssociateWithClan, ReturnValue) == 0x000008, "Member 'SIK_AssociateWithClan_AsyncFunction_AssociateWithClan::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_FindLeaderboard_AsyncFunction.FindLeaderboard
// 0x0018 (0x0018 - 0x0000)
struct SIK_FindLeaderboard_AsyncFunction_FindLeaderboard final
{
public:
	class FString                                 LeaderboardName;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USIK_FindLeaderboard_AsyncFunction*     ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_FindLeaderboard_AsyncFunction_FindLeaderboard) == 0x000008, "Wrong alignment on SIK_FindLeaderboard_AsyncFunction_FindLeaderboard");
static_assert(sizeof(SIK_FindLeaderboard_AsyncFunction_FindLeaderboard) == 0x000018, "Wrong size on SIK_FindLeaderboard_AsyncFunction_FindLeaderboard");
static_assert(offsetof(SIK_FindLeaderboard_AsyncFunction_FindLeaderboard, LeaderboardName) == 0x000000, "Member 'SIK_FindLeaderboard_AsyncFunction_FindLeaderboard::LeaderboardName' has a wrong offset!");
static_assert(offsetof(SIK_FindLeaderboard_AsyncFunction_FindLeaderboard, ReturnValue) == 0x000010, "Member 'SIK_FindLeaderboard_AsyncFunction_FindLeaderboard::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_ChangeNumOpenSlots_AsyncFunction.ChangeNumOpenSlots
// 0x0018 (0x0018 - 0x0000)
struct SIK_ChangeNumOpenSlots_AsyncFunction_ChangeNumOpenSlots final
{
public:
	struct FSIK_PartyBeaconID                     PartyBeaconID;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         OpenSlots;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USIK_ChangeNumOpenSlots_AsyncFunction*  ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_ChangeNumOpenSlots_AsyncFunction_ChangeNumOpenSlots) == 0x000008, "Wrong alignment on SIK_ChangeNumOpenSlots_AsyncFunction_ChangeNumOpenSlots");
static_assert(sizeof(SIK_ChangeNumOpenSlots_AsyncFunction_ChangeNumOpenSlots) == 0x000018, "Wrong size on SIK_ChangeNumOpenSlots_AsyncFunction_ChangeNumOpenSlots");
static_assert(offsetof(SIK_ChangeNumOpenSlots_AsyncFunction_ChangeNumOpenSlots, PartyBeaconID) == 0x000000, "Member 'SIK_ChangeNumOpenSlots_AsyncFunction_ChangeNumOpenSlots::PartyBeaconID' has a wrong offset!");
static_assert(offsetof(SIK_ChangeNumOpenSlots_AsyncFunction_ChangeNumOpenSlots, OpenSlots) == 0x000008, "Member 'SIK_ChangeNumOpenSlots_AsyncFunction_ChangeNumOpenSlots::OpenSlots' has a wrong offset!");
static_assert(offsetof(SIK_ChangeNumOpenSlots_AsyncFunction_ChangeNumOpenSlots, ReturnValue) == 0x000010, "Member 'SIK_ChangeNumOpenSlots_AsyncFunction_ChangeNumOpenSlots::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_ComputeNewPlayerCompatibility_AsyncFunction.ComputeNewPlayerCompatibility
// 0x0010 (0x0010 - 0x0000)
struct SIK_ComputeNewPlayerCompatibility_AsyncFunction_ComputeNewPlayerCompatibility final
{
public:
	struct FSIK_SteamId                           PlayerSteamId;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class USIK_ComputeNewPlayerCompatibility_AsyncFunction* ReturnValue;                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_ComputeNewPlayerCompatibility_AsyncFunction_ComputeNewPlayerCompatibility) == 0x000008, "Wrong alignment on SIK_ComputeNewPlayerCompatibility_AsyncFunction_ComputeNewPlayerCompatibility");
static_assert(sizeof(SIK_ComputeNewPlayerCompatibility_AsyncFunction_ComputeNewPlayerCompatibility) == 0x000010, "Wrong size on SIK_ComputeNewPlayerCompatibility_AsyncFunction_ComputeNewPlayerCompatibility");
static_assert(offsetof(SIK_ComputeNewPlayerCompatibility_AsyncFunction_ComputeNewPlayerCompatibility, PlayerSteamId) == 0x000000, "Member 'SIK_ComputeNewPlayerCompatibility_AsyncFunction_ComputeNewPlayerCompatibility::PlayerSteamId' has a wrong offset!");
static_assert(offsetof(SIK_ComputeNewPlayerCompatibility_AsyncFunction_ComputeNewPlayerCompatibility, ReturnValue) == 0x000008, "Member 'SIK_ComputeNewPlayerCompatibility_AsyncFunction_ComputeNewPlayerCompatibility::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_DownloadClanActivityCounts_AsyncFunction.DownloadClanActivityCounts
// 0x0018 (0x0018 - 0x0000)
struct SIK_DownloadClanActivityCounts_AsyncFunction_DownloadClanActivityCounts final
{
public:
	TArray<int64>                                 ClanIds;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class USIK_DownloadClanActivityCounts_AsyncFunction* ReturnValue;                                // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_DownloadClanActivityCounts_AsyncFunction_DownloadClanActivityCounts) == 0x000008, "Wrong alignment on SIK_DownloadClanActivityCounts_AsyncFunction_DownloadClanActivityCounts");
static_assert(sizeof(SIK_DownloadClanActivityCounts_AsyncFunction_DownloadClanActivityCounts) == 0x000018, "Wrong size on SIK_DownloadClanActivityCounts_AsyncFunction_DownloadClanActivityCounts");
static_assert(offsetof(SIK_DownloadClanActivityCounts_AsyncFunction_DownloadClanActivityCounts, ClanIds) == 0x000000, "Member 'SIK_DownloadClanActivityCounts_AsyncFunction_DownloadClanActivityCounts::ClanIds' has a wrong offset!");
static_assert(offsetof(SIK_DownloadClanActivityCounts_AsyncFunction_DownloadClanActivityCounts, ReturnValue) == 0x000010, "Member 'SIK_DownloadClanActivityCounts_AsyncFunction_DownloadClanActivityCounts::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_CreateBeacon_AsyncFunction.CreateBeacon
// 0x0040 (0x0040 - 0x0000)
struct SIK_CreateBeacon_AsyncFunction_CreateBeacon final
{
public:
	int32                                         OpenSlots;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSIK_SteamPartyBeaconLocation          Location;                                          // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ConnectString;                                     // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MetaData;                                          // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USIK_CreateBeacon_AsyncFunction*        ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_CreateBeacon_AsyncFunction_CreateBeacon) == 0x000008, "Wrong alignment on SIK_CreateBeacon_AsyncFunction_CreateBeacon");
static_assert(sizeof(SIK_CreateBeacon_AsyncFunction_CreateBeacon) == 0x000040, "Wrong size on SIK_CreateBeacon_AsyncFunction_CreateBeacon");
static_assert(offsetof(SIK_CreateBeacon_AsyncFunction_CreateBeacon, OpenSlots) == 0x000000, "Member 'SIK_CreateBeacon_AsyncFunction_CreateBeacon::OpenSlots' has a wrong offset!");
static_assert(offsetof(SIK_CreateBeacon_AsyncFunction_CreateBeacon, Location) == 0x000008, "Member 'SIK_CreateBeacon_AsyncFunction_CreateBeacon::Location' has a wrong offset!");
static_assert(offsetof(SIK_CreateBeacon_AsyncFunction_CreateBeacon, ConnectString) == 0x000018, "Member 'SIK_CreateBeacon_AsyncFunction_CreateBeacon::ConnectString' has a wrong offset!");
static_assert(offsetof(SIK_CreateBeacon_AsyncFunction_CreateBeacon, MetaData) == 0x000028, "Member 'SIK_CreateBeacon_AsyncFunction_CreateBeacon::MetaData' has a wrong offset!");
static_assert(offsetof(SIK_CreateBeacon_AsyncFunction_CreateBeacon, ReturnValue) == 0x000038, "Member 'SIK_CreateBeacon_AsyncFunction_CreateBeacon::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_CreateItem_AsyncFunction.CreateItem
// 0x0010 (0x0010 - 0x0000)
struct SIK_CreateItem_AsyncFunction_CreateItem final
{
public:
	struct FSIK_AppId                             ConsumerAppID;                                     // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	ESIK_WorkshopFileType                         FileType;                                          // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USIK_CreateItem_AsyncFunction*          ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_CreateItem_AsyncFunction_CreateItem) == 0x000008, "Wrong alignment on SIK_CreateItem_AsyncFunction_CreateItem");
static_assert(sizeof(SIK_CreateItem_AsyncFunction_CreateItem) == 0x000010, "Wrong size on SIK_CreateItem_AsyncFunction_CreateItem");
static_assert(offsetof(SIK_CreateItem_AsyncFunction_CreateItem, ConsumerAppID) == 0x000000, "Member 'SIK_CreateItem_AsyncFunction_CreateItem::ConsumerAppID' has a wrong offset!");
static_assert(offsetof(SIK_CreateItem_AsyncFunction_CreateItem, FileType) == 0x000004, "Member 'SIK_CreateItem_AsyncFunction_CreateItem::FileType' has a wrong offset!");
static_assert(offsetof(SIK_CreateItem_AsyncFunction_CreateItem, ReturnValue) == 0x000008, "Member 'SIK_CreateItem_AsyncFunction_CreateItem::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_CreateLeaderboard_AsyncFunction.CreateLeaderboard
// 0x0020 (0x0020 - 0x0000)
struct SIK_CreateLeaderboard_AsyncFunction_CreateLeaderboard final
{
public:
	class FString                                 LeaderboardName;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESIK_LeaderboardSortMethod                    SortMethod;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESIK_LeaderboardDisplayType                   DisplayType;                                       // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USIK_CreateLeaderboard_AsyncFunction*   ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_CreateLeaderboard_AsyncFunction_CreateLeaderboard) == 0x000008, "Wrong alignment on SIK_CreateLeaderboard_AsyncFunction_CreateLeaderboard");
static_assert(sizeof(SIK_CreateLeaderboard_AsyncFunction_CreateLeaderboard) == 0x000020, "Wrong size on SIK_CreateLeaderboard_AsyncFunction_CreateLeaderboard");
static_assert(offsetof(SIK_CreateLeaderboard_AsyncFunction_CreateLeaderboard, LeaderboardName) == 0x000000, "Member 'SIK_CreateLeaderboard_AsyncFunction_CreateLeaderboard::LeaderboardName' has a wrong offset!");
static_assert(offsetof(SIK_CreateLeaderboard_AsyncFunction_CreateLeaderboard, SortMethod) == 0x000010, "Member 'SIK_CreateLeaderboard_AsyncFunction_CreateLeaderboard::SortMethod' has a wrong offset!");
static_assert(offsetof(SIK_CreateLeaderboard_AsyncFunction_CreateLeaderboard, DisplayType) == 0x000011, "Member 'SIK_CreateLeaderboard_AsyncFunction_CreateLeaderboard::DisplayType' has a wrong offset!");
static_assert(offsetof(SIK_CreateLeaderboard_AsyncFunction_CreateLeaderboard, ReturnValue) == 0x000018, "Member 'SIK_CreateLeaderboard_AsyncFunction_CreateLeaderboard::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_CreateLobby_AsyncFunction.CreateSIKLobby
// 0x0070 (0x0070 - 0x0000)
struct SIK_CreateLobby_AsyncFunction_CreateSIKLobby final
{
public:
	TMap<class FString, struct FSIKAttribute>     SessionSettings;                                   // 0x0000(0x0050)(Parm, NativeAccessSpecifierPublic)
	class FName                                   SessionName;                                       // 0x0050(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumberOfPublicConnections;                         // 0x0058(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSIKCreateLobbySettings                ExtraSettings;                                     // 0x005C(0x000C)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class USIK_CreateLobby_AsyncFunction*         ReturnValue;                                       // 0x0068(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_CreateLobby_AsyncFunction_CreateSIKLobby) == 0x000008, "Wrong alignment on SIK_CreateLobby_AsyncFunction_CreateSIKLobby");
static_assert(sizeof(SIK_CreateLobby_AsyncFunction_CreateSIKLobby) == 0x000070, "Wrong size on SIK_CreateLobby_AsyncFunction_CreateSIKLobby");
static_assert(offsetof(SIK_CreateLobby_AsyncFunction_CreateSIKLobby, SessionSettings) == 0x000000, "Member 'SIK_CreateLobby_AsyncFunction_CreateSIKLobby::SessionSettings' has a wrong offset!");
static_assert(offsetof(SIK_CreateLobby_AsyncFunction_CreateSIKLobby, SessionName) == 0x000050, "Member 'SIK_CreateLobby_AsyncFunction_CreateSIKLobby::SessionName' has a wrong offset!");
static_assert(offsetof(SIK_CreateLobby_AsyncFunction_CreateSIKLobby, NumberOfPublicConnections) == 0x000058, "Member 'SIK_CreateLobby_AsyncFunction_CreateSIKLobby::NumberOfPublicConnections' has a wrong offset!");
static_assert(offsetof(SIK_CreateLobby_AsyncFunction_CreateSIKLobby, ExtraSettings) == 0x00005C, "Member 'SIK_CreateLobby_AsyncFunction_CreateSIKLobby::ExtraSettings' has a wrong offset!");
static_assert(offsetof(SIK_CreateLobby_AsyncFunction_CreateSIKLobby, ReturnValue) == 0x000068, "Member 'SIK_CreateLobby_AsyncFunction_CreateSIKLobby::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_FileShare_AsyncFunction.FileShareAsync
// 0x0018 (0x0018 - 0x0000)
struct SIK_FileShare_AsyncFunction_FileShareAsync final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USIK_FileShare_AsyncFunction*           ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_FileShare_AsyncFunction_FileShareAsync) == 0x000008, "Wrong alignment on SIK_FileShare_AsyncFunction_FileShareAsync");
static_assert(sizeof(SIK_FileShare_AsyncFunction_FileShareAsync) == 0x000018, "Wrong size on SIK_FileShare_AsyncFunction_FileShareAsync");
static_assert(offsetof(SIK_FileShare_AsyncFunction_FileShareAsync, Filename) == 0x000000, "Member 'SIK_FileShare_AsyncFunction_FileShareAsync::Filename' has a wrong offset!");
static_assert(offsetof(SIK_FileShare_AsyncFunction_FileShareAsync, ReturnValue) == 0x000010, "Member 'SIK_FileShare_AsyncFunction_FileShareAsync::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_CreateSession_AsyncFunction.CreateEIKSession
// 0x0080 (0x0080 - 0x0000)
struct SIK_CreateSession_AsyncFunction_CreateEIKSession final
{
public:
	TMap<class FString, struct FSIKAttribute>     SessionSettings;                                   // 0x0000(0x0050)(Parm, NativeAccessSpecifierPublic)
	class FName                                   SessionName;                                       // 0x0050(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumberOfPublicConnections;                         // 0x0058(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSIKDedicatedServerSettings            DedicatedServerSettings;                           // 0x005C(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FSIK_CreateSessionExtraSettings        ExtraSettings;                                     // 0x0064(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USIK_CreateSession_AsyncFunction*       ReturnValue;                                       // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SIK_CreateSession_AsyncFunction_CreateEIKSession) == 0x000008, "Wrong alignment on SIK_CreateSession_AsyncFunction_CreateEIKSession");
static_assert(sizeof(SIK_CreateSession_AsyncFunction_CreateEIKSession) == 0x000080, "Wrong size on SIK_CreateSession_AsyncFunction_CreateEIKSession");
static_assert(offsetof(SIK_CreateSession_AsyncFunction_CreateEIKSession, SessionSettings) == 0x000000, "Member 'SIK_CreateSession_AsyncFunction_CreateEIKSession::SessionSettings' has a wrong offset!");
static_assert(offsetof(SIK_CreateSession_AsyncFunction_CreateEIKSession, SessionName) == 0x000050, "Member 'SIK_CreateSession_AsyncFunction_CreateEIKSession::SessionName' has a wrong offset!");
static_assert(offsetof(SIK_CreateSession_AsyncFunction_CreateEIKSession, NumberOfPublicConnections) == 0x000058, "Member 'SIK_CreateSession_AsyncFunction_CreateEIKSession::NumberOfPublicConnections' has a wrong offset!");
static_assert(offsetof(SIK_CreateSession_AsyncFunction_CreateEIKSession, DedicatedServerSettings) == 0x00005C, "Member 'SIK_CreateSession_AsyncFunction_CreateEIKSession::DedicatedServerSettings' has a wrong offset!");
static_assert(offsetof(SIK_CreateSession_AsyncFunction_CreateEIKSession, ExtraSettings) == 0x000064, "Member 'SIK_CreateSession_AsyncFunction_CreateEIKSession::ExtraSettings' has a wrong offset!");
static_assert(offsetof(SIK_CreateSession_AsyncFunction_CreateEIKSession, ReturnValue) == 0x000078, "Member 'SIK_CreateSession_AsyncFunction_CreateEIKSession::ReturnValue' has a wrong offset!");

// Function SteamIntegrationKit.SIK_DeleteItem_AsyncFunction.DeleteItem
// 0x0010 (0x0010 - 0x0000)
struct SIK_DeleteItem_AsyncFunction_DeleteItem final
{
public:
