#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UE5Coro

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UE5Coro.UE5CoroAnimCallbackTarget.BoolProperty
// 0x0010 (0x0010 - 0x0000)
struct UE5CoroAnimCallbackTarget_BoolProperty final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UE5CoroAnimCallbackTarget_BoolProperty) == 0x000008, "Wrong alignment on UE5CoroAnimCallbackTarget_BoolProperty");
static_assert(sizeof(UE5CoroAnimCallbackTarget_BoolProperty) == 0x000010, "Wrong size on UE5CoroAnimCallbackTarget_BoolProperty");
static_assert(offsetof(UE5CoroAnimCallbackTarget_BoolProperty, Montage) == 0x000000, "Member 'UE5CoroAnimCallbackTarget_BoolProperty::Montage' has a wrong offset!");
static_assert(offsetof(UE5CoroAnimCallbackTarget_BoolProperty, bInterrupted) == 0x000008, "Member 'UE5CoroAnimCallbackTarget_BoolProperty::bInterrupted' has a wrong offset!");

// Function UE5Coro.UE5CoroAnimCallbackTarget.NameProperty
// 0x0028 (0x0028 - 0x0000)
struct UE5CoroAnimCallbackTarget_NameProperty final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBranchingPointNotifyPayload           Payload;                                           // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(UE5CoroAnimCallbackTarget_NameProperty) == 0x000008, "Wrong alignment on UE5CoroAnimCallbackTarget_NameProperty");
static_assert(sizeof(UE5CoroAnimCallbackTarget_NameProperty) == 0x000028, "Wrong size on UE5CoroAnimCallbackTarget_NameProperty");
static_assert(offsetof(UE5CoroAnimCallbackTarget_NameProperty, NotifyName) == 0x000000, "Member 'UE5CoroAnimCallbackTarget_NameProperty::NotifyName' has a wrong offset!");
static_assert(offsetof(UE5CoroAnimCallbackTarget_NameProperty, Payload) == 0x000008, "Member 'UE5CoroAnimCallbackTarget_NameProperty::Payload' has a wrong offset!");

// Function UE5Coro.UE5CoroChainCallbackTarget.Core
// 0x0004 (0x0004 - 0x0000)
struct UE5CoroChainCallbackTarget_Core final
{
public:
	int32                                         Link;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UE5CoroChainCallbackTarget_Core) == 0x000004, "Wrong alignment on UE5CoroChainCallbackTarget_Core");
static_assert(sizeof(UE5CoroChainCallbackTarget_Core) == 0x000004, "Wrong size on UE5CoroChainCallbackTarget_Core");
static_assert(offsetof(UE5CoroChainCallbackTarget_Core, Link) == 0x000000, "Member 'UE5CoroChainCallbackTarget_Core::Link' has a wrong offset!");

}

