#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ultra_Dynamic_Weather

#include "Basic.hpp"

#include "UDS_ControlPointMode_structs.hpp"
#include "UDS_and_UDW_State_structs.hpp"
#include "RandomWeatherVariation_State_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UDS_Weather_Display_Names_structs.hpp"
#include "UDS_DLWE_Mode_structs.hpp"
#include "UDS_TemperatureType_structs.hpp"


namespace SDK::Params
{

// Function Ultra_Dynamic_Weather.Ultra_Dynamic_Weather_C.Local Weather
// 0x01E8 (0x01E8 - 0x0000)
struct Ultra_Dynamic_Weather_C_Local_Weather final
{
public:
	double                                        Previous_Material_Wet;                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Previous_Material_Snow;                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Previous_Weather_Intensity;                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Snow_0;                                            // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Previous_Wind_Intensity;                           // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Previous_Cloud_Coverage;                           // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Distance_from_Spline_Center;                       // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeather_Override_Volume_C*             Current_Volume;                                    // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                        Current_Volume_Alpha;                              // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Inserted;                                          // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Priorities;                                        // 0x0050(0x0010)(Edit, BlueprintVisible)
	TArray<class AWeather_Override_Volume_C*>     Filtered_List_of_Volumes;                          // 0x0060(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Compare_Weather_States_Different;         // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue_1;      // 0x007F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue_2;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWeather_Override_Volume_C*             CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_FindRightVectorClosestToWorldLocation_ReturnValue; // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_FindLocationClosestToWorldLocation_ReturnValue; // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Normal2D_ReturnValue;                     // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DotProduct2D_ReturnValue;                 // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C3[0x5];                                      // 0x01C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Ease_ReturnValue;                         // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_C_Local_Weather) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_C_Local_Weather");
static_assert(sizeof(Ultra_Dynamic_Weather_C_Local_Weather) == 0x0001E8, "Wrong size on Ultra_Dynamic_Weather_C_Local_Weather");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, Previous_Material_Wet) == 0x000000, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::Previous_Material_Wet' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, Previous_Material_Snow) == 0x000008, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::Previous_Material_Snow' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, Previous_Weather_Intensity) == 0x000010, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::Previous_Weather_Intensity' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, Snow_0) == 0x000018, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::Snow_0' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, Previous_Wind_Intensity) == 0x000020, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::Previous_Wind_Intensity' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, Previous_Cloud_Coverage) == 0x000028, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::Previous_Cloud_Coverage' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, Distance_from_Spline_Center) == 0x000030, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::Distance_from_Spline_Center' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, Current_Volume) == 0x000038, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::Current_Volume' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, Current_Volume_Alpha) == 0x000040, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::Current_Volume_Alpha' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, Inserted) == 0x000048, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::Inserted' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, Priorities) == 0x000050, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::Priorities' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, Filtered_List_of_Volumes) == 0x000060, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::Filtered_List_of_Volumes' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, Temp_int_Array_Index_Variable) == 0x000070, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, Temp_int_Loop_Counter_Variable) == 0x000074, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_Subtract_IntInt_ReturnValue) == 0x000078, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00007C, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x00007D, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_Compare_Weather_States_Different) == 0x00007E, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_Compare_Weather_States_Different' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_NotEqual_DoubleDouble_ReturnValue_1) == 0x00007F, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_NotEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_NotEqual_DoubleDouble_ReturnValue_2) == 0x000080, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_NotEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_BooleanOR_ReturnValue) == 0x000081, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_BooleanOR_ReturnValue_1) == 0x000082, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_BooleanOR_ReturnValue_2) == 0x000083, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_Array_Get_Item) == 0x000088, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_Vector_Distance_ReturnValue) == 0x000090, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000098, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_Array_Length_ReturnValue) == 0x00009C, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000A0, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_Max_ReturnValue) == 0x0000A4, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000A8, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_BreakVector_X) == 0x0000C0, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_BreakVector_Y) == 0x0000C8, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_BreakVector_Z) == 0x0000D0, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000D8, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000E0, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_BreakVector_X_1) == 0x0000E8, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_BreakVector_Y_1) == 0x0000F0, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_BreakVector_Z_1) == 0x0000F8, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_MakeVector_ReturnValue) == 0x000100, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_Array_Length_ReturnValue_1) == 0x000118, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_FindRightVectorClosestToWorldLocation_ReturnValue) == 0x000120, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_FindRightVectorClosestToWorldLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_Greater_IntInt_ReturnValue) == 0x000138, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000140, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_FindLocationClosestToWorldLocation_ReturnValue) == 0x000150, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_FindLocationClosestToWorldLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_IsDedicatedServer_ReturnValue) == 0x000168, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000170, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_Not_PreBool_ReturnValue) == 0x000188, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_Conv_VectorToVector2D_ReturnValue_1) == 0x000190, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_Conv_VectorToVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_VSize_ReturnValue) == 0x0001A0, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_Normal2D_ReturnValue) == 0x0001A8, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_Normal2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_DotProduct2D_ReturnValue) == 0x0001B8, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_DotProduct2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_BooleanAND_ReturnValue) == 0x0001C0, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x0001C1, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_BooleanAND_ReturnValue_1) == 0x0001C2, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_SelectFloat_ReturnValue) == 0x0001C8, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0001D0, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_MapRangeClamped_ReturnValue) == 0x0001D8, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Local_Weather, CallFunc_Ease_ReturnValue) == 0x0001E0, "Member 'Ultra_Dynamic_Weather_C_Local_Weather::CallFunc_Ease_ReturnValue' has a wrong offset!");

// Function Ultra_Dynamic_Weather.Ultra_Dynamic_Weather_C.Apply State
// 0x0118 (0x0118 - 0x0000)
struct Ultra_Dynamic_Weather_C_Apply_State final
{
public:
	struct FUDS_and_UDW_State                     State;                                             // 0x0000(0x0118)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_C_Apply_State) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_C_Apply_State");
static_assert(sizeof(Ultra_Dynamic_Weather_C_Apply_State) == 0x000118, "Wrong size on Ultra_Dynamic_Weather_C_Apply_State");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_State, State) == 0x000000, "Member 'Ultra_Dynamic_Weather_C_Apply_State::State' has a wrong offset!");

// Function Ultra_Dynamic_Weather.Ultra_Dynamic_Weather_C.Approximate Weather Mask Brush Effect
// 0x0198 (0x0198 - 0x0000)
struct Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect final
{
public:
	class AWeather_Mask_Brush_C*                  Brush;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Location;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Height;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Out;                                               // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Cancel;                                            // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Cancel_Mask_Above;                                 // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Mask_Strength;                                     // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Centered_UV;                                       // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Mask;                                              // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Distance2D_ReturnValue;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetAbsMax2D_ReturnValue;                  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize2D_ReturnValue;                      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUDS_DLWE_Mode                                Temp_byte_Variable;                                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue_2;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetAbsMax2D_ReturnValue_1;                // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_3;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetAbsMax2D_ReturnValue_2;                // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize2D_ReturnValue_1;                    // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetRotated2D_ReturnValue;                 // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DVector2D_ReturnValue;      // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRotated2D_AngleDeg_ImplicitCast;       // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect");
static_assert(sizeof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect) == 0x000198, "Wrong size on Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, Brush) == 0x000000, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::Brush' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, Location) == 0x000008, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::Location' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, Height) == 0x000018, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::Height' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, Out) == 0x000020, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::Out' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, Cancel) == 0x000028, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::Cancel' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, Cancel_Mask_Above) == 0x000029, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::Cancel_Mask_Above' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, Mask_Strength) == 0x000030, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::Mask_Strength' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, Centered_UV) == 0x000038, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::Centered_UV' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, Mask) == 0x000048, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::Mask' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_Distance2D_ReturnValue) == 0x000050, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000058, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000070, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_BreakVector_X) == 0x000078, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_BreakVector_Y) == 0x000080, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_BreakVector_Z) == 0x000088, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000090, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_BreakVector2D_X) == 0x000098, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_BreakVector2D_Y) == 0x0000A0, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_MapRangeClamped_ReturnValue) == 0x0000A8, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_GetAbsMax2D_ReturnValue) == 0x0000B0, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_GetAbsMax2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_Abs_ReturnValue) == 0x0000B8, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x0000C0, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_MapRangeClamped_ReturnValue_1) == 0x0000C8, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000D0, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_VSize2D_ReturnValue) == 0x0000D8, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_VSize2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, Temp_byte_Variable) == 0x0000E0, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_MapRangeClamped_ReturnValue_2) == 0x0000E8, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_MapRangeClamped_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_GetAbsMax2D_ReturnValue_1) == 0x0000F0, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_GetAbsMax2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_MapRangeClamped_ReturnValue_3) == 0x0000F8, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_MapRangeClamped_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_GetAbsMax2D_ReturnValue_2) == 0x000100, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_GetAbsMax2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000108, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000110, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_FClamp_ReturnValue) == 0x000118, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000120, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, K2Node_Select_Default) == 0x000128, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, K2Node_SwitchEnum_CmpSuccess) == 0x000130, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_VSize2D_ReturnValue_1) == 0x000138, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_VSize2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000140, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000148, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_FClamp_ReturnValue_1) == 0x000150, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000158, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000168, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_GetRotated2D_ReturnValue) == 0x000170, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_GetRotated2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_Divide_Vector2DVector2D_ReturnValue) == 0x000180, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_Divide_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect, CallFunc_GetRotated2D_AngleDeg_ImplicitCast) == 0x000190, "Member 'Ultra_Dynamic_Weather_C_Approximate_Weather_Mask_Brush_Effect::CallFunc_GetRotated2D_AngleDeg_ImplicitCast' has a wrong offset!");

// Function Ultra_Dynamic_Weather.Ultra_Dynamic_Weather_C.Audio Update
// 0x02F8 (0x02F8 - 0x0000)
struct Ultra_Dynamic_Weather_C_Audio_Update final
{
public:
	double                                        Current_Wind_Sound_Intensity;                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                Sound_Occlusion;                                   // 0x0008(0x0010)(Edit, BlueprintVisible)
	double                                        Current_Wind_Global_LPF;                           // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Wind_Whistling_Sound_Intensity_Int;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Light_Rain_Sound_Intensity_Int;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Rain_Sound_Intensity_Int;                 // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Current_Weather_State_is_Changing_Changing; // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Current_Weather_State_is_Changing_Changing_1; // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Wind_Rotation_Rot;                        // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Distant_Thunder_Sound_Intensity_Int;      // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Wind_Sound_Intensity_Int;                 // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item_1;                         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item_2;                         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item_3;                         // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item_4;                         // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                K2Node_MakeArray_Array_1;                          // 0x0148(0x0010)(ReferenceParm)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_2;                       // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_3;                       // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_4;                       // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_5;                       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMin_ReturnValue_1;                       // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_Array_Get_Item_5;                         // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue_2;            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
