#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_AudioTab

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Odin_structs.hpp"


namespace SDK::Params
{

// Function W_AudioTab.W_AudioTab_C.BndEvt__W_AudioTab_IlluminationQBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_AudioTab_C_BndEvt__W_AudioTab_IlluminationQBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_AudioTab_C_BndEvt__W_AudioTab_IlluminationQBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on W_AudioTab_C_BndEvt__W_AudioTab_IlluminationQBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(W_AudioTab_C_BndEvt__W_AudioTab_IlluminationQBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on W_AudioTab_C_BndEvt__W_AudioTab_IlluminationQBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(W_AudioTab_C_BndEvt__W_AudioTab_IlluminationQBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'W_AudioTab_C_BndEvt__W_AudioTab_IlluminationQBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_BndEvt__W_AudioTab_IlluminationQBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'W_AudioTab_C_BndEvt__W_AudioTab_IlluminationQBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function W_AudioTab.W_AudioTab_C.BndEvt__W_AudioTab_MasterVolumeSlider_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_AudioTab_C_BndEvt__W_AudioTab_MasterVolumeSlider_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_AudioTab_C_BndEvt__W_AudioTab_MasterVolumeSlider_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on W_AudioTab_C_BndEvt__W_AudioTab_MasterVolumeSlider_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(W_AudioTab_C_BndEvt__W_AudioTab_MasterVolumeSlider_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on W_AudioTab_C_BndEvt__W_AudioTab_MasterVolumeSlider_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(W_AudioTab_C_BndEvt__W_AudioTab_MasterVolumeSlider_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'W_AudioTab_C_BndEvt__W_AudioTab_MasterVolumeSlider_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function W_AudioTab.W_AudioTab_C.BndEvt__W_AudioTab_ModeQBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_AudioTab_C_BndEvt__W_AudioTab_ModeQBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_AudioTab_C_BndEvt__W_AudioTab_ModeQBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on W_AudioTab_C_BndEvt__W_AudioTab_ModeQBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(W_AudioTab_C_BndEvt__W_AudioTab_ModeQBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on W_AudioTab_C_BndEvt__W_AudioTab_ModeQBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(W_AudioTab_C_BndEvt__W_AudioTab_ModeQBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'W_AudioTab_C_BndEvt__W_AudioTab_ModeQBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_BndEvt__W_AudioTab_ModeQBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'W_AudioTab_C_BndEvt__W_AudioTab_ModeQBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function W_AudioTab.W_AudioTab_C.BndEvt__W_AudioTab_MusicCheckBox_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_AudioTab_C_BndEvt__W_AudioTab_MusicCheckBox_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_AudioTab_C_BndEvt__W_AudioTab_MusicCheckBox_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on W_AudioTab_C_BndEvt__W_AudioTab_MusicCheckBox_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(W_AudioTab_C_BndEvt__W_AudioTab_MusicCheckBox_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on W_AudioTab_C_BndEvt__W_AudioTab_MusicCheckBox_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(W_AudioTab_C_BndEvt__W_AudioTab_MusicCheckBox_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'W_AudioTab_C_BndEvt__W_AudioTab_MusicCheckBox_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function W_AudioTab.W_AudioTab_C.BndEvt__W_AudioTab_VoiceChatVolumeSlider_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_AudioTab_C_BndEvt__W_AudioTab_VoiceChatVolumeSlider_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_AudioTab_C_BndEvt__W_AudioTab_VoiceChatVolumeSlider_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on W_AudioTab_C_BndEvt__W_AudioTab_VoiceChatVolumeSlider_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(W_AudioTab_C_BndEvt__W_AudioTab_VoiceChatVolumeSlider_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on W_AudioTab_C_BndEvt__W_AudioTab_VoiceChatVolumeSlider_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(W_AudioTab_C_BndEvt__W_AudioTab_VoiceChatVolumeSlider_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'W_AudioTab_C_BndEvt__W_AudioTab_VoiceChatVolumeSlider_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function W_AudioTab.W_AudioTab_C.BndEvt__W_AudioTab_VolumeSlider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_AudioTab_C_BndEvt__W_AudioTab_VolumeSlider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_AudioTab_C_BndEvt__W_AudioTab_VolumeSlider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on W_AudioTab_C_BndEvt__W_AudioTab_VolumeSlider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(W_AudioTab_C_BndEvt__W_AudioTab_VolumeSlider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on W_AudioTab_C_BndEvt__W_AudioTab_VolumeSlider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(W_AudioTab_C_BndEvt__W_AudioTab_VolumeSlider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'W_AudioTab_C_BndEvt__W_AudioTab_VolumeSlider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function W_AudioTab.W_AudioTab_C.ExecuteUbergraph_W_AudioTab
// 0x0240 (0x0240 - 0x0000)
struct W_AudioTab_C_ExecuteUbergraph_W_AudioTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_VoiceChat_C*                        CallFunc_GetActorOfClass_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_VoiceChat_C*                        CallFunc_GetActorOfClass_ReturnValue_1;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem_1;         // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType_1;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPGameMode_C*                       K2Node_DynamicCast_AsBP_UPGame_Mode;               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_VoiceChat_C*                        CallFunc_GetActorOfClass_ReturnValue_2;            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_VoiceChat_C*                        CallFunc_GetActorOfClass_ReturnValue_3;            // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOdinCaptureDeviceInfo>         K2Node_CustomEvent_Devices;                        // 0x0090(0x0010)(ConstParm, ReferenceParm)
	struct FOdinCaptureDeviceInfo                 K2Node_CustomEvent_CurrentDevice;                  // 0x00A0(0x0020)(ConstParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_VoiceChat_C*                        CallFunc_GetActorOfClass_ReturnValue_4;            // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_MainMenu_C*                          K2Node_Event_MainMenu;                             // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Value_2;                // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_VoiceChat_C*                        CallFunc_GetActorOfClass_ReturnValue_5;            // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedIndex_ReturnValue;             // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate;             // 0x0124(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOdinCaptureDeviceInfo                 CallFunc_Array_Get_Item;                           // 0x0138(0x0020)()
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance;           // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A[0x2];                                      // 0x017A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Value_1;                // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_VoiceChat_C*                        CallFunc_GetActorOfClass_ReturnValue_6;            // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_VoiceChat_C*                        CallFunc_GetActorOfClass_ReturnValue_7;            // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCaptureDevice_Success;                 // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_VoiceChat_C*                        CallFunc_GetActorOfClass_ReturnValue_8;            // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCaptureDevices_Success;                // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOdinCaptureDeviceInfo>         CallFunc_GetCaptureDevices_Devices;                // 0x01C0(0x0010)(ReferenceParm)
	struct FOdinCaptureDeviceInfo                 CallFunc_GetCaptureDevices_CurrentDevice;          // 0x01D0(0x0020)()
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetValue_InValue_ImplicitCast;            // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetCaptureVolumeMultiplier_CaptureVolumeMultiplier_ImplicitCast; // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetPercentageValue_Value_ImplicitCast;    // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast_1;          // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetPlaybackVolumeMultiplier_PlaybackVolumeMultiplier_ImplicitCast; // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetPercentageValue_Value_ImplicitCast_1;  // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetMasterVolume_MasterVolume_ImplicitCast; // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetPercentageValue_Value_ImplicitCast_2;  // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast_2;          // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetCaptureVolumeMultiplier_CaptureVolumeMultiplier_ImplicitCast_1; // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab) == 0x000008, "Wrong alignment on W_AudioTab_C_ExecuteUbergraph_W_AudioTab");
static_assert(sizeof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab) == 0x000240, "Wrong size on W_AudioTab_C_ExecuteUbergraph_W_AudioTab");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, EntryPoint) == 0x000000, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_GetActorOfClass_ReturnValue) == 0x000008, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_GetActorOfClass_ReturnValue_1) == 0x000018, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_GetActorOfClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_GetGameMode_ReturnValue) == 0x000028, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, K2Node_ComponentBoundEvent_SelectedItem_1) == 0x000030, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::K2Node_ComponentBoundEvent_SelectedItem_1' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, K2Node_ComponentBoundEvent_SelectionType_1) == 0x000040, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::K2Node_ComponentBoundEvent_SelectionType_1' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, K2Node_DynamicCast_AsBP_UPGame_Mode) == 0x000048, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::K2Node_DynamicCast_AsBP_UPGame_Mode' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_Conv_StringToName_ReturnValue) == 0x000054, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_IsEmpty_ReturnValue) == 0x00005C, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_IsValid_ReturnValue_2) == 0x00005D, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_Not_PreBool_ReturnValue) == 0x00005E, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, K2Node_CustomEvent_InVisibility) == 0x00005F, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_GetActorOfClass_ReturnValue_2) == 0x000060, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_GetActorOfClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000068, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_IsValid_ReturnValue_3) == 0x000069, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_GetActorOfClass_ReturnValue_3) == 0x000070, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_GetActorOfClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_IsValid_ReturnValue_4) == 0x000078, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_SelectInt_ReturnValue) == 0x00007C, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_GetGameMode_ReturnValue_1) == 0x000080, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_GetGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_IsValid_ReturnValue_5) == 0x000088, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, K2Node_CustomEvent_Devices) == 0x000090, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::K2Node_CustomEvent_Devices' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, K2Node_CustomEvent_CurrentDevice) == 0x0000A0, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::K2Node_CustomEvent_CurrentDevice' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_GetActorOfClass_ReturnValue_4) == 0x0000C8, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_GetActorOfClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_Conv_NameToString_ReturnValue) == 0x0000D0, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_IsValid_ReturnValue_6) == 0x0000E0, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_NotEqual_StrStr_ReturnValue) == 0x0000E1, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, K2Node_Event_MainMenu) == 0x0000E8, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::K2Node_Event_MainMenu' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_BooleanAND_ReturnValue) == 0x0000F0, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, K2Node_ComponentBoundEvent_Value_2) == 0x0000F4, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::K2Node_ComponentBoundEvent_Value_2' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_GetActorOfClass_ReturnValue_5) == 0x0000F8, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_GetActorOfClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_IsValid_ReturnValue_7) == 0x000100, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, K2Node_ComponentBoundEvent_SelectedItem) == 0x000108, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, K2Node_ComponentBoundEvent_SelectionType) == 0x000118, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_GetSelectedIndex_ReturnValue) == 0x00011C, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_GetSelectedIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000120, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, K2Node_CreateDelegate_OutputDelegate) == 0x000124, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, Temp_int_Array_Index_Variable) == 0x000134, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_Array_Get_Item) == 0x000138, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000158, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_GetGameInstance_ReturnValue) == 0x000168, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, K2Node_DynamicCast_AsBP_UPGame_Instance) == 0x000170, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::K2Node_DynamicCast_AsBP_UPGame_Instance' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, K2Node_DynamicCast_bSuccess_1) == 0x000178, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, K2Node_ComponentBoundEvent_bIsChecked) == 0x000179, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, K2Node_ComponentBoundEvent_Value_1) == 0x00017C, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_GetActorOfClass_ReturnValue_6) == 0x000180, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_GetActorOfClass_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_IsValid_ReturnValue_8) == 0x000188, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, K2Node_ComponentBoundEvent_Value) == 0x00018C, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, Temp_int_Loop_Counter_Variable) == 0x000190, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_GetValue_ReturnValue) == 0x000194, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_Less_IntInt_ReturnValue) == 0x000198, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_Add_IntInt_ReturnValue) == 0x00019C, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_GetActorOfClass_ReturnValue_7) == 0x0001A0, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_GetActorOfClass_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_SetCaptureDevice_Success) == 0x0001A8, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_SetCaptureDevice_Success' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_IsValid_ReturnValue_9) == 0x0001A9, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_GetActorOfClass_ReturnValue_8) == 0x0001B0, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_GetActorOfClass_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_GetCaptureDevices_Success) == 0x0001B8, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_GetCaptureDevices_Success' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_GetCaptureDevices_Devices) == 0x0001C0, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_GetCaptureDevices_Devices' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_GetCaptureDevices_CurrentDevice) == 0x0001D0, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_GetCaptureDevices_CurrentDevice' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_IsValid_ReturnValue_10) == 0x0001F0, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_SetValue_InValue_ImplicitCast) == 0x0001F4, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_SetValue_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_SetCaptureVolumeMultiplier_CaptureVolumeMultiplier_ImplicitCast) == 0x0001F8, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_SetCaptureVolumeMultiplier_CaptureVolumeMultiplier_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_SetPercentageValue_Value_ImplicitCast) == 0x000200, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_SetPercentageValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_SetValue_InValue_ImplicitCast_1) == 0x000208, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_SetValue_InValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_SetPlaybackVolumeMultiplier_PlaybackVolumeMultiplier_ImplicitCast) == 0x000210, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_SetPlaybackVolumeMultiplier_PlaybackVolumeMultiplier_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_SetPercentageValue_Value_ImplicitCast_1) == 0x000218, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_SetPercentageValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_SetMasterVolume_MasterVolume_ImplicitCast) == 0x000220, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_SetMasterVolume_MasterVolume_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_SetPercentageValue_Value_ImplicitCast_2) == 0x000228, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_SetPercentageValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_SetValue_InValue_ImplicitCast_2) == 0x000230, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_SetValue_InValue_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_ExecuteUbergraph_W_AudioTab, CallFunc_SetCaptureVolumeMultiplier_CaptureVolumeMultiplier_ImplicitCast_1) == 0x000238, "Member 'W_AudioTab_C_ExecuteUbergraph_W_AudioTab::CallFunc_SetCaptureVolumeMultiplier_CaptureVolumeMultiplier_ImplicitCast_1' has a wrong offset!");

// Function W_AudioTab.W_AudioTab_C.TabInit
// 0x0008 (0x0008 - 0x0000)
struct W_AudioTab_C_TabInit final
{
public:
	class UW_MainMenu_C*                          MainMenu_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_AudioTab_C_TabInit) == 0x000008, "Wrong alignment on W_AudioTab_C_TabInit");
static_assert(sizeof(W_AudioTab_C_TabInit) == 0x000008, "Wrong size on W_AudioTab_C_TabInit");
static_assert(offsetof(W_AudioTab_C_TabInit, MainMenu_0) == 0x000000, "Member 'W_AudioTab_C_TabInit::MainMenu_0' has a wrong offset!");

// Function W_AudioTab.W_AudioTab_C.UpdateCaptureDevices
// 0x0030 (0x0030 - 0x0000)
struct W_AudioTab_C_UpdateCaptureDevices final
{
public:
	TArray<struct FOdinCaptureDeviceInfo>         Devices;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FOdinCaptureDeviceInfo                 CurrentDevice;                                     // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_AudioTab_C_UpdateCaptureDevices) == 0x000008, "Wrong alignment on W_AudioTab_C_UpdateCaptureDevices");
static_assert(sizeof(W_AudioTab_C_UpdateCaptureDevices) == 0x000030, "Wrong size on W_AudioTab_C_UpdateCaptureDevices");
static_assert(offsetof(W_AudioTab_C_UpdateCaptureDevices, Devices) == 0x000000, "Member 'W_AudioTab_C_UpdateCaptureDevices::Devices' has a wrong offset!");
static_assert(offsetof(W_AudioTab_C_UpdateCaptureDevices, CurrentDevice) == 0x000010, "Member 'W_AudioTab_C_UpdateCaptureDevices::CurrentDevice' has a wrong offset!");

// Function W_AudioTab.W_AudioTab_C.VisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct W_AudioTab_C_VisibilityChanged final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_AudioTab_C_VisibilityChanged) == 0x000001, "Wrong alignment on W_AudioTab_C_VisibilityChanged");
static_assert(sizeof(W_AudioTab_C_VisibilityChanged) == 0x000001, "Wrong size on W_AudioTab_C_VisibilityChanged");
static_assert(offsetof(W_AudioTab_C_VisibilityChanged, InVisibility) == 0x000000, "Member 'W_AudioTab_C_VisibilityChanged::InVisibility' has a wrong offset!");

}

