#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CameroidCapture

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_CameroidCapture.W_CameroidCapture_C.CaptureImageFeedback
// 0x0008 (0x0008 - 0x0000)
struct W_CameroidCapture_C_CaptureImageFeedback final
{
public:
	class ABP_Cameroid_C*                         Cameroid_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CameroidCapture_C_CaptureImageFeedback) == 0x000008, "Wrong alignment on W_CameroidCapture_C_CaptureImageFeedback");
static_assert(sizeof(W_CameroidCapture_C_CaptureImageFeedback) == 0x000008, "Wrong size on W_CameroidCapture_C_CaptureImageFeedback");
static_assert(offsetof(W_CameroidCapture_C_CaptureImageFeedback, Cameroid_0) == 0x000000, "Member 'W_CameroidCapture_C_CaptureImageFeedback::Cameroid_0' has a wrong offset!");

// Function W_CameroidCapture.W_CameroidCapture_C.ExecuteUbergraph_W_CameroidCapture
// 0x00D0 (0x00D0 - 0x0000)
struct W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUPGameViewportClient*                  CallFunc_GetViewportClient_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameViewportClient_C*             K2Node_DynamicCast_AsBP_UPGame_Viewport_Client;    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetCaptureViewportSize_OriginX;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetCaptureViewportSize_OriginY;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetCaptureViewportSize_SizeX;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetCaptureViewportSize_SizeY;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Cameroid_C*                         K2Node_CustomEvent_Cameroid_2;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUPGameViewportClient*                  CallFunc_GetViewportClient_ReturnValue_1;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Cameroid_C*                         K2Node_CustomEvent_Cameroid_1;                     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameViewportClient_C*             K2Node_DynamicCast_AsBP_UPGame_Viewport_Client_1;  // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Visible;                        // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerCharacter_C*                K2Node_DynamicCast_AsBP_UPPlayer_Character;        // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ABP_Cameroid_C* Cameroid)> K2Node_CreateDelegate_OutputDelegate;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ABP_Cameroid_C* Cameroid)> K2Node_CreateDelegate_OutputDelegate_1;          // 0x0094(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Cameroid_C*                         K2Node_CustomEvent_Cameroid;                       // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate_2;           // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetViewportSize_OriginX_ImplicitCast;     // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetViewportSize_OriginY_ImplicitCast;     // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetViewportSize_SizeX_ImplicitCast;       // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetViewportSize_SizeY_ImplicitCast;       // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture) == 0x000008, "Wrong alignment on W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture");
static_assert(sizeof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture) == 0x0000D0, "Wrong size on W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, EntryPoint) == 0x000000, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, K2Node_CustomEvent_InVisibility) == 0x000004, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, CallFunc_IsVisible_ReturnValue) == 0x000005, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, CallFunc_GetViewportClient_ReturnValue) == 0x000008, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::CallFunc_GetViewportClient_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, K2Node_DynamicCast_AsBP_UPGame_Viewport_Client) == 0x000010, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::K2Node_DynamicCast_AsBP_UPGame_Viewport_Client' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, CallFunc_GetCaptureViewportSize_OriginX) == 0x000020, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::CallFunc_GetCaptureViewportSize_OriginX' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, CallFunc_GetCaptureViewportSize_OriginY) == 0x000028, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::CallFunc_GetCaptureViewportSize_OriginY' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, CallFunc_GetCaptureViewportSize_SizeX) == 0x000030, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::CallFunc_GetCaptureViewportSize_SizeX' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, CallFunc_GetCaptureViewportSize_SizeY) == 0x000038, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::CallFunc_GetCaptureViewportSize_SizeY' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, K2Node_CustomEvent_Cameroid_2) == 0x000048, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::K2Node_CustomEvent_Cameroid_2' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, CallFunc_GetViewportClient_ReturnValue_1) == 0x000050, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::CallFunc_GetViewportClient_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, K2Node_CustomEvent_Cameroid_1) == 0x000058, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::K2Node_CustomEvent_Cameroid_1' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, K2Node_DynamicCast_AsBP_UPGame_Viewport_Client_1) == 0x000060, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::K2Node_DynamicCast_AsBP_UPGame_Viewport_Client_1' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, K2Node_CustomEvent_Visible) == 0x000069, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::K2Node_CustomEvent_Visible' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, CallFunc_GetPlayerPawn_ReturnValue) == 0x000070, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, K2Node_DynamicCast_AsBP_UPPlayer_Character) == 0x000078, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::K2Node_DynamicCast_AsBP_UPPlayer_Character' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, K2Node_DynamicCast_bSuccess_2) == 0x000080, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, K2Node_CreateDelegate_OutputDelegate) == 0x000084, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, K2Node_CreateDelegate_OutputDelegate_1) == 0x000094, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, K2Node_CustomEvent_Cameroid) == 0x0000A8, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::K2Node_CustomEvent_Cameroid' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000B0, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, CallFunc_SetViewportSize_OriginX_ImplicitCast) == 0x0000C0, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::CallFunc_SetViewportSize_OriginX_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, CallFunc_SetViewportSize_OriginY_ImplicitCast) == 0x0000C4, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::CallFunc_SetViewportSize_OriginY_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, CallFunc_SetViewportSize_SizeX_ImplicitCast) == 0x0000C8, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::CallFunc_SetViewportSize_SizeX_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture, CallFunc_SetViewportSize_SizeY_ImplicitCast) == 0x0000CC, "Member 'W_CameroidCapture_C_ExecuteUbergraph_W_CameroidCapture::CallFunc_SetViewportSize_SizeY_ImplicitCast' has a wrong offset!");

// Function W_CameroidCapture.W_CameroidCapture_C.GetCaptureViewportSize
// 0x0078 (0x0078 - 0x0000)
struct W_CameroidCapture_C_GetCaptureViewportSize final
{
public:
	class UBP_UPGameViewportClient_C*             ViewportClient;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        OriginX;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OriginY;                                           // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SizeX;                                             // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SizeY;                                             // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _SizeY;                                            // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _SizeX;                                            // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _OriginY;                                          // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _OriginX;                                          // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetCaptureRatio_Ratio;                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CameroidCapture_C_GetCaptureViewportSize) == 0x000008, "Wrong alignment on W_CameroidCapture_C_GetCaptureViewportSize");
static_assert(sizeof(W_CameroidCapture_C_GetCaptureViewportSize) == 0x000078, "Wrong size on W_CameroidCapture_C_GetCaptureViewportSize");
static_assert(offsetof(W_CameroidCapture_C_GetCaptureViewportSize, ViewportClient) == 0x000000, "Member 'W_CameroidCapture_C_GetCaptureViewportSize::ViewportClient' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_GetCaptureViewportSize, OriginX) == 0x000008, "Member 'W_CameroidCapture_C_GetCaptureViewportSize::OriginX' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_GetCaptureViewportSize, OriginY) == 0x000010, "Member 'W_CameroidCapture_C_GetCaptureViewportSize::OriginY' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_GetCaptureViewportSize, SizeX) == 0x000018, "Member 'W_CameroidCapture_C_GetCaptureViewportSize::SizeX' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_GetCaptureViewportSize, SizeY) == 0x000020, "Member 'W_CameroidCapture_C_GetCaptureViewportSize::SizeY' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_GetCaptureViewportSize, _SizeY) == 0x000028, "Member 'W_CameroidCapture_C_GetCaptureViewportSize::_SizeY' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_GetCaptureViewportSize, _SizeX) == 0x000030, "Member 'W_CameroidCapture_C_GetCaptureViewportSize::_SizeX' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_GetCaptureViewportSize, _OriginY) == 0x000038, "Member 'W_CameroidCapture_C_GetCaptureViewportSize::_OriginY' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_GetCaptureViewportSize, _OriginX) == 0x000040, "Member 'W_CameroidCapture_C_GetCaptureViewportSize::_OriginX' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_GetCaptureViewportSize, CallFunc_GetCaptureRatio_Ratio) == 0x000048, "Member 'W_CameroidCapture_C_GetCaptureViewportSize::CallFunc_GetCaptureRatio_Ratio' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_GetCaptureViewportSize, CallFunc_MakeLiteralDouble_ReturnValue) == 0x000050, "Member 'W_CameroidCapture_C_GetCaptureViewportSize::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_GetCaptureViewportSize, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000058, "Member 'W_CameroidCapture_C_GetCaptureViewportSize::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_GetCaptureViewportSize, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000060, "Member 'W_CameroidCapture_C_GetCaptureViewportSize::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_GetCaptureViewportSize, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000068, "Member 'W_CameroidCapture_C_GetCaptureViewportSize::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CameroidCapture_C_GetCaptureViewportSize, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000070, "Member 'W_CameroidCapture_C_GetCaptureViewportSize::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");

// Function W_CameroidCapture.W_CameroidCapture_C.Init
// 0x0008 (0x0008 - 0x0000)
struct W_CameroidCapture_C_Init final
{
public:
	class ABP_Cameroid_C*                         Cameroid_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CameroidCapture_C_Init) == 0x000008, "Wrong alignment on W_CameroidCapture_C_Init");
static_assert(sizeof(W_CameroidCapture_C_Init) == 0x000008, "Wrong size on W_CameroidCapture_C_Init");
static_assert(offsetof(W_CameroidCapture_C_Init, Cameroid_0) == 0x000000, "Member 'W_CameroidCapture_C_Init::Cameroid_0' has a wrong offset!");

// Function W_CameroidCapture.W_CameroidCapture_C.SelfieModeChanged
// 0x0008 (0x0008 - 0x0000)
struct W_CameroidCapture_C_SelfieModeChanged final
{
public:
	class ABP_Cameroid_C*                         Cameroid_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CameroidCapture_C_SelfieModeChanged) == 0x000008, "Wrong alignment on W_CameroidCapture_C_SelfieModeChanged");
static_assert(sizeof(W_CameroidCapture_C_SelfieModeChanged) == 0x000008, "Wrong size on W_CameroidCapture_C_SelfieModeChanged");
static_assert(offsetof(W_CameroidCapture_C_SelfieModeChanged, Cameroid_0) == 0x000000, "Member 'W_CameroidCapture_C_SelfieModeChanged::Cameroid_0' has a wrong offset!");

// Function W_CameroidCapture.W_CameroidCapture_C.SetHudVisibility
// 0x0001 (0x0001 - 0x0000)
struct W_CameroidCapture_C_SetHudVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CameroidCapture_C_SetHudVisibility) == 0x000001, "Wrong alignment on W_CameroidCapture_C_SetHudVisibility");
static_assert(sizeof(W_CameroidCapture_C_SetHudVisibility) == 0x000001, "Wrong size on W_CameroidCapture_C_SetHudVisibility");
static_assert(offsetof(W_CameroidCapture_C_SetHudVisibility, Visible) == 0x000000, "Member 'W_CameroidCapture_C_SetHudVisibility::Visible' has a wrong offset!");

// Function W_CameroidCapture.W_CameroidCapture_C.VisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct W_CameroidCapture_C_VisibilityChanged final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CameroidCapture_C_VisibilityChanged) == 0x000001, "Wrong alignment on W_CameroidCapture_C_VisibilityChanged");
static_assert(sizeof(W_CameroidCapture_C_VisibilityChanged) == 0x000001, "Wrong size on W_CameroidCapture_C_VisibilityChanged");
static_assert(offsetof(W_CameroidCapture_C_VisibilityChanged, InVisibility) == 0x000000, "Member 'W_CameroidCapture_C_VisibilityChanged::InVisibility' has a wrong offset!");

}

