#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CameroidOverlay

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_CameroidOverlay.W_CameroidOverlay_C.ExecuteUbergraph_W_CameroidOverlay
// 0x0110 (0x0110 - 0x0000)
struct W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerController_C*               K2Node_DynamicCast_AsBP_UPPlayer_Controller;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_AddHudWidget_Widget;                      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_InventoryItem_C*                    K2Node_Event_Item_1;                               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_CameroidGallery_C*                   K2Node_DynamicCast_AsW_Cameroid_Gallery;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Cameroid_C*                         K2Node_DynamicCast_AsBP_Cameroid;                  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x004C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable;                              // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_InventoryItem_C*                    K2Node_Event_Item;                                 // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsEquipped;                           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x00C0(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x00E8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_CameroidCaptureTaken_C*              CallFunc_GetCaptureTakenWidget_Widget;             // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay) == 0x000008, "Wrong alignment on W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay");
static_assert(sizeof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay) == 0x000110, "Wrong size on W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, EntryPoint) == 0x000000, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, K2Node_DynamicCast_AsBP_UPPlayer_Controller) == 0x000010, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::K2Node_DynamicCast_AsBP_UPPlayer_Controller' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, CallFunc_AddHudWidget_Widget) == 0x000020, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::CallFunc_AddHudWidget_Widget' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, K2Node_Event_Item_1) == 0x000028, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::K2Node_Event_Item_1' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, K2Node_DynamicCast_AsW_Cameroid_Gallery) == 0x000030, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::K2Node_DynamicCast_AsW_Cameroid_Gallery' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, K2Node_DynamicCast_AsBP_Cameroid) == 0x000040, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::K2Node_DynamicCast_AsBP_Cameroid' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, K2Node_DynamicCast_bSuccess_2) == 0x000048, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, K2Node_Event_MyGeometry) == 0x00004C, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, K2Node_Event_InDeltaTime) == 0x000084, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, Temp_bool_Variable) == 0x000088, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, CallFunc_IsValid_ReturnValue) == 0x000089, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, CallFunc_Not_PreBool_ReturnValue) == 0x00008A, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, CallFunc_IsVisible_ReturnValue) == 0x00008B, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, Temp_real_Variable) == 0x000090, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, Temp_real_Variable_1) == 0x000098, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, CallFunc_IsVisible_ReturnValue_1) == 0x0000A0, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, Temp_object_Variable) == 0x0000A8, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, K2Node_Event_Item) == 0x0000B0, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::K2Node_Event_Item' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, K2Node_Event_IsEquipped) == 0x0000B8, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::K2Node_Event_IsEquipped' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, CallFunc_BooleanAND_ReturnValue) == 0x0000B9, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, CallFunc_BooleanAND_ReturnValue_1) == 0x0000BA, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, CallFunc_BooleanAND_ReturnValue_2) == 0x0000BB, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, K2Node_EnhancedInputActionEvent_ActionValue) == 0x0000C0, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x0000E0, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x0000E4, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, K2Node_EnhancedInputActionEvent_SourceAction) == 0x0000E8, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, Temp_real_Variable_1_0) == 0x0000F0, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, Temp_real_Variable_0) == 0x0000F8, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000100, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, CallFunc_IsValid_ReturnValue_1) == 0x000101, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay, CallFunc_GetCaptureTakenWidget_Widget) == 0x000108, "Member 'W_CameroidOverlay_C_ExecuteUbergraph_W_CameroidOverlay::CallFunc_GetCaptureTakenWidget_Widget' has a wrong offset!");

// Function W_CameroidOverlay.W_CameroidOverlay_C.GetCaptureTakenWidget
// 0x0050 (0x0050 - 0x0000)
struct W_CameroidOverlay_C_GetCaptureTakenWidget final
{
public:
	class ABP_Cameroid_C*                         Cameroid_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_CameroidCaptureTaken_C*              Widget;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerController_C*               CallFunc_GetPlayerController_PlayerController;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_HudParent_C*                         CallFunc_GetHudParent_HudParent;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_FindHudWidget_Widget;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_AddHudWidget_Widget;                      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_CameroidCaptureTaken_C*              K2Node_DynamicCast_AsW_Cameroid_Capture_Taken;     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_CameroidCaptureTaken_C*              K2Node_DynamicCast_AsW_Cameroid_Capture_Taken_1;   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CameroidOverlay_C_GetCaptureTakenWidget) == 0x000008, "Wrong alignment on W_CameroidOverlay_C_GetCaptureTakenWidget");
static_assert(sizeof(W_CameroidOverlay_C_GetCaptureTakenWidget) == 0x000050, "Wrong size on W_CameroidOverlay_C_GetCaptureTakenWidget");
static_assert(offsetof(W_CameroidOverlay_C_GetCaptureTakenWidget, Cameroid_0) == 0x000000, "Member 'W_CameroidOverlay_C_GetCaptureTakenWidget::Cameroid_0' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_GetCaptureTakenWidget, Widget) == 0x000008, "Member 'W_CameroidOverlay_C_GetCaptureTakenWidget::Widget' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_GetCaptureTakenWidget, CallFunc_GetPlayerController_PlayerController) == 0x000010, "Member 'W_CameroidOverlay_C_GetCaptureTakenWidget::CallFunc_GetPlayerController_PlayerController' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_GetCaptureTakenWidget, CallFunc_GetHudParent_HudParent) == 0x000018, "Member 'W_CameroidOverlay_C_GetCaptureTakenWidget::CallFunc_GetHudParent_HudParent' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_GetCaptureTakenWidget, CallFunc_FindHudWidget_Widget) == 0x000020, "Member 'W_CameroidOverlay_C_GetCaptureTakenWidget::CallFunc_FindHudWidget_Widget' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_GetCaptureTakenWidget, CallFunc_AddHudWidget_Widget) == 0x000028, "Member 'W_CameroidOverlay_C_GetCaptureTakenWidget::CallFunc_AddHudWidget_Widget' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_GetCaptureTakenWidget, K2Node_DynamicCast_AsW_Cameroid_Capture_Taken) == 0x000030, "Member 'W_CameroidOverlay_C_GetCaptureTakenWidget::K2Node_DynamicCast_AsW_Cameroid_Capture_Taken' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_GetCaptureTakenWidget, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'W_CameroidOverlay_C_GetCaptureTakenWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_GetCaptureTakenWidget, K2Node_DynamicCast_AsW_Cameroid_Capture_Taken_1) == 0x000040, "Member 'W_CameroidOverlay_C_GetCaptureTakenWidget::K2Node_DynamicCast_AsW_Cameroid_Capture_Taken_1' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_GetCaptureTakenWidget, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'W_CameroidOverlay_C_GetCaptureTakenWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_GetCaptureTakenWidget, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'W_CameroidOverlay_C_GetCaptureTakenWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function W_CameroidOverlay.W_CameroidOverlay_C.Init
// 0x0008 (0x0008 - 0x0000)
struct W_CameroidOverlay_C_Init final
{
public:
	class ABP_InventoryItem_C*                    Item_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CameroidOverlay_C_Init) == 0x000008, "Wrong alignment on W_CameroidOverlay_C_Init");
static_assert(sizeof(W_CameroidOverlay_C_Init) == 0x000008, "Wrong size on W_CameroidOverlay_C_Init");
static_assert(offsetof(W_CameroidOverlay_C_Init, Item_0) == 0x000000, "Member 'W_CameroidOverlay_C_Init::Item_0' has a wrong offset!");

// Function W_CameroidOverlay.W_CameroidOverlay_C.InpActEvt_IA_OpenGallery_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct W_CameroidOverlay_C_InpActEvt_IA_OpenGallery_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CameroidOverlay_C_InpActEvt_IA_OpenGallery_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on W_CameroidOverlay_C_InpActEvt_IA_OpenGallery_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(W_CameroidOverlay_C_InpActEvt_IA_OpenGallery_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on W_CameroidOverlay_C_InpActEvt_IA_OpenGallery_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(W_CameroidOverlay_C_InpActEvt_IA_OpenGallery_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'W_CameroidOverlay_C_InpActEvt_IA_OpenGallery_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_InpActEvt_IA_OpenGallery_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'W_CameroidOverlay_C_InpActEvt_IA_OpenGallery_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_InpActEvt_IA_OpenGallery_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'W_CameroidOverlay_C_InpActEvt_IA_OpenGallery_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_InpActEvt_IA_OpenGallery_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'W_CameroidOverlay_C_InpActEvt_IA_OpenGallery_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function W_CameroidOverlay.W_CameroidOverlay_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_CameroidOverlay_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CameroidOverlay_C_Tick) == 0x000004, "Wrong alignment on W_CameroidOverlay_C_Tick");
static_assert(sizeof(W_CameroidOverlay_C_Tick) == 0x00003C, "Wrong size on W_CameroidOverlay_C_Tick");
static_assert(offsetof(W_CameroidOverlay_C_Tick, MyGeometry) == 0x000000, "Member 'W_CameroidOverlay_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_Tick, InDeltaTime) == 0x000038, "Member 'W_CameroidOverlay_C_Tick::InDeltaTime' has a wrong offset!");

// Function W_CameroidOverlay.W_CameroidOverlay_C.UpdateVisibility
// 0x0010 (0x0010 - 0x0000)
struct W_CameroidOverlay_C_UpdateVisibility final
{
public:
	class ABP_InventoryItem_C*                    Item_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEquipped;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CameroidOverlay_C_UpdateVisibility) == 0x000008, "Wrong alignment on W_CameroidOverlay_C_UpdateVisibility");
static_assert(sizeof(W_CameroidOverlay_C_UpdateVisibility) == 0x000010, "Wrong size on W_CameroidOverlay_C_UpdateVisibility");
static_assert(offsetof(W_CameroidOverlay_C_UpdateVisibility, Item_0) == 0x000000, "Member 'W_CameroidOverlay_C_UpdateVisibility::Item_0' has a wrong offset!");
static_assert(offsetof(W_CameroidOverlay_C_UpdateVisibility, IsEquipped) == 0x000008, "Member 'W_CameroidOverlay_C_UpdateVisibility::IsEquipped' has a wrong offset!");

}

