#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CameroidCaptureTakenActorScore

#include "Basic.hpp"

#include "S_CameroidActorScore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_CameroidCaptureTakenActorScore.W_CameroidCaptureTakenActorScore_C.ExecuteUbergraph_W_CameroidCaptureTakenActorScore
// 0x0198 (0x0198 - 0x0000)
struct W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCapturedActorDisplayName_DisplayName;  // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FS_CameroidActorScore                  K2Node_CustomEvent_ActorScore;                     // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0050)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0100(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0140(0x0018)()
	struct FVector2D                              CallFunc_GetLocalTopLeft_ReturnValue;              // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_PlaybackSpeed;                  // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore) == 0x000008, "Wrong alignment on W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore");
static_assert(sizeof(W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore) == 0x000198, "Wrong size on W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore");
static_assert(offsetof(W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore, EntryPoint) == 0x000000, "Member 'W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore, CallFunc_GetCapturedActorDisplayName_DisplayName) == 0x000008, "Member 'W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore::CallFunc_GetCapturedActorDisplayName_DisplayName' has a wrong offset!");
static_assert(offsetof(W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore, K2Node_CustomEvent_ActorScore) == 0x000018, "Member 'W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore::K2Node_CustomEvent_ActorScore' has a wrong offset!");
static_assert(offsetof(W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000098, "Member 'W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A0, "Member 'W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore, K2Node_MakeArray_Array) == 0x0000F0, "Member 'W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore, K2Node_Event_MyGeometry) == 0x000100, "Member 'W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore, K2Node_Event_InDeltaTime) == 0x000138, "Member 'W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore, CallFunc_Format_ReturnValue) == 0x000140, "Member 'W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore, CallFunc_GetLocalTopLeft_ReturnValue) == 0x000158, "Member 'W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore::CallFunc_GetLocalTopLeft_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore, CallFunc_BreakVector2D_X) == 0x000168, "Member 'W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore, CallFunc_BreakVector2D_Y) == 0x000170, "Member 'W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore, K2Node_CustomEvent_PlaybackSpeed) == 0x000178, "Member 'W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore::K2Node_CustomEvent_PlaybackSpeed' has a wrong offset!");
static_assert(offsetof(W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore, CallFunc_MapRangeClamped_ReturnValue) == 0x000180, "Member 'W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore, CallFunc_PlayAnimation_ReturnValue) == 0x000188, "Member 'W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000190, "Member 'W_CameroidCaptureTakenActorScore_C_ExecuteUbergraph_W_CameroidCaptureTakenActorScore::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function W_CameroidCaptureTakenActorScore.W_CameroidCaptureTakenActorScore_C.PlayAppearAnim
// 0x0004 (0x0004 - 0x0000)
struct W_CameroidCaptureTakenActorScore_C_PlayAppearAnim final
{
public:
	float                                         PlaybackSpeed;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CameroidCaptureTakenActorScore_C_PlayAppearAnim) == 0x000004, "Wrong alignment on W_CameroidCaptureTakenActorScore_C_PlayAppearAnim");
static_assert(sizeof(W_CameroidCaptureTakenActorScore_C_PlayAppearAnim) == 0x000004, "Wrong size on W_CameroidCaptureTakenActorScore_C_PlayAppearAnim");
static_assert(offsetof(W_CameroidCaptureTakenActorScore_C_PlayAppearAnim, PlaybackSpeed) == 0x000000, "Member 'W_CameroidCaptureTakenActorScore_C_PlayAppearAnim::PlaybackSpeed' has a wrong offset!");

// Function W_CameroidCaptureTakenActorScore.W_CameroidCaptureTakenActorScore_C.SetActorScore
// 0x0018 (0x0018 - 0x0000)
struct W_CameroidCaptureTakenActorScore_C_SetActorScore final
{
public:
	struct FS_CameroidActorScore                  ActorScore_0;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CameroidCaptureTakenActorScore_C_SetActorScore) == 0x000008, "Wrong alignment on W_CameroidCaptureTakenActorScore_C_SetActorScore");
static_assert(sizeof(W_CameroidCaptureTakenActorScore_C_SetActorScore) == 0x000018, "Wrong size on W_CameroidCaptureTakenActorScore_C_SetActorScore");
static_assert(offsetof(W_CameroidCaptureTakenActorScore_C_SetActorScore, ActorScore_0) == 0x000000, "Member 'W_CameroidCaptureTakenActorScore_C_SetActorScore::ActorScore_0' has a wrong offset!");

// Function W_CameroidCaptureTakenActorScore.W_CameroidCaptureTakenActorScore_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_CameroidCaptureTakenActorScore_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CameroidCaptureTakenActorScore_C_Tick) == 0x000004, "Wrong alignment on W_CameroidCaptureTakenActorScore_C_Tick");
static_assert(sizeof(W_CameroidCaptureTakenActorScore_C_Tick) == 0x00003C, "Wrong size on W_CameroidCaptureTakenActorScore_C_Tick");
static_assert(offsetof(W_CameroidCaptureTakenActorScore_C_Tick, MyGeometry) == 0x000000, "Member 'W_CameroidCaptureTakenActorScore_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_CameroidCaptureTakenActorScore_C_Tick, InDeltaTime) == 0x000038, "Member 'W_CameroidCaptureTakenActorScore_C_Tick::InDeltaTime' has a wrong offset!");

}

