#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CameroidCaptureTaken

#include "Basic.hpp"

#include "E_ScoringCategory_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "S_CameroidCapture_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CameroidCaptureTaken.W_CameroidCaptureTaken_C
// 0x01B8 (0x0478 - 0x02C0)
class UW_CameroidCaptureTaken_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OutroAnim;                                         // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CategoryAnim;                                      // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CameraBonusAnim;                                   // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ActorScoreAnim;                                    // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IntroAnim;                                         // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BotBorder;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CameraBonusIcon;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               CameraBonusSizeBox;                                // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CameraBonusText;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CategoryIcon;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               CategorySizeBox;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CategoryText;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           DetailsVBox;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftBorder;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Panel;                                             // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PreviewImg;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PreviewScore;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RightBorder;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopBorder;                                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_Cameroid_C*                         Cameroid;                                          // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   GameInstance;                                      // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FS_CameroidCapture                     Capture;                                           // 0x0370(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UW_CameroidCaptureTakenActorScore_C*> ActorScoreWidgets;                            // 0x03B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         ActorScoreIndex;                                   // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ActorScorePlaybackSpeed;                           // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CurrentAnim;                                       // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class USoundCue*, int32>                 TotalSounds;                                       // 0x03D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<E_ScoringCategory, class USoundCue*>     CategorySounds;                                    // 0x0428(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ActorScoreAnim_UpdateScore();
	void CameraBonusAnim_UpdateScore();
	void CancelCurrentAnim();
	void CaptureTaken(const struct FS_CameroidCapture& Capture_0);
	void CategoryAnim_Start();
	void CategoryAnim_UpdateScore();
	void ClearActorScoreWidgets();
	void CreateActorScoreWidgets();
	void ExecuteUbergraph_W_CameroidCaptureTaken(int32 EntryPoint);
	void GetCategoryInfo(class FText* Text, class UTexture2D** Icon);
	void GetTempScore(int32 Index_0, int32* TempScore);
	void GetTotalSound(int32 Score, class USoundCue** TotalSound);
	void Init(class ABP_Cameroid_C* Cameroid_0);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void PlayActorScoreAnim();
	void PlayAnim(class UWidgetAnimation* Anim, float PlaybackSpeed);
	void PlayCameraBonusAnim();
	void PlayCategoryAnim();
	void PlayIntroAnim();
	void PlayOutroAnim();
	void PrepareAnimations(class UTexture2D* Texture);
	void SequenceEvent__ENTRYPOINTW_CameroidCaptureTaken();
	void SequenceEvent__ENTRYPOINTW_CameroidCaptureTaken_0();
	void SequenceEvent__ENTRYPOINTW_CameroidCaptureTaken_1();
	void SequenceEvent__ENTRYPOINTW_CameroidCaptureTaken_2();
	void TryGetTexture(const struct FS_CameroidCapture& Capture_0, bool* IsValid, class UTexture2D** Texture);
	void UpdateScore(int32 Score);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_CameroidCaptureTaken_C">();
	}
	static class UW_CameroidCaptureTaken_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_CameroidCaptureTaken_C>();
	}
};
static_assert(alignof(UW_CameroidCaptureTaken_C) == 0x000008, "Wrong alignment on UW_CameroidCaptureTaken_C");
static_assert(sizeof(UW_CameroidCaptureTaken_C) == 0x000478, "Wrong size on UW_CameroidCaptureTaken_C");
static_assert(offsetof(UW_CameroidCaptureTaken_C, UberGraphFrame) == 0x0002C0, "Member 'UW_CameroidCaptureTaken_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, OutroAnim) == 0x0002C8, "Member 'UW_CameroidCaptureTaken_C::OutroAnim' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, CategoryAnim) == 0x0002D0, "Member 'UW_CameroidCaptureTaken_C::CategoryAnim' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, CameraBonusAnim) == 0x0002D8, "Member 'UW_CameroidCaptureTaken_C::CameraBonusAnim' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, ActorScoreAnim) == 0x0002E0, "Member 'UW_CameroidCaptureTaken_C::ActorScoreAnim' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, IntroAnim) == 0x0002E8, "Member 'UW_CameroidCaptureTaken_C::IntroAnim' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, BotBorder) == 0x0002F0, "Member 'UW_CameroidCaptureTaken_C::BotBorder' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, CameraBonusIcon) == 0x0002F8, "Member 'UW_CameroidCaptureTaken_C::CameraBonusIcon' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, CameraBonusSizeBox) == 0x000300, "Member 'UW_CameroidCaptureTaken_C::CameraBonusSizeBox' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, CameraBonusText) == 0x000308, "Member 'UW_CameroidCaptureTaken_C::CameraBonusText' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, CategoryIcon) == 0x000310, "Member 'UW_CameroidCaptureTaken_C::CategoryIcon' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, CategorySizeBox) == 0x000318, "Member 'UW_CameroidCaptureTaken_C::CategorySizeBox' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, CategoryText) == 0x000320, "Member 'UW_CameroidCaptureTaken_C::CategoryText' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, DetailsVBox) == 0x000328, "Member 'UW_CameroidCaptureTaken_C::DetailsVBox' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, LeftBorder) == 0x000330, "Member 'UW_CameroidCaptureTaken_C::LeftBorder' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, Panel) == 0x000338, "Member 'UW_CameroidCaptureTaken_C::Panel' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, PreviewImg) == 0x000340, "Member 'UW_CameroidCaptureTaken_C::PreviewImg' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, PreviewScore) == 0x000348, "Member 'UW_CameroidCaptureTaken_C::PreviewScore' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, RightBorder) == 0x000350, "Member 'UW_CameroidCaptureTaken_C::RightBorder' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, TopBorder) == 0x000358, "Member 'UW_CameroidCaptureTaken_C::TopBorder' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, Cameroid) == 0x000360, "Member 'UW_CameroidCaptureTaken_C::Cameroid' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, GameInstance) == 0x000368, "Member 'UW_CameroidCaptureTaken_C::GameInstance' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, Capture) == 0x000370, "Member 'UW_CameroidCaptureTaken_C::Capture' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, ActorScoreWidgets) == 0x0003B0, "Member 'UW_CameroidCaptureTaken_C::ActorScoreWidgets' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, ActorScoreIndex) == 0x0003C0, "Member 'UW_CameroidCaptureTaken_C::ActorScoreIndex' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, ActorScorePlaybackSpeed) == 0x0003C8, "Member 'UW_CameroidCaptureTaken_C::ActorScorePlaybackSpeed' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, CurrentAnim) == 0x0003D0, "Member 'UW_CameroidCaptureTaken_C::CurrentAnim' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, TotalSounds) == 0x0003D8, "Member 'UW_CameroidCaptureTaken_C::TotalSounds' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTaken_C, CategorySounds) == 0x000428, "Member 'UW_CameroidCaptureTaken_C::CategorySounds' has a wrong offset!");

}

