#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CameroidGalleryElement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "S_CameroidCapture_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CameroidGalleryElement.W_CameroidGalleryElement_C
// 0x0070 (0x0330 - 0x02C0)
class UW_CameroidGalleryElement_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UW_CameroidGalleryElement_C* GalleryElement)> OnClicked;     // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UTexture2D*                             Texture;                                           // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FS_CameroidCapture                     Capture;                                           // 0x02F0(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BndEvt__W_CameroidGalleryElement_Button_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void ExecuteUbergraph_W_CameroidGalleryElement(int32 EntryPoint);
	void SetCapture(const struct FS_CameroidCapture& Capture_0, class UTexture2D* Texture_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_CameroidGalleryElement_C">();
	}
	static class UW_CameroidGalleryElement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_CameroidGalleryElement_C>();
	}
};
static_assert(alignof(UW_CameroidGalleryElement_C) == 0x000008, "Wrong alignment on UW_CameroidGalleryElement_C");
static_assert(sizeof(UW_CameroidGalleryElement_C) == 0x000330, "Wrong size on UW_CameroidGalleryElement_C");
static_assert(offsetof(UW_CameroidGalleryElement_C, UberGraphFrame) == 0x0002C0, "Member 'UW_CameroidGalleryElement_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_CameroidGalleryElement_C, Button) == 0x0002C8, "Member 'UW_CameroidGalleryElement_C::Button' has a wrong offset!");
static_assert(offsetof(UW_CameroidGalleryElement_C, Image) == 0x0002D0, "Member 'UW_CameroidGalleryElement_C::Image' has a wrong offset!");
static_assert(offsetof(UW_CameroidGalleryElement_C, OnClicked) == 0x0002D8, "Member 'UW_CameroidGalleryElement_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UW_CameroidGalleryElement_C, Texture) == 0x0002E8, "Member 'UW_CameroidGalleryElement_C::Texture' has a wrong offset!");
static_assert(offsetof(UW_CameroidGalleryElement_C, Capture) == 0x0002F0, "Member 'UW_CameroidGalleryElement_C::Capture' has a wrong offset!");

}

