#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CameroidCaptureTakenActorScore

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_CameroidActorScore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CameroidCaptureTakenActorScore.W_CameroidCaptureTakenActorScore_C
// 0x0030 (0x02F0 - 0x02C0)
class UW_CameroidCaptureTakenActorScore_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AppearanceAnim;                                    // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FS_CameroidActorScore                  ActorScore;                                        // 0x02D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_CameroidCaptureTakenActorScore(int32 EntryPoint);
	void PlayAppearAnim(float PlaybackSpeed);
	void SetActorScore(const struct FS_CameroidActorScore& ActorScore_0);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_CameroidCaptureTakenActorScore_C">();
	}
	static class UW_CameroidCaptureTakenActorScore_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_CameroidCaptureTakenActorScore_C>();
	}
};
static_assert(alignof(UW_CameroidCaptureTakenActorScore_C) == 0x000008, "Wrong alignment on UW_CameroidCaptureTakenActorScore_C");
static_assert(sizeof(UW_CameroidCaptureTakenActorScore_C) == 0x0002F0, "Wrong size on UW_CameroidCaptureTakenActorScore_C");
static_assert(offsetof(UW_CameroidCaptureTakenActorScore_C, UberGraphFrame) == 0x0002C0, "Member 'UW_CameroidCaptureTakenActorScore_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTakenActorScore_C, AppearanceAnim) == 0x0002C8, "Member 'UW_CameroidCaptureTakenActorScore_C::AppearanceAnim' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTakenActorScore_C, Text) == 0x0002D0, "Member 'UW_CameroidCaptureTakenActorScore_C::Text' has a wrong offset!");
static_assert(offsetof(UW_CameroidCaptureTakenActorScore_C, ActorScore) == 0x0002D8, "Member 'UW_CameroidCaptureTakenActorScore_C::ActorScore' has a wrong offset!");

}

