#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ControlsTab

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "Slate_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function W_ControlsTab.W_ControlsTab_C.BndEvt__W_ControlsTab_InvertMouseXCheckBox_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_ControlsTab_C_BndEvt__W_ControlsTab_InvertMouseXCheckBox_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ControlsTab_C_BndEvt__W_ControlsTab_InvertMouseXCheckBox_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on W_ControlsTab_C_BndEvt__W_ControlsTab_InvertMouseXCheckBox_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(W_ControlsTab_C_BndEvt__W_ControlsTab_InvertMouseXCheckBox_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on W_ControlsTab_C_BndEvt__W_ControlsTab_InvertMouseXCheckBox_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(W_ControlsTab_C_BndEvt__W_ControlsTab_InvertMouseXCheckBox_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'W_ControlsTab_C_BndEvt__W_ControlsTab_InvertMouseXCheckBox_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function W_ControlsTab.W_ControlsTab_C.BndEvt__W_ControlsTab_InvertMouseYCheckBox_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_ControlsTab_C_BndEvt__W_ControlsTab_InvertMouseYCheckBox_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ControlsTab_C_BndEvt__W_ControlsTab_InvertMouseYCheckBox_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on W_ControlsTab_C_BndEvt__W_ControlsTab_InvertMouseYCheckBox_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(W_ControlsTab_C_BndEvt__W_ControlsTab_InvertMouseYCheckBox_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on W_ControlsTab_C_BndEvt__W_ControlsTab_InvertMouseYCheckBox_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(W_ControlsTab_C_BndEvt__W_ControlsTab_InvertMouseYCheckBox_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'W_ControlsTab_C_BndEvt__W_ControlsTab_InvertMouseYCheckBox_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function W_ControlsTab.W_ControlsTab_C.BndEvt__W_ControlsTab_SensitivitySlider_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_ControlsTab_C_BndEvt__W_ControlsTab_SensitivitySlider_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ControlsTab_C_BndEvt__W_ControlsTab_SensitivitySlider_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on W_ControlsTab_C_BndEvt__W_ControlsTab_SensitivitySlider_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(W_ControlsTab_C_BndEvt__W_ControlsTab_SensitivitySlider_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on W_ControlsTab_C_BndEvt__W_ControlsTab_SensitivitySlider_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(W_ControlsTab_C_BndEvt__W_ControlsTab_SensitivitySlider_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'W_ControlsTab_C_BndEvt__W_ControlsTab_SensitivitySlider_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function W_ControlsTab.W_ControlsTab_C.ExecuteUbergraph_W_ControlsTab
// 0x01D8 (0x01D8 - 0x0000)
struct W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_MainMenu_C*                          K2Node_Event_MainMenu;                             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputMappingContext*                   CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_InputBinding_C*                      CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_InputBinding_C*                      K2Node_CustomEvent_BindingWidget;                  // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FInputChord                            K2Node_CustomEvent_Input;                          // 0x0080(0x0020)(HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetMappingName_ReturnValue;               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMapPlayerKeyArgs                      K2Node_MakeStruct_MapPlayerKeyArgs;                // 0x00C0(0x0040)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MapPlayerKey_FailureReason;               // 0x0108(0x0020)()
	bool                                          K2Node_CustomEvent_IsController;                   // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_InputBinding_C*                      CallFunc_Array_Get_Item_1;                         // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEnhancedActionKeyMapping              CallFunc_Array_Get_Item_2;                         // 0x0148(0x0050)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsBindingRevelant_Result;                 // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_InputBinding_C*                      CallFunc_Array_Get_Item_3;                         // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_1;           // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x01AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AF[0x1];                                      // 0x01AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UW_InputBinding_C* BindingWidget, const struct FInputChord& Input)> K2Node_CreateDelegate_OutputDelegate; // 0x01B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetLookSensitivity_Sensitivity_ImplicitCast; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetPercentageValue_Value_ImplicitCast;    // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast;            // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab) == 0x000008, "Wrong alignment on W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab");
static_assert(sizeof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab) == 0x0001D8, "Wrong size on W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, EntryPoint) == 0x000000, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, Temp_int_Array_Index_Variable) == 0x000004, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, Temp_int_Array_Index_Variable_1) == 0x000008, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, Temp_int_Array_Index_Variable_2) == 0x000014, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, K2Node_Event_MainMenu) == 0x000018, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::K2Node_Event_MainMenu' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, K2Node_ComponentBoundEvent_Value) == 0x000020, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, CallFunc_GetGameInstance_ReturnValue) == 0x000028, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, K2Node_DynamicCast_AsBP_UPGame_Instance) == 0x000030, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::K2Node_DynamicCast_AsBP_UPGame_Instance' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, CallFunc_GetOwningPlayer_ReturnValue) == 0x000040, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, CallFunc_Array_Get_Item) == 0x000048, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, CallFunc_Create_ReturnValue) == 0x000050, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, CallFunc_Array_Length_ReturnValue_1) == 0x00005C, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, Temp_int_Loop_Counter_Variable_1) == 0x000060, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000068, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, CallFunc_Add_IntInt_ReturnValue_1) == 0x000070, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, K2Node_CustomEvent_BindingWidget) == 0x000078, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::K2Node_CustomEvent_BindingWidget' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, K2Node_CustomEvent_Input) == 0x000080, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::K2Node_CustomEvent_Input' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, Temp_int_Loop_Counter_Variable_2) == 0x0000A0, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, CallFunc_Less_IntInt_ReturnValue) == 0x0000A4, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000A8, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, Temp_int_Loop_Counter_Variable_3) == 0x0000AC, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, CallFunc_GetMappingName_ReturnValue) == 0x0000B0, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::CallFunc_GetMappingName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B8, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, K2Node_MakeStruct_MapPlayerKeyArgs) == 0x0000C0, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::K2Node_MakeStruct_MapPlayerKeyArgs' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, CallFunc_Add_IntInt_ReturnValue_3) == 0x000100, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, CallFunc_MapPlayerKey_FailureReason) == 0x000108, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::CallFunc_MapPlayerKey_FailureReason' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, K2Node_CustomEvent_IsController) == 0x000128, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::K2Node_CustomEvent_IsController' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, CallFunc_Array_Add_ReturnValue) == 0x00012C, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, CallFunc_Array_Get_Item_1) == 0x000130, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, CallFunc_Array_Length_ReturnValue_2) == 0x000138, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, Temp_int_Array_Index_Variable_3) == 0x00013C, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, CallFunc_Less_IntInt_ReturnValue_2) == 0x000140, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, CallFunc_Array_Get_Item_2) == 0x000148, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, CallFunc_IsBindingRevelant_Result) == 0x000198, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::CallFunc_IsBindingRevelant_Result' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, CallFunc_Array_Get_Item_3) == 0x0001A0, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, CallFunc_Array_Length_ReturnValue_3) == 0x0001A8, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, K2Node_ComponentBoundEvent_bIsChecked_1) == 0x0001AC, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::K2Node_ComponentBoundEvent_bIsChecked_1' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, CallFunc_Less_IntInt_ReturnValue_3) == 0x0001AD, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, K2Node_ComponentBoundEvent_bIsChecked) == 0x0001AE, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, K2Node_CreateDelegate_OutputDelegate) == 0x0001B0, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, CallFunc_SetLookSensitivity_Sensitivity_ImplicitCast) == 0x0001C0, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::CallFunc_SetLookSensitivity_Sensitivity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, CallFunc_SetPercentageValue_Value_ImplicitCast) == 0x0001C8, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::CallFunc_SetPercentageValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab, CallFunc_SetValue_InValue_ImplicitCast) == 0x0001D0, "Member 'W_ControlsTab_C_ExecuteUbergraph_W_ControlsTab::CallFunc_SetValue_InValue_ImplicitCast' has a wrong offset!");

// Function W_ControlsTab.W_ControlsTab_C.InitUserInputSettings
// 0x0060 (0x0060 - 0x0000)
struct W_ControlsTab_C_InitUserInputSettings final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnhancedInputLocalPlayerSubsystem*     CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_GetUserSettings_self_CastInput; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEnhancedInputUserSettings*             CallFunc_GetUserSettings_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputMappingContext*                   CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerController_C*               K2Node_DynamicCast_AsBP_UPPlayer_Controller;       // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RegisterInputMappingContext_ReturnValue;  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMappingContextRegistered_ReturnValue;   // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x1];                                       // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ControlsTab_C_InitUserInputSettings) == 0x000008, "Wrong alignment on W_ControlsTab_C_InitUserInputSettings");
static_assert(sizeof(W_ControlsTab_C_InitUserInputSettings) == 0x000060, "Wrong size on W_ControlsTab_C_InitUserInputSettings");
static_assert(offsetof(W_ControlsTab_C_InitUserInputSettings, Temp_int_Array_Index_Variable) == 0x000000, "Member 'W_ControlsTab_C_InitUserInputSettings::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_InitUserInputSettings, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'W_ControlsTab_C_InitUserInputSettings::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_InitUserInputSettings, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'W_ControlsTab_C_InitUserInputSettings::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_InitUserInputSettings, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000010, "Member 'W_ControlsTab_C_InitUserInputSettings::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_InitUserInputSettings, CallFunc_GetUserSettings_self_CastInput) == 0x000018, "Member 'W_ControlsTab_C_InitUserInputSettings::CallFunc_GetUserSettings_self_CastInput' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_InitUserInputSettings, CallFunc_GetUserSettings_ReturnValue) == 0x000028, "Member 'W_ControlsTab_C_InitUserInputSettings::CallFunc_GetUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_InitUserInputSettings, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'W_ControlsTab_C_InitUserInputSettings::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_InitUserInputSettings, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'W_ControlsTab_C_InitUserInputSettings::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_InitUserInputSettings, CallFunc_Array_Get_Item) == 0x000040, "Member 'W_ControlsTab_C_InitUserInputSettings::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_InitUserInputSettings, K2Node_DynamicCast_AsBP_UPPlayer_Controller) == 0x000048, "Member 'W_ControlsTab_C_InitUserInputSettings::K2Node_DynamicCast_AsBP_UPPlayer_Controller' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_InitUserInputSettings, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'W_ControlsTab_C_InitUserInputSettings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_InitUserInputSettings, CallFunc_RegisterInputMappingContext_ReturnValue) == 0x000051, "Member 'W_ControlsTab_C_InitUserInputSettings::CallFunc_RegisterInputMappingContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_InitUserInputSettings, CallFunc_IsMappingContextRegistered_ReturnValue) == 0x000052, "Member 'W_ControlsTab_C_InitUserInputSettings::CallFunc_IsMappingContextRegistered_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_InitUserInputSettings, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'W_ControlsTab_C_InitUserInputSettings::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_InitUserInputSettings, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'W_ControlsTab_C_InitUserInputSettings::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function W_ControlsTab.W_ControlsTab_C.InputBindingChanged
// 0x0028 (0x0028 - 0x0000)
struct W_ControlsTab_C_InputBindingChanged final
{
public:
	class UW_InputBinding_C*                      BindingWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FInputChord                            Input;                                             // 0x0008(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(W_ControlsTab_C_InputBindingChanged) == 0x000008, "Wrong alignment on W_ControlsTab_C_InputBindingChanged");
static_assert(sizeof(W_ControlsTab_C_InputBindingChanged) == 0x000028, "Wrong size on W_ControlsTab_C_InputBindingChanged");
static_assert(offsetof(W_ControlsTab_C_InputBindingChanged, BindingWidget) == 0x000000, "Member 'W_ControlsTab_C_InputBindingChanged::BindingWidget' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_InputBindingChanged, Input) == 0x000008, "Member 'W_ControlsTab_C_InputBindingChanged::Input' has a wrong offset!");

// Function W_ControlsTab.W_ControlsTab_C.IsBindingRevelant
// 0x0078 (0x0078 - 0x0000)
struct W_ControlsTab_C_IsBindingRevelant final
{
public:
	struct FEnhancedActionKeyMapping              KeyMapping;                                        // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          IsController;                                      // 0x0050(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0051(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetMappingName_ReturnValue;               // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ControlsTab_C_IsBindingRevelant) == 0x000008, "Wrong alignment on W_ControlsTab_C_IsBindingRevelant");
static_assert(sizeof(W_ControlsTab_C_IsBindingRevelant) == 0x000078, "Wrong size on W_ControlsTab_C_IsBindingRevelant");
static_assert(offsetof(W_ControlsTab_C_IsBindingRevelant, KeyMapping) == 0x000000, "Member 'W_ControlsTab_C_IsBindingRevelant::KeyMapping' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_IsBindingRevelant, IsController) == 0x000050, "Member 'W_ControlsTab_C_IsBindingRevelant::IsController' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_IsBindingRevelant, Result) == 0x000051, "Member 'W_ControlsTab_C_IsBindingRevelant::Result' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_IsBindingRevelant, CallFunc_GetMappingName_ReturnValue) == 0x000054, "Member 'W_ControlsTab_C_IsBindingRevelant::CallFunc_GetMappingName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_IsBindingRevelant, CallFunc_Set_Contains_ReturnValue) == 0x00005C, "Member 'W_ControlsTab_C_IsBindingRevelant::CallFunc_Set_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_IsBindingRevelant, CallFunc_Conv_NameToString_ReturnValue) == 0x000060, "Member 'W_ControlsTab_C_IsBindingRevelant::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_IsBindingRevelant, CallFunc_Not_PreBool_ReturnValue) == 0x000070, "Member 'W_ControlsTab_C_IsBindingRevelant::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_IsBindingRevelant, CallFunc_Contains_ReturnValue) == 0x000071, "Member 'W_ControlsTab_C_IsBindingRevelant::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_IsBindingRevelant, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000072, "Member 'W_ControlsTab_C_IsBindingRevelant::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ControlsTab_C_IsBindingRevelant, CallFunc_BooleanAND_ReturnValue) == 0x000073, "Member 'W_ControlsTab_C_IsBindingRevelant::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function W_ControlsTab.W_ControlsTab_C.RefreshBindingWidgets
// 0x0001 (0x0001 - 0x0000)
struct W_ControlsTab_C_RefreshBindingWidgets final
{
public:
	bool                                          IsController;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ControlsTab_C_RefreshBindingWidgets) == 0x000001, "Wrong alignment on W_ControlsTab_C_RefreshBindingWidgets");
static_assert(sizeof(W_ControlsTab_C_RefreshBindingWidgets) == 0x000001, "Wrong size on W_ControlsTab_C_RefreshBindingWidgets");
static_assert(offsetof(W_ControlsTab_C_RefreshBindingWidgets, IsController) == 0x000000, "Member 'W_ControlsTab_C_RefreshBindingWidgets::IsController' has a wrong offset!");

// Function W_ControlsTab.W_ControlsTab_C.TabInit
// 0x0008 (0x0008 - 0x0000)
struct W_ControlsTab_C_TabInit final
{
public:
	class UW_MainMenu_C*                          MainMenu_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ControlsTab_C_TabInit) == 0x000008, "Wrong alignment on W_ControlsTab_C_TabInit");
static_assert(sizeof(W_ControlsTab_C_TabInit) == 0x000008, "Wrong size on W_ControlsTab_C_TabInit");
static_assert(offsetof(W_ControlsTab_C_TabInit, MainMenu_0) == 0x000000, "Member 'W_ControlsTab_C_TabInit::MainMenu_0' has a wrong offset!");

}

