#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Credits

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Credits.W_Credits_C.ExecuteUbergraph_W_Credits
// 0x0010 (0x0010 - 0x0000)
struct W_Credits_C_ExecuteUbergraph_W_Credits final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_MainMenu_C*                          K2Node_Event_MainMenu;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Credits_C_ExecuteUbergraph_W_Credits) == 0x000008, "Wrong alignment on W_Credits_C_ExecuteUbergraph_W_Credits");
static_assert(sizeof(W_Credits_C_ExecuteUbergraph_W_Credits) == 0x000010, "Wrong size on W_Credits_C_ExecuteUbergraph_W_Credits");
static_assert(offsetof(W_Credits_C_ExecuteUbergraph_W_Credits, EntryPoint) == 0x000000, "Member 'W_Credits_C_ExecuteUbergraph_W_Credits::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Credits_C_ExecuteUbergraph_W_Credits, K2Node_Event_MainMenu) == 0x000008, "Member 'W_Credits_C_ExecuteUbergraph_W_Credits::K2Node_Event_MainMenu' has a wrong offset!");

// Function W_Credits.W_Credits_C.TabInit
// 0x0008 (0x0008 - 0x0000)
struct W_Credits_C_TabInit final
{
public:
	class UW_MainMenu_C*                          MainMenu_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Credits_C_TabInit) == 0x000008, "Wrong alignment on W_Credits_C_TabInit");
static_assert(sizeof(W_Credits_C_TabInit) == 0x000008, "Wrong size on W_Credits_C_TabInit");
static_assert(offsetof(W_Credits_C_TabInit, MainMenu_0) == 0x000000, "Member 'W_Credits_C_TabInit::MainMenu_0' has a wrong offset!");

}

