#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DamageWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "E_Dismemberment_structs.hpp"
#include "E_DeathType_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_DamageWidget.W_DamageWidget_C
// 0x0018 (0x02D8 - 0x02C0)
class UW_DamageWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ColdAnim;                                          // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HarmedAnim;                                        // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_DamageWidget(int32 EntryPoint);
	void OnInitialized();
	void PlayerHarmed(int32 Damage, bool Ragdoll, const struct FVector& SourceLocation, double Force, E_Dismemberment Dismemberment, E_DeathType DeathType, class AActor* Attacker);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_DamageWidget_C">();
	}
	static class UW_DamageWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_DamageWidget_C>();
	}
};
static_assert(alignof(UW_DamageWidget_C) == 0x000008, "Wrong alignment on UW_DamageWidget_C");
static_assert(sizeof(UW_DamageWidget_C) == 0x0002D8, "Wrong size on UW_DamageWidget_C");
static_assert(offsetof(UW_DamageWidget_C, UberGraphFrame) == 0x0002C0, "Member 'UW_DamageWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_DamageWidget_C, ColdAnim) == 0x0002C8, "Member 'UW_DamageWidget_C::ColdAnim' has a wrong offset!");
static_assert(offsetof(UW_DamageWidget_C, HarmedAnim) == 0x0002D0, "Member 'UW_DamageWidget_C::HarmedAnim' has a wrong offset!");

}

