#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Dialogue

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_Dialogue.W_Dialogue_C.AddDialogueLine
// 0x0018 (0x0018 - 0x0000)
struct W_Dialogue_C_AddDialogueLine final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	double                                        Duration;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Dialogue_C_AddDialogueLine) == 0x000008, "Wrong alignment on W_Dialogue_C_AddDialogueLine");
static_assert(sizeof(W_Dialogue_C_AddDialogueLine) == 0x000018, "Wrong size on W_Dialogue_C_AddDialogueLine");
static_assert(offsetof(W_Dialogue_C_AddDialogueLine, Text) == 0x000000, "Member 'W_Dialogue_C_AddDialogueLine::Text' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_AddDialogueLine, Duration) == 0x000010, "Member 'W_Dialogue_C_AddDialogueLine::Duration' has a wrong offset!");

// Function W_Dialogue.W_Dialogue_C.ExecuteUbergraph_W_Dialogue
// 0x0068 (0x0068 - 0x0000)
struct W_Dialogue_C_ExecuteUbergraph_W_Dialogue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Text;                           // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Duration;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue) == 0x000008, "Wrong alignment on W_Dialogue_C_ExecuteUbergraph_W_Dialogue");
static_assert(sizeof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue) == 0x000068, "Wrong size on W_Dialogue_C_ExecuteUbergraph_W_Dialogue");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, EntryPoint) == 0x000000, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, K2Node_CustomEvent_Text) == 0x000008, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, K2Node_CustomEvent_Duration) == 0x000018, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::K2Node_CustomEvent_Duration' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000048, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, CallFunc_PlayAnimation_ReturnValue) == 0x000050, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, CallFunc_PlayAnimation_ReturnValue_1) == 0x000058, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Dialogue_C_ExecuteUbergraph_W_Dialogue, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000060, "Member 'W_Dialogue_C_ExecuteUbergraph_W_Dialogue::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

}

