#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Emotes

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Emotes.W_Emotes_C
// 0x0030 (0x02F0 - 0x02C0)
class UW_Emotes_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       IdleLoop;                                          // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Disappear;                                         // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Appear;                                            // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 EmoteIconImg;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_UPPlayerCharacter_C*                Player;                                            // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Emotes(int32 EntryPoint);
	void GetPlayer(class ABP_UPPlayerCharacter_C** Player_0);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Emotes_C">();
	}
	static class UW_Emotes_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Emotes_C>();
	}
};
static_assert(alignof(UW_Emotes_C) == 0x000008, "Wrong alignment on UW_Emotes_C");
static_assert(sizeof(UW_Emotes_C) == 0x0002F0, "Wrong size on UW_Emotes_C");
static_assert(offsetof(UW_Emotes_C, UberGraphFrame) == 0x0002C0, "Member 'UW_Emotes_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Emotes_C, IdleLoop) == 0x0002C8, "Member 'UW_Emotes_C::IdleLoop' has a wrong offset!");
static_assert(offsetof(UW_Emotes_C, Disappear) == 0x0002D0, "Member 'UW_Emotes_C::Disappear' has a wrong offset!");
static_assert(offsetof(UW_Emotes_C, Appear) == 0x0002D8, "Member 'UW_Emotes_C::Appear' has a wrong offset!");
static_assert(offsetof(UW_Emotes_C, EmoteIconImg) == 0x0002E0, "Member 'UW_Emotes_C::EmoteIconImg' has a wrong offset!");
static_assert(offsetof(UW_Emotes_C, Player) == 0x0002E8, "Member 'UW_Emotes_C::Player' has a wrong offset!");

}

