#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Episodes

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Episodes.W_Episodes_C
// 0x00E8 (0x03A8 - 0x02C0)
class UW_Episodes_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SuccessAnim;                                       // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FailureAnim;                                       // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       DayEndAnim;                                        // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FirstDayAnim;                                      // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             BETTERJOURNALIST;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BUTYOU;                                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             FAILED;                                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           FullScreen;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HUD;                                               // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HUDPressCard0;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HUDPressCard1;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HUDPressCard2;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HUDScore;                                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HUDScoreIcon;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HUDWallet;                                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LastReward;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PressCard0;                                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PressCard1;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PressCard2;                                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Success;                                           // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             YOURPHOTOSSUCKED;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_Episodes_C*                         Episodes;                                          // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   GameInstance;                                      // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_UPGameState_C*                      GameState;                                         // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UImage*>                         HUDPressCards;                                     // 0x0388(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UImage*>                         PressCards;                                        // 0x0398(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void DayEnded(class ABP_Episodes_C* Episodes_0);
	void ExecuteUbergraph_W_Episodes(int32 EntryPoint);
	void GetAnim(class UWidgetAnimation** Anim);
	void HideFullScreen();
	void HideFullScreenDelayed(double Delay);
	void Init(class ABP_Episodes_C* Episodes_0);
	void InitFullScreen();
	void OnInitialized();
	void SetHUDPressCards(int32 CardsLeft);
	void SetPressCards(int32 CardsLeft);
	void ShowFullScreen();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateDaysLeft();
	void UpdateHUD();
	void UpdateLastReward();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Episodes_C">();
	}
	static class UW_Episodes_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Episodes_C>();
	}
};
static_assert(alignof(UW_Episodes_C) == 0x000008, "Wrong alignment on UW_Episodes_C");
static_assert(sizeof(UW_Episodes_C) == 0x0003A8, "Wrong size on UW_Episodes_C");
static_assert(offsetof(UW_Episodes_C, UberGraphFrame) == 0x0002C0, "Member 'UW_Episodes_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Episodes_C, SuccessAnim) == 0x0002C8, "Member 'UW_Episodes_C::SuccessAnim' has a wrong offset!");
static_assert(offsetof(UW_Episodes_C, FailureAnim) == 0x0002D0, "Member 'UW_Episodes_C::FailureAnim' has a wrong offset!");
static_assert(offsetof(UW_Episodes_C, DayEndAnim) == 0x0002D8, "Member 'UW_Episodes_C::DayEndAnim' has a wrong offset!");
static_assert(offsetof(UW_Episodes_C, FirstDayAnim) == 0x0002E0, "Member 'UW_Episodes_C::FirstDayAnim' has a wrong offset!");
static_assert(offsetof(UW_Episodes_C, BETTERJOURNALIST) == 0x0002E8, "Member 'UW_Episodes_C::BETTERJOURNALIST' has a wrong offset!");
static_assert(offsetof(UW_Episodes_C, BUTYOU) == 0x0002F0, "Member 'UW_Episodes_C::BUTYOU' has a wrong offset!");
static_assert(offsetof(UW_Episodes_C, FAILED) == 0x0002F8, "Member 'UW_Episodes_C::FAILED' has a wrong offset!");
static_assert(offsetof(UW_Episodes_C, FullScreen) == 0x000300, "Member 'UW_Episodes_C::FullScreen' has a wrong offset!");
static_assert(offsetof(UW_Episodes_C, HUD) == 0x000308, "Member 'UW_Episodes_C::HUD' has a wrong offset!");
static_assert(offsetof(UW_Episodes_C, HUDPressCard0) == 0x000310, "Member 'UW_Episodes_C::HUDPressCard0' has a wrong offset!");
static_assert(offsetof(UW_Episodes_C, HUDPressCard1) == 0x000318, "Member 'UW_Episodes_C::HUDPressCard1' has a wrong offset!");
static_assert(offsetof(UW_Episodes_C, HUDPressCard2) == 0x000320, "Member 'UW_Episodes_C::HUDPressCard2' has a wrong offset!");
static_assert(offsetof(UW_Episodes_C, HUDScore) == 0x000328, "Member 'UW_Episodes_C::HUDScore' has a wrong offset!");
static_assert(offsetof(UW_Episodes_C, HUDScoreIcon) == 0x000330, "Member 'UW_Episodes_C::HUDScoreIcon' has a wrong offset!");
static_assert(offsetof(UW_Episodes_C, HUDWallet) == 0x000338, "Member 'UW_Episodes_C::HUDWallet' has a wrong offset!");
static_assert(offsetof(UW_Episodes_C, LastReward) == 0x000340, "Member 'UW_Episodes_C::LastReward' has a wrong offset!");
static_assert(offsetof(UW_Episodes_C, PressCard0) == 0x000348, "Member 'UW_Episodes_C::PressCard0' has a wrong offset!");
static_assert(offsetof(UW_Episodes_C, PressCard1) == 0x000350, "Member 'UW_Episodes_C::PressCard1' has a wrong offset!");
static_assert(offsetof(UW_Episodes_C, PressCard2) == 0x000358, "Member 'UW_Episodes_C::PressCard2' has a wrong offset!");
static_assert(offsetof(UW_Episodes_C, Success) == 0x000360, "Member 'UW_Episodes_C::Success' has a wrong offset!");
static_assert(offsetof(UW_Episodes_C, YOURPHOTOSSUCKED) == 0x000368, "Member 'UW_Episodes_C::YOURPHOTOSSUCKED' has a wrong offset!");
static_assert(offsetof(UW_Episodes_C, Episodes) == 0x000370, "Member 'UW_Episodes_C::Episodes' has a wrong offset!");
static_assert(offsetof(UW_Episodes_C, GameInstance) == 0x000378, "Member 'UW_Episodes_C::GameInstance' has a wrong offset!");
static_assert(offsetof(UW_Episodes_C, GameState) == 0x000380, "Member 'UW_Episodes_C::GameState' has a wrong offset!");
static_assert(offsetof(UW_Episodes_C, HUDPressCards) == 0x000388, "Member 'UW_Episodes_C::HUDPressCards' has a wrong offset!");
static_assert(offsetof(UW_Episodes_C, PressCards) == 0x000398, "Member 'UW_Episodes_C::PressCards' has a wrong offset!");

}

