#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Episodes

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Episodes.W_Episodes_C.DayEnded
// 0x0008 (0x0008 - 0x0000)
struct W_Episodes_C_DayEnded final
{
public:
	class ABP_Episodes_C*                         Episodes_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Episodes_C_DayEnded) == 0x000008, "Wrong alignment on W_Episodes_C_DayEnded");
static_assert(sizeof(W_Episodes_C_DayEnded) == 0x000008, "Wrong size on W_Episodes_C_DayEnded");
static_assert(offsetof(W_Episodes_C_DayEnded, Episodes_0) == 0x000000, "Member 'W_Episodes_C_DayEnded::Episodes_0' has a wrong offset!");

// Function W_Episodes.W_Episodes_C.ExecuteUbergraph_W_Episodes
// 0x0340 (0x0340 - 0x0000)
struct W_Episodes_C_ExecuteUbergraph_W_Episodes final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRemainingDays_RemainingDays;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0050)(HasGetValueTypeHash)
	class ABP_Episodes_C*                         K2Node_CustomEvent_Episodes_1;                     // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0018)()
	class ABP_Episodes_C*                         K2Node_CustomEvent_Episodes;                       // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Delay;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance;           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPGameState_C*                      K2Node_DynamicCast_AsBP_UPGame_State;              // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasInSession_Result;                      // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00F4(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_133[0x5];                                      // 0x0133(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0140(0x0050)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_2;            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0198(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01A8(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01F8(0x0018)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_3;            // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRemainingDays_RemainingDays_1;         // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0220(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0270(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0280(0x0018)()
	class UWidgetAnimation*                       CallFunc_GetAnim_Anim;                             // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_CardsLeft_1;                    // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UImage*>                         K2Node_MakeArray_Array_3;                          // 0x02C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_CardsLeft;                      // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UImage*>                         K2Node_MakeArray_Array_4;                          // 0x02F0(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ABP_Episodes_C* Episodes)> K2Node_CreateDelegate_OutputDelegate;            // 0x0304(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_Array_Get_Item_1;                         // 0x0318(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_325[0x3];                                      // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Episodes_C_ExecuteUbergraph_W_Episodes) == 0x000008, "Wrong alignment on W_Episodes_C_ExecuteUbergraph_W_Episodes");
static_assert(sizeof(W_Episodes_C_ExecuteUbergraph_W_Episodes) == 0x000340, "Wrong size on W_Episodes_C_ExecuteUbergraph_W_Episodes");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, EntryPoint) == 0x000000, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, Temp_int_Array_Index_Variable) == 0x000004, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_GetRemainingDays_RemainingDays) == 0x000014, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_GetRemainingDays_RemainingDays' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000018, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, K2Node_CustomEvent_Episodes_1) == 0x000070, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::K2Node_CustomEvent_Episodes_1' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, K2Node_MakeArray_Array) == 0x000078, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_Format_ReturnValue) == 0x000088, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, K2Node_CustomEvent_Episodes) == 0x0000A0, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::K2Node_CustomEvent_Episodes' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, K2Node_CustomEvent_Delay) == 0x0000A8, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::K2Node_CustomEvent_Delay' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_GetEndTime_ReturnValue) == 0x0000B0, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_PlayAnimation_ReturnValue) == 0x0000C0, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_GetGameInstance_ReturnValue) == 0x0000C8, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, K2Node_DynamicCast_AsBP_UPGame_Instance) == 0x0000D0, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::K2Node_DynamicCast_AsBP_UPGame_Instance' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_GetGameState_ReturnValue) == 0x0000E0, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, K2Node_DynamicCast_AsBP_UPGame_State) == 0x0000E8, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::K2Node_DynamicCast_AsBP_UPGame_State' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_WasInSession_Result) == 0x0000F1, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_WasInSession_Result' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, K2Node_Event_MyGeometry) == 0x0000F4, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, K2Node_Event_InDeltaTime) == 0x00012C, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_IsValid_ReturnValue) == 0x000130, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_IsValid_ReturnValue_1) == 0x000131, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_BooleanAND_ReturnValue) == 0x000132, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000138, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, K2Node_MakeStruct_FormatArgumentData_1) == 0x000140, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_Conv_IntToInt64_ReturnValue_2) == 0x000190, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_Conv_IntToInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, K2Node_MakeArray_Array_1) == 0x000198, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, K2Node_MakeStruct_FormatArgumentData_2) == 0x0001A8, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_Format_ReturnValue_1) == 0x0001F8, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_Conv_IntToInt64_ReturnValue_3) == 0x000210, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_Conv_IntToInt64_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_GetRemainingDays_RemainingDays_1) == 0x000218, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_GetRemainingDays_RemainingDays_1' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, K2Node_MakeStruct_FormatArgumentData_3) == 0x000220, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, K2Node_MakeArray_Array_2) == 0x000270, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_Format_ReturnValue_2) == 0x000280, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_GetAnim_Anim) == 0x000298, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_GetAnim_Anim' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, K2Node_CustomEvent_CardsLeft_1) == 0x0002A0, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::K2Node_CustomEvent_CardsLeft_1' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_GetEndTime_ReturnValue_1) == 0x0002A4, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_Less_IntInt_ReturnValue) == 0x0002A8, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0002B0, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_PlayAnimation_ReturnValue_1) == 0x0002B8, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, K2Node_MakeArray_Array_3) == 0x0002C0, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_Array_Get_Item) == 0x0002D0, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_Array_Length_ReturnValue) == 0x0002D8, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, Temp_int_Loop_Counter_Variable_1) == 0x0002DC, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002E0, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_Add_IntInt_ReturnValue_1) == 0x0002E4, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, K2Node_CustomEvent_CardsLeft) == 0x0002E8, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::K2Node_CustomEvent_CardsLeft' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, K2Node_MakeArray_Array_4) == 0x0002F0, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_Less_IntInt_ReturnValue_2) == 0x000300, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, K2Node_CreateDelegate_OutputDelegate) == 0x000304, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_Array_Get_Item_1) == 0x000318, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_Array_Length_ReturnValue_1) == 0x000320, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_Less_IntInt_ReturnValue_3) == 0x000324, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_Delay_Duration_ImplicitCast) == 0x000328, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000330, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_ExecuteUbergraph_W_Episodes, CallFunc_Add_DoubleDouble_A_ImplicitCast_1) == 0x000338, "Member 'W_Episodes_C_ExecuteUbergraph_W_Episodes::CallFunc_Add_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

// Function W_Episodes.W_Episodes_C.GetAnim
// 0x0010 (0x0010 - 0x0000)
struct W_Episodes_C_GetAnim final
{
public:
	class UWidgetAnimation*                       Anim;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Episodes_C_GetAnim) == 0x000008, "Wrong alignment on W_Episodes_C_GetAnim");
static_assert(sizeof(W_Episodes_C_GetAnim) == 0x000010, "Wrong size on W_Episodes_C_GetAnim");
static_assert(offsetof(W_Episodes_C_GetAnim, Anim) == 0x000000, "Member 'W_Episodes_C_GetAnim::Anim' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_GetAnim, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'W_Episodes_C_GetAnim::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function W_Episodes.W_Episodes_C.HideFullScreenDelayed
// 0x0008 (0x0008 - 0x0000)
struct W_Episodes_C_HideFullScreenDelayed final
{
public:
	double                                        Delay;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Episodes_C_HideFullScreenDelayed) == 0x000008, "Wrong alignment on W_Episodes_C_HideFullScreenDelayed");
static_assert(sizeof(W_Episodes_C_HideFullScreenDelayed) == 0x000008, "Wrong size on W_Episodes_C_HideFullScreenDelayed");
static_assert(offsetof(W_Episodes_C_HideFullScreenDelayed, Delay) == 0x000000, "Member 'W_Episodes_C_HideFullScreenDelayed::Delay' has a wrong offset!");

// Function W_Episodes.W_Episodes_C.Init
// 0x0008 (0x0008 - 0x0000)
struct W_Episodes_C_Init final
{
public:
	class ABP_Episodes_C*                         Episodes_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Episodes_C_Init) == 0x000008, "Wrong alignment on W_Episodes_C_Init");
static_assert(sizeof(W_Episodes_C_Init) == 0x000008, "Wrong size on W_Episodes_C_Init");
static_assert(offsetof(W_Episodes_C_Init, Episodes_0) == 0x000000, "Member 'W_Episodes_C_Init::Episodes_0' has a wrong offset!");

// Function W_Episodes.W_Episodes_C.SetHUDPressCards
// 0x0004 (0x0004 - 0x0000)
struct W_Episodes_C_SetHUDPressCards final
{
public:
	int32                                         CardsLeft;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Episodes_C_SetHUDPressCards) == 0x000004, "Wrong alignment on W_Episodes_C_SetHUDPressCards");
static_assert(sizeof(W_Episodes_C_SetHUDPressCards) == 0x000004, "Wrong size on W_Episodes_C_SetHUDPressCards");
static_assert(offsetof(W_Episodes_C_SetHUDPressCards, CardsLeft) == 0x000000, "Member 'W_Episodes_C_SetHUDPressCards::CardsLeft' has a wrong offset!");

// Function W_Episodes.W_Episodes_C.SetPressCards
// 0x0004 (0x0004 - 0x0000)
struct W_Episodes_C_SetPressCards final
{
public:
	int32                                         CardsLeft;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Episodes_C_SetPressCards) == 0x000004, "Wrong alignment on W_Episodes_C_SetPressCards");
static_assert(sizeof(W_Episodes_C_SetPressCards) == 0x000004, "Wrong size on W_Episodes_C_SetPressCards");
static_assert(offsetof(W_Episodes_C_SetPressCards, CardsLeft) == 0x000000, "Member 'W_Episodes_C_SetPressCards::CardsLeft' has a wrong offset!");

// Function W_Episodes.W_Episodes_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_Episodes_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Episodes_C_Tick) == 0x000004, "Wrong alignment on W_Episodes_C_Tick");
static_assert(sizeof(W_Episodes_C_Tick) == 0x00003C, "Wrong size on W_Episodes_C_Tick");
static_assert(offsetof(W_Episodes_C_Tick, MyGeometry) == 0x000000, "Member 'W_Episodes_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Episodes_C_Tick, InDeltaTime) == 0x000038, "Member 'W_Episodes_C_Tick::InDeltaTime' has a wrong offset!");

}

