#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_GamepadFocusHighlight

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_GamepadFocusHighlight.W_GamepadFocusHighlight_C
// 0x0030 (0x02F0 - 0x02C0)
class UW_GamepadFocusHighlight_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_UPGameInstance_C*                   GameInstance;                                      // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerController_C*               PlayerController;                                  // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USlateBrushAsset*                       FocusHighlightBrush;                               // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FocusHighlightTint;                                // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_GamepadFocusHighlight(int32 EntryPoint);
	void OnInitialized();

	void OnPaint(struct FPaintContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_GamepadFocusHighlight_C">();
	}
	static class UW_GamepadFocusHighlight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_GamepadFocusHighlight_C>();
	}
};
static_assert(alignof(UW_GamepadFocusHighlight_C) == 0x000008, "Wrong alignment on UW_GamepadFocusHighlight_C");
static_assert(sizeof(UW_GamepadFocusHighlight_C) == 0x0002F0, "Wrong size on UW_GamepadFocusHighlight_C");
static_assert(offsetof(UW_GamepadFocusHighlight_C, UberGraphFrame) == 0x0002C0, "Member 'UW_GamepadFocusHighlight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_GamepadFocusHighlight_C, GameInstance) == 0x0002C8, "Member 'UW_GamepadFocusHighlight_C::GameInstance' has a wrong offset!");
static_assert(offsetof(UW_GamepadFocusHighlight_C, PlayerController) == 0x0002D0, "Member 'UW_GamepadFocusHighlight_C::PlayerController' has a wrong offset!");
static_assert(offsetof(UW_GamepadFocusHighlight_C, FocusHighlightBrush) == 0x0002D8, "Member 'UW_GamepadFocusHighlight_C::FocusHighlightBrush' has a wrong offset!");
static_assert(offsetof(UW_GamepadFocusHighlight_C, FocusHighlightTint) == 0x0002E0, "Member 'UW_GamepadFocusHighlight_C::FocusHighlightTint' has a wrong offset!");

}

