#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_GamepadFocusHighlight

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_GamepadFocusHighlight.W_GamepadFocusHighlight_C.ExecuteUbergraph_W_GamepadFocusHighlight
// 0x0038 (0x0038 - 0x0000)
struct W_GamepadFocusHighlight_C_ExecuteUbergraph_W_GamepadFocusHighlight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerController_C*               K2Node_DynamicCast_AsBP_UPPlayer_Controller;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GamepadFocusHighlight_C_ExecuteUbergraph_W_GamepadFocusHighlight) == 0x000008, "Wrong alignment on W_GamepadFocusHighlight_C_ExecuteUbergraph_W_GamepadFocusHighlight");
static_assert(sizeof(W_GamepadFocusHighlight_C_ExecuteUbergraph_W_GamepadFocusHighlight) == 0x000038, "Wrong size on W_GamepadFocusHighlight_C_ExecuteUbergraph_W_GamepadFocusHighlight");
static_assert(offsetof(W_GamepadFocusHighlight_C_ExecuteUbergraph_W_GamepadFocusHighlight, EntryPoint) == 0x000000, "Member 'W_GamepadFocusHighlight_C_ExecuteUbergraph_W_GamepadFocusHighlight::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_GamepadFocusHighlight_C_ExecuteUbergraph_W_GamepadFocusHighlight, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'W_GamepadFocusHighlight_C_ExecuteUbergraph_W_GamepadFocusHighlight::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GamepadFocusHighlight_C_ExecuteUbergraph_W_GamepadFocusHighlight, K2Node_DynamicCast_AsBP_UPPlayer_Controller) == 0x000010, "Member 'W_GamepadFocusHighlight_C_ExecuteUbergraph_W_GamepadFocusHighlight::K2Node_DynamicCast_AsBP_UPPlayer_Controller' has a wrong offset!");
static_assert(offsetof(W_GamepadFocusHighlight_C_ExecuteUbergraph_W_GamepadFocusHighlight, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'W_GamepadFocusHighlight_C_ExecuteUbergraph_W_GamepadFocusHighlight::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_GamepadFocusHighlight_C_ExecuteUbergraph_W_GamepadFocusHighlight, CallFunc_GetGameInstance_ReturnValue) == 0x000020, "Member 'W_GamepadFocusHighlight_C_ExecuteUbergraph_W_GamepadFocusHighlight::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GamepadFocusHighlight_C_ExecuteUbergraph_W_GamepadFocusHighlight, K2Node_DynamicCast_AsBP_UPGame_Instance) == 0x000028, "Member 'W_GamepadFocusHighlight_C_ExecuteUbergraph_W_GamepadFocusHighlight::K2Node_DynamicCast_AsBP_UPGame_Instance' has a wrong offset!");
static_assert(offsetof(W_GamepadFocusHighlight_C_ExecuteUbergraph_W_GamepadFocusHighlight, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'W_GamepadFocusHighlight_C_ExecuteUbergraph_W_GamepadFocusHighlight::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function W_GamepadFocusHighlight.W_GamepadFocusHighlight_C.OnPaint
// 0x00D8 (0x00D8 - 0x0000)
struct W_GamepadFocusHighlight_C_OnPaint final
{
public:
	struct FPaintContext                          Context;                                           // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FGeometry                              CallFunc_GetFocusedWidgetGeometry_OutGeometry;     // 0x0030(0x0038)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFocusedWidgetGeometry_ReturnValue;     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_LocalToViewport_PixelPosition;            // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_ViewportPosition;         // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_PixelPosition_1;          // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_ViewportPosition_1;       // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GamepadFocusHighlight_C_OnPaint) == 0x000008, "Wrong alignment on W_GamepadFocusHighlight_C_OnPaint");
static_assert(sizeof(W_GamepadFocusHighlight_C_OnPaint) == 0x0000D8, "Wrong size on W_GamepadFocusHighlight_C_OnPaint");
static_assert(offsetof(W_GamepadFocusHighlight_C_OnPaint, Context) == 0x000000, "Member 'W_GamepadFocusHighlight_C_OnPaint::Context' has a wrong offset!");
static_assert(offsetof(W_GamepadFocusHighlight_C_OnPaint, CallFunc_GetFocusedWidgetGeometry_OutGeometry) == 0x000030, "Member 'W_GamepadFocusHighlight_C_OnPaint::CallFunc_GetFocusedWidgetGeometry_OutGeometry' has a wrong offset!");
static_assert(offsetof(W_GamepadFocusHighlight_C_OnPaint, CallFunc_GetFocusedWidgetGeometry_ReturnValue) == 0x000068, "Member 'W_GamepadFocusHighlight_C_OnPaint::CallFunc_GetFocusedWidgetGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GamepadFocusHighlight_C_OnPaint, CallFunc_LocalToViewport_PixelPosition) == 0x000070, "Member 'W_GamepadFocusHighlight_C_OnPaint::CallFunc_LocalToViewport_PixelPosition' has a wrong offset!");
static_assert(offsetof(W_GamepadFocusHighlight_C_OnPaint, CallFunc_LocalToViewport_ViewportPosition) == 0x000080, "Member 'W_GamepadFocusHighlight_C_OnPaint::CallFunc_LocalToViewport_ViewportPosition' has a wrong offset!");
static_assert(offsetof(W_GamepadFocusHighlight_C_OnPaint, CallFunc_GetLocalSize_ReturnValue) == 0x000090, "Member 'W_GamepadFocusHighlight_C_OnPaint::CallFunc_GetLocalSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GamepadFocusHighlight_C_OnPaint, CallFunc_LocalToViewport_PixelPosition_1) == 0x0000A0, "Member 'W_GamepadFocusHighlight_C_OnPaint::CallFunc_LocalToViewport_PixelPosition_1' has a wrong offset!");
static_assert(offsetof(W_GamepadFocusHighlight_C_OnPaint, CallFunc_LocalToViewport_ViewportPosition_1) == 0x0000B0, "Member 'W_GamepadFocusHighlight_C_OnPaint::CallFunc_LocalToViewport_ViewportPosition_1' has a wrong offset!");
static_assert(offsetof(W_GamepadFocusHighlight_C_OnPaint, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x0000C0, "Member 'W_GamepadFocusHighlight_C_OnPaint::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GamepadFocusHighlight_C_OnPaint, CallFunc_BooleanAND_ReturnValue) == 0x0000D0, "Member 'W_GamepadFocusHighlight_C_OnPaint::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GamepadFocusHighlight_C_OnPaint, CallFunc_IsValid_ReturnValue) == 0x0000D1, "Member 'W_GamepadFocusHighlight_C_OnPaint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GamepadFocusHighlight_C_OnPaint, CallFunc_IsValid_ReturnValue_1) == 0x0000D2, "Member 'W_GamepadFocusHighlight_C_OnPaint::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_GamepadFocusHighlight_C_OnPaint, CallFunc_BooleanAND_ReturnValue_1) == 0x0000D3, "Member 'W_GamepadFocusHighlight_C_OnPaint::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

}

