#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_GameSession

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_GameSession.W_GameSession_C
// 0x0018 (0x02D8 - 0x02C0)
class UW_GameSession_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TimerText;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_UPGameSession_C*                    GameSession;                                       // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_GameSession(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_GameSession_C">();
	}
	static class UW_GameSession_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_GameSession_C>();
	}
};
static_assert(alignof(UW_GameSession_C) == 0x000008, "Wrong alignment on UW_GameSession_C");
static_assert(sizeof(UW_GameSession_C) == 0x0002D8, "Wrong size on UW_GameSession_C");
static_assert(offsetof(UW_GameSession_C, UberGraphFrame) == 0x0002C0, "Member 'UW_GameSession_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_GameSession_C, TimerText) == 0x0002C8, "Member 'UW_GameSession_C::TimerText' has a wrong offset!");
static_assert(offsetof(UW_GameSession_C, GameSession) == 0x0002D0, "Member 'UW_GameSession_C::GameSession' has a wrong offset!");

}

