#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_GameSession

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_GameSession.W_GameSession_C.ExecuteUbergraph_W_GameSession
// 0x0150 (0x0150 - 0x0000)
struct W_GameSession_C_ExecuteUbergraph_W_GameSession final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_MakeTimespan2_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan2_Days;                      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan2_Hours;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan2_Minutes;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan2_Seconds;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan2_FractionNano;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0070(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0088(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00D8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0128(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0138(0x0018)()
};
static_assert(alignof(W_GameSession_C_ExecuteUbergraph_W_GameSession) == 0x000008, "Wrong alignment on W_GameSession_C_ExecuteUbergraph_W_GameSession");
static_assert(sizeof(W_GameSession_C_ExecuteUbergraph_W_GameSession) == 0x000150, "Wrong size on W_GameSession_C_ExecuteUbergraph_W_GameSession");
static_assert(offsetof(W_GameSession_C_ExecuteUbergraph_W_GameSession, EntryPoint) == 0x000000, "Member 'W_GameSession_C_ExecuteUbergraph_W_GameSession::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_GameSession_C_ExecuteUbergraph_W_GameSession, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'W_GameSession_C_ExecuteUbergraph_W_GameSession::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GameSession_C_ExecuteUbergraph_W_GameSession, K2Node_Event_MyGeometry) == 0x000008, "Member 'W_GameSession_C_ExecuteUbergraph_W_GameSession::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_GameSession_C_ExecuteUbergraph_W_GameSession, K2Node_Event_InDeltaTime) == 0x000040, "Member 'W_GameSession_C_ExecuteUbergraph_W_GameSession::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_GameSession_C_ExecuteUbergraph_W_GameSession, CallFunc_FTrunc_ReturnValue) == 0x000044, "Member 'W_GameSession_C_ExecuteUbergraph_W_GameSession::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GameSession_C_ExecuteUbergraph_W_GameSession, CallFunc_MakeTimespan2_ReturnValue) == 0x000048, "Member 'W_GameSession_C_ExecuteUbergraph_W_GameSession::CallFunc_MakeTimespan2_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GameSession_C_ExecuteUbergraph_W_GameSession, CallFunc_BreakTimespan2_Days) == 0x000050, "Member 'W_GameSession_C_ExecuteUbergraph_W_GameSession::CallFunc_BreakTimespan2_Days' has a wrong offset!");
static_assert(offsetof(W_GameSession_C_ExecuteUbergraph_W_GameSession, CallFunc_BreakTimespan2_Hours) == 0x000054, "Member 'W_GameSession_C_ExecuteUbergraph_W_GameSession::CallFunc_BreakTimespan2_Hours' has a wrong offset!");
static_assert(offsetof(W_GameSession_C_ExecuteUbergraph_W_GameSession, CallFunc_BreakTimespan2_Minutes) == 0x000058, "Member 'W_GameSession_C_ExecuteUbergraph_W_GameSession::CallFunc_BreakTimespan2_Minutes' has a wrong offset!");
static_assert(offsetof(W_GameSession_C_ExecuteUbergraph_W_GameSession, CallFunc_BreakTimespan2_Seconds) == 0x00005C, "Member 'W_GameSession_C_ExecuteUbergraph_W_GameSession::CallFunc_BreakTimespan2_Seconds' has a wrong offset!");
static_assert(offsetof(W_GameSession_C_ExecuteUbergraph_W_GameSession, CallFunc_BreakTimespan2_FractionNano) == 0x000060, "Member 'W_GameSession_C_ExecuteUbergraph_W_GameSession::CallFunc_BreakTimespan2_FractionNano' has a wrong offset!");
static_assert(offsetof(W_GameSession_C_ExecuteUbergraph_W_GameSession, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000068, "Member 'W_GameSession_C_ExecuteUbergraph_W_GameSession::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GameSession_C_ExecuteUbergraph_W_GameSession, CallFunc_Conv_IntToText_ReturnValue) == 0x000070, "Member 'W_GameSession_C_ExecuteUbergraph_W_GameSession::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_GameSession_C_ExecuteUbergraph_W_GameSession, K2Node_MakeStruct_FormatArgumentData) == 0x000088, "Member 'W_GameSession_C_ExecuteUbergraph_W_GameSession::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_GameSession_C_ExecuteUbergraph_W_GameSession, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000D8, "Member 'W_GameSession_C_ExecuteUbergraph_W_GameSession::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_GameSession_C_ExecuteUbergraph_W_GameSession, K2Node_MakeArray_Array) == 0x000128, "Member 'W_GameSession_C_ExecuteUbergraph_W_GameSession::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_GameSession_C_ExecuteUbergraph_W_GameSession, CallFunc_Format_ReturnValue) == 0x000138, "Member 'W_GameSession_C_ExecuteUbergraph_W_GameSession::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function W_GameSession.W_GameSession_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_GameSession_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_GameSession_C_Tick) == 0x000004, "Wrong alignment on W_GameSession_C_Tick");
static_assert(sizeof(W_GameSession_C_Tick) == 0x00003C, "Wrong size on W_GameSession_C_Tick");
static_assert(offsetof(W_GameSession_C_Tick, MyGeometry) == 0x000000, "Member 'W_GameSession_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_GameSession_C_Tick, InDeltaTime) == 0x000038, "Member 'W_GameSession_C_Tick::InDeltaTime' has a wrong offset!");

}

