#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Handicaps

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Handicaps.W_Handicaps_C
// 0x0020 (0x02E0 - 0x02C0)
class UW_Handicaps_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 LostHand;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LostLeg;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_UPPlayerCharacter_C*                LocalPlayer;                                       // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Handicaps(int32 EntryPoint);
	void GetLocalPlayer(class ABP_UPPlayerCharacter_C** Player);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Handicaps_C">();
	}
	static class UW_Handicaps_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Handicaps_C>();
	}
};
static_assert(alignof(UW_Handicaps_C) == 0x000008, "Wrong alignment on UW_Handicaps_C");
static_assert(sizeof(UW_Handicaps_C) == 0x0002E0, "Wrong size on UW_Handicaps_C");
static_assert(offsetof(UW_Handicaps_C, UberGraphFrame) == 0x0002C0, "Member 'UW_Handicaps_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Handicaps_C, LostHand) == 0x0002C8, "Member 'UW_Handicaps_C::LostHand' has a wrong offset!");
static_assert(offsetof(UW_Handicaps_C, LostLeg) == 0x0002D0, "Member 'UW_Handicaps_C::LostLeg' has a wrong offset!");
static_assert(offsetof(UW_Handicaps_C, LocalPlayer) == 0x0002D8, "Member 'UW_Handicaps_C::LocalPlayer' has a wrong offset!");

}

