#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_HealthIndicator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_HealthIndicator.W_HealthIndicator_C
// 0x0018 (0x02D8 - 0x02C0)
class UW_HealthIndicator_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 HealthIcon;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HealthNumber;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_HealthIndicator(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_HealthIndicator_C">();
	}
	static class UW_HealthIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_HealthIndicator_C>();
	}
};
static_assert(alignof(UW_HealthIndicator_C) == 0x000008, "Wrong alignment on UW_HealthIndicator_C");
static_assert(sizeof(UW_HealthIndicator_C) == 0x0002D8, "Wrong size on UW_HealthIndicator_C");
static_assert(offsetof(UW_HealthIndicator_C, UberGraphFrame) == 0x0002C0, "Member 'UW_HealthIndicator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_HealthIndicator_C, HealthIcon) == 0x0002C8, "Member 'UW_HealthIndicator_C::HealthIcon' has a wrong offset!");
static_assert(offsetof(UW_HealthIndicator_C, HealthNumber) == 0x0002D0, "Member 'UW_HealthIndicator_C::HealthNumber' has a wrong offset!");

}

