#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Interaction

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Interaction.W_Interaction_C
// 0x0050 (0x0310 - 0x02C0)
class UW_Interaction_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Dot;                                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           InteractionProgress;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_InputKey_C*                          W_InputKey;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            InteractionColor;                                  // 0x02E0(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            DefaultColor;                                      // 0x02F4(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABP_UPPlayerController_C*               PlayerController;                                  // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Interaction(int32 EntryPoint);
	void OnInitialized();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateProgress(class ABP_UPPlayerCharacter_C* Player);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Interaction_C">();
	}
	static class UW_Interaction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Interaction_C>();
	}
};
static_assert(alignof(UW_Interaction_C) == 0x000008, "Wrong alignment on UW_Interaction_C");
static_assert(sizeof(UW_Interaction_C) == 0x000310, "Wrong size on UW_Interaction_C");
static_assert(offsetof(UW_Interaction_C, UberGraphFrame) == 0x0002C0, "Member 'UW_Interaction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Interaction_C, Dot) == 0x0002C8, "Member 'UW_Interaction_C::Dot' has a wrong offset!");
static_assert(offsetof(UW_Interaction_C, InteractionProgress) == 0x0002D0, "Member 'UW_Interaction_C::InteractionProgress' has a wrong offset!");
static_assert(offsetof(UW_Interaction_C, W_InputKey) == 0x0002D8, "Member 'UW_Interaction_C::W_InputKey' has a wrong offset!");
static_assert(offsetof(UW_Interaction_C, InteractionColor) == 0x0002E0, "Member 'UW_Interaction_C::InteractionColor' has a wrong offset!");
static_assert(offsetof(UW_Interaction_C, DefaultColor) == 0x0002F4, "Member 'UW_Interaction_C::DefaultColor' has a wrong offset!");
static_assert(offsetof(UW_Interaction_C, PlayerController) == 0x000308, "Member 'UW_Interaction_C::PlayerController' has a wrong offset!");

}

