#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_InputBinding

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "EnhancedInput_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_InputBinding.W_InputBinding_C
// 0x0098 (0x0358 - 0x02C0)
class UW_InputBinding_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInputKeySelector*                      InputKeySelector;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NameText;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ResetButton;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ResetImg;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEnhancedInputUserSettings*             UserInputSettings;                                 // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FEnhancedActionKeyMapping              KeyMapping;                                        // 0x02F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UW_InputBinding_C* BindingWidget, const struct FInputChord& Input)> OnInputBindingChanged; // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Is_Controller;                                     // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_InputBinding_ResetButton_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void ExecuteUbergraph_W_InputBinding(int32 EntryPoint);
	void GetCurrentKey(struct FInputChord* InputChord);
	void GetDefaultKey(struct FInputChord* InputChord);
	void InitInputBinding(class UEnhancedInputUserSettings* UserInputSettings_0, const struct FEnhancedActionKeyMapping& KeyMapping_0, bool IsController);
	void InputKeySelected(const struct FInputChord& SelectedKey);
	void ResetToDefault();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_InputBinding_C">();
	}
	static class UW_InputBinding_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_InputBinding_C>();
	}
};
static_assert(alignof(UW_InputBinding_C) == 0x000008, "Wrong alignment on UW_InputBinding_C");
static_assert(sizeof(UW_InputBinding_C) == 0x000358, "Wrong size on UW_InputBinding_C");
static_assert(offsetof(UW_InputBinding_C, UberGraphFrame) == 0x0002C0, "Member 'UW_InputBinding_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_InputBinding_C, InputKeySelector) == 0x0002C8, "Member 'UW_InputBinding_C::InputKeySelector' has a wrong offset!");
static_assert(offsetof(UW_InputBinding_C, NameText) == 0x0002D0, "Member 'UW_InputBinding_C::NameText' has a wrong offset!");
static_assert(offsetof(UW_InputBinding_C, ResetButton) == 0x0002D8, "Member 'UW_InputBinding_C::ResetButton' has a wrong offset!");
static_assert(offsetof(UW_InputBinding_C, ResetImg) == 0x0002E0, "Member 'UW_InputBinding_C::ResetImg' has a wrong offset!");
static_assert(offsetof(UW_InputBinding_C, UserInputSettings) == 0x0002E8, "Member 'UW_InputBinding_C::UserInputSettings' has a wrong offset!");
static_assert(offsetof(UW_InputBinding_C, KeyMapping) == 0x0002F0, "Member 'UW_InputBinding_C::KeyMapping' has a wrong offset!");
static_assert(offsetof(UW_InputBinding_C, OnInputBindingChanged) == 0x000340, "Member 'UW_InputBinding_C::OnInputBindingChanged' has a wrong offset!");
static_assert(offsetof(UW_InputBinding_C, Is_Controller) == 0x000350, "Member 'UW_InputBinding_C::Is_Controller' has a wrong offset!");

}

