#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_InputKey

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_InputKey.W_InputKey_C.SetInputAction
// 0x0020 (0x0020 - 0x0000)
struct W_InputKey_C_SetInputAction final
{
public:
	class UInputAction*                           InputAction_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   ActionText_0;                                      // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(W_InputKey_C_SetInputAction) == 0x000008, "Wrong alignment on W_InputKey_C_SetInputAction");
static_assert(sizeof(W_InputKey_C_SetInputAction) == 0x000020, "Wrong size on W_InputKey_C_SetInputAction");
static_assert(offsetof(W_InputKey_C_SetInputAction, InputAction_0) == 0x000000, "Member 'W_InputKey_C_SetInputAction::InputAction_0' has a wrong offset!");
static_assert(offsetof(W_InputKey_C_SetInputAction, ActionText_0) == 0x000008, "Member 'W_InputKey_C_SetInputAction::ActionText_0' has a wrong offset!");

// Function W_InputKey.W_InputKey_C.ExecuteUbergraph_W_InputKey
// 0x00F0 (0x00F0 - 0x0000)
struct W_InputKey_C_ExecuteUbergraph_W_InputKey final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerController_C*               K2Node_DynamicCast_AsBP_UPPlayer_Controller;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetInputKey_Key;                          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetInputKey_Icon;                         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	class UInputAction*                           K2Node_CustomEvent_InputAction;                    // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_ActionText;                     // 0x00C0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D8(0x0018)()
};
static_assert(alignof(W_InputKey_C_ExecuteUbergraph_W_InputKey) == 0x000008, "Wrong alignment on W_InputKey_C_ExecuteUbergraph_W_InputKey");
static_assert(sizeof(W_InputKey_C_ExecuteUbergraph_W_InputKey) == 0x0000F0, "Wrong size on W_InputKey_C_ExecuteUbergraph_W_InputKey");
static_assert(offsetof(W_InputKey_C_ExecuteUbergraph_W_InputKey, EntryPoint) == 0x000000, "Member 'W_InputKey_C_ExecuteUbergraph_W_InputKey::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_InputKey_C_ExecuteUbergraph_W_InputKey, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'W_InputKey_C_ExecuteUbergraph_W_InputKey::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_InputKey_C_ExecuteUbergraph_W_InputKey, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'W_InputKey_C_ExecuteUbergraph_W_InputKey::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_InputKey_C_ExecuteUbergraph_W_InputKey, K2Node_DynamicCast_AsBP_UPPlayer_Controller) == 0x000010, "Member 'W_InputKey_C_ExecuteUbergraph_W_InputKey::K2Node_DynamicCast_AsBP_UPPlayer_Controller' has a wrong offset!");
static_assert(offsetof(W_InputKey_C_ExecuteUbergraph_W_InputKey, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'W_InputKey_C_ExecuteUbergraph_W_InputKey::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_InputKey_C_ExecuteUbergraph_W_InputKey, CallFunc_GetInputKey_Key) == 0x000020, "Member 'W_InputKey_C_ExecuteUbergraph_W_InputKey::CallFunc_GetInputKey_Key' has a wrong offset!");
static_assert(offsetof(W_InputKey_C_ExecuteUbergraph_W_InputKey, CallFunc_GetInputKey_Icon) == 0x000030, "Member 'W_InputKey_C_ExecuteUbergraph_W_InputKey::CallFunc_GetInputKey_Icon' has a wrong offset!");
static_assert(offsetof(W_InputKey_C_ExecuteUbergraph_W_InputKey, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'W_InputKey_C_ExecuteUbergraph_W_InputKey::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_InputKey_C_ExecuteUbergraph_W_InputKey, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'W_InputKey_C_ExecuteUbergraph_W_InputKey::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_InputKey_C_ExecuteUbergraph_W_InputKey, K2Node_MakeStruct_FormatArgumentData) == 0x000058, "Member 'W_InputKey_C_ExecuteUbergraph_W_InputKey::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_InputKey_C_ExecuteUbergraph_W_InputKey, K2Node_MakeArray_Array) == 0x0000A8, "Member 'W_InputKey_C_ExecuteUbergraph_W_InputKey::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_InputKey_C_ExecuteUbergraph_W_InputKey, K2Node_CustomEvent_InputAction) == 0x0000B8, "Member 'W_InputKey_C_ExecuteUbergraph_W_InputKey::K2Node_CustomEvent_InputAction' has a wrong offset!");
static_assert(offsetof(W_InputKey_C_ExecuteUbergraph_W_InputKey, K2Node_CustomEvent_ActionText) == 0x0000C0, "Member 'W_InputKey_C_ExecuteUbergraph_W_InputKey::K2Node_CustomEvent_ActionText' has a wrong offset!");
static_assert(offsetof(W_InputKey_C_ExecuteUbergraph_W_InputKey, CallFunc_Format_ReturnValue) == 0x0000D8, "Member 'W_InputKey_C_ExecuteUbergraph_W_InputKey::CallFunc_Format_ReturnValue' has a wrong offset!");

}

