#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Interaction

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Interaction.W_Interaction_C.ExecuteUbergraph_W_Interaction
// 0x00E8 (0x00E8 - 0x0000)
struct W_Interaction_C_ExecuteUbergraph_W_Interaction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                K2Node_CustomEvent_Player;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Interaction_C>    K2Node_DynamicCast_AsBPI_Interaction;              // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetInteractDuration_Duration;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerCharacter_C*                K2Node_DynamicCast_AsBP_UPPlayer_Character;        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Interaction_C>    K2Node_DynamicCast_AsBPI_Interaction_1;            // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetInteractText_Text;                     // 0x0078(0x0018)()
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0090(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerController_C*               K2Node_DynamicCast_AsBP_UPPlayer_Controller;       // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Interaction_C_ExecuteUbergraph_W_Interaction) == 0x000008, "Wrong alignment on W_Interaction_C_ExecuteUbergraph_W_Interaction");
static_assert(sizeof(W_Interaction_C_ExecuteUbergraph_W_Interaction) == 0x0000E8, "Wrong size on W_Interaction_C_ExecuteUbergraph_W_Interaction");
static_assert(offsetof(W_Interaction_C_ExecuteUbergraph_W_Interaction, EntryPoint) == 0x000000, "Member 'W_Interaction_C_ExecuteUbergraph_W_Interaction::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Interaction_C_ExecuteUbergraph_W_Interaction, K2Node_CustomEvent_Player) == 0x000008, "Member 'W_Interaction_C_ExecuteUbergraph_W_Interaction::K2Node_CustomEvent_Player' has a wrong offset!");
static_assert(offsetof(W_Interaction_C_ExecuteUbergraph_W_Interaction, K2Node_DynamicCast_AsBPI_Interaction) == 0x000010, "Member 'W_Interaction_C_ExecuteUbergraph_W_Interaction::K2Node_DynamicCast_AsBPI_Interaction' has a wrong offset!");
static_assert(offsetof(W_Interaction_C_ExecuteUbergraph_W_Interaction, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'W_Interaction_C_ExecuteUbergraph_W_Interaction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_Interaction_C_ExecuteUbergraph_W_Interaction, CallFunc_GetInteractDuration_Duration) == 0x000028, "Member 'W_Interaction_C_ExecuteUbergraph_W_Interaction::CallFunc_GetInteractDuration_Duration' has a wrong offset!");
static_assert(offsetof(W_Interaction_C_ExecuteUbergraph_W_Interaction, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'W_Interaction_C_ExecuteUbergraph_W_Interaction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Interaction_C_ExecuteUbergraph_W_Interaction, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000038, "Member 'W_Interaction_C_ExecuteUbergraph_W_Interaction::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Interaction_C_ExecuteUbergraph_W_Interaction, CallFunc_FClamp_ReturnValue) == 0x000040, "Member 'W_Interaction_C_ExecuteUbergraph_W_Interaction::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Interaction_C_ExecuteUbergraph_W_Interaction, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000048, "Member 'W_Interaction_C_ExecuteUbergraph_W_Interaction::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Interaction_C_ExecuteUbergraph_W_Interaction, K2Node_DynamicCast_AsBP_UPPlayer_Character) == 0x000050, "Member 'W_Interaction_C_ExecuteUbergraph_W_Interaction::K2Node_DynamicCast_AsBP_UPPlayer_Character' has a wrong offset!");
static_assert(offsetof(W_Interaction_C_ExecuteUbergraph_W_Interaction, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'W_Interaction_C_ExecuteUbergraph_W_Interaction::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_Interaction_C_ExecuteUbergraph_W_Interaction, K2Node_DynamicCast_AsBPI_Interaction_1) == 0x000060, "Member 'W_Interaction_C_ExecuteUbergraph_W_Interaction::K2Node_DynamicCast_AsBPI_Interaction_1' has a wrong offset!");
static_assert(offsetof(W_Interaction_C_ExecuteUbergraph_W_Interaction, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'W_Interaction_C_ExecuteUbergraph_W_Interaction::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_Interaction_C_ExecuteUbergraph_W_Interaction, CallFunc_IsValid_ReturnValue_1) == 0x000071, "Member 'W_Interaction_C_ExecuteUbergraph_W_Interaction::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Interaction_C_ExecuteUbergraph_W_Interaction, CallFunc_GetInteractText_Text) == 0x000078, "Member 'W_Interaction_C_ExecuteUbergraph_W_Interaction::CallFunc_GetInteractText_Text' has a wrong offset!");
static_assert(offsetof(W_Interaction_C_ExecuteUbergraph_W_Interaction, K2Node_Event_MyGeometry) == 0x000090, "Member 'W_Interaction_C_ExecuteUbergraph_W_Interaction::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Interaction_C_ExecuteUbergraph_W_Interaction, K2Node_Event_InDeltaTime) == 0x0000C8, "Member 'W_Interaction_C_ExecuteUbergraph_W_Interaction::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_Interaction_C_ExecuteUbergraph_W_Interaction, CallFunc_GetPlayerController_ReturnValue) == 0x0000D0, "Member 'W_Interaction_C_ExecuteUbergraph_W_Interaction::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Interaction_C_ExecuteUbergraph_W_Interaction, K2Node_DynamicCast_AsBP_UPPlayer_Controller) == 0x0000D8, "Member 'W_Interaction_C_ExecuteUbergraph_W_Interaction::K2Node_DynamicCast_AsBP_UPPlayer_Controller' has a wrong offset!");
static_assert(offsetof(W_Interaction_C_ExecuteUbergraph_W_Interaction, K2Node_DynamicCast_bSuccess_3) == 0x0000E0, "Member 'W_Interaction_C_ExecuteUbergraph_W_Interaction::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(W_Interaction_C_ExecuteUbergraph_W_Interaction, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x0000E4, "Member 'W_Interaction_C_ExecuteUbergraph_W_Interaction::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function W_Interaction.W_Interaction_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_Interaction_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Interaction_C_Tick) == 0x000004, "Wrong alignment on W_Interaction_C_Tick");
static_assert(sizeof(W_Interaction_C_Tick) == 0x00003C, "Wrong size on W_Interaction_C_Tick");
static_assert(offsetof(W_Interaction_C_Tick, MyGeometry) == 0x000000, "Member 'W_Interaction_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Interaction_C_Tick, InDeltaTime) == 0x000038, "Member 'W_Interaction_C_Tick::InDeltaTime' has a wrong offset!");

// Function W_Interaction.W_Interaction_C.UpdateProgress
// 0x0008 (0x0008 - 0x0000)
struct W_Interaction_C_UpdateProgress final
{
public:
	class ABP_UPPlayerCharacter_C*                Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Interaction_C_UpdateProgress) == 0x000008, "Wrong alignment on W_Interaction_C_UpdateProgress");
static_assert(sizeof(W_Interaction_C_UpdateProgress) == 0x000008, "Wrong size on W_Interaction_C_UpdateProgress");
static_assert(offsetof(W_Interaction_C_UpdateProgress, Player) == 0x000000, "Member 'W_Interaction_C_UpdateProgress::Player' has a wrong offset!");

}

