#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_InputKey

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_InputKey.W_InputKey_C
// 0x0030 (0x02F0 - 0x02C0)
class UW_InputKey_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             ActionText;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             FallbackText;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputAction*                           InputAction;                                       // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerController_C*               PlayerController;                                  // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void SetInputAction(class UInputAction* InputAction_0, const class FText& ActionText_0);
	void UpdateIcon();
	void OnInitialized();
	void ExecuteUbergraph_W_InputKey(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_InputKey_C">();
	}
	static class UW_InputKey_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_InputKey_C>();
	}
};
static_assert(alignof(UW_InputKey_C) == 0x000008, "Wrong alignment on UW_InputKey_C");
static_assert(sizeof(UW_InputKey_C) == 0x0002F0, "Wrong size on UW_InputKey_C");
static_assert(offsetof(UW_InputKey_C, UberGraphFrame) == 0x0002C0, "Member 'UW_InputKey_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_InputKey_C, ActionText) == 0x0002C8, "Member 'UW_InputKey_C::ActionText' has a wrong offset!");
static_assert(offsetof(UW_InputKey_C, FallbackText) == 0x0002D0, "Member 'UW_InputKey_C::FallbackText' has a wrong offset!");
static_assert(offsetof(UW_InputKey_C, Icon) == 0x0002D8, "Member 'UW_InputKey_C::Icon' has a wrong offset!");
static_assert(offsetof(UW_InputKey_C, InputAction) == 0x0002E0, "Member 'UW_InputKey_C::InputAction' has a wrong offset!");
static_assert(offsetof(UW_InputKey_C, PlayerController) == 0x0002E8, "Member 'UW_InputKey_C::PlayerController' has a wrong offset!");

}

