#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LanguageSwitcher

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_LanguageSwitcher.W_LanguageSwitcher_C
// 0x0028 (0x02E8 - 0x02C0)
class UW_LanguageSwitcher_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UComboBoxString*                        LanguageCBox;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayBtnText;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FString>                         Cultures;                                          // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_W_LanguageSwitcher(int32 EntryPoint);
	void LanguageSelected(const class FString& SelectedItem, ESelectInfo SelectionType);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_LanguageSwitcher_C">();
	}
	static class UW_LanguageSwitcher_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_LanguageSwitcher_C>();
	}
};
static_assert(alignof(UW_LanguageSwitcher_C) == 0x000008, "Wrong alignment on UW_LanguageSwitcher_C");
static_assert(sizeof(UW_LanguageSwitcher_C) == 0x0002E8, "Wrong size on UW_LanguageSwitcher_C");
static_assert(offsetof(UW_LanguageSwitcher_C, UberGraphFrame) == 0x0002C0, "Member 'UW_LanguageSwitcher_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_LanguageSwitcher_C, LanguageCBox) == 0x0002C8, "Member 'UW_LanguageSwitcher_C::LanguageCBox' has a wrong offset!");
static_assert(offsetof(UW_LanguageSwitcher_C, PlayBtnText) == 0x0002D0, "Member 'UW_LanguageSwitcher_C::PlayBtnText' has a wrong offset!");
static_assert(offsetof(UW_LanguageSwitcher_C, Cultures) == 0x0002D8, "Member 'UW_LanguageSwitcher_C::Cultures' has a wrong offset!");

}

