#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MainMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_MainMenu.W_MainMenu_C
// 0x0260 (0x0520 - 0x02C0)
class UW_MainMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WelcomeAnim;                                       // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Exit_unhover;                                      // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Exit_hover;                                        // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Audio_unhover;                                     // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Audio_hover;                                       // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Graphics_unhover;                                  // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Graphics_hover;                                    // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Play_UnHover;                                      // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Play_hover;                                        // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                AudioBtn;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AudioBtnText;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackgroundImg;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BlackGradient;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       CheatTextBox;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ControlsBtn;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ControlsBtnText;                                   // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CreditsBtn;                                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CreditsBtn_text;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Discord;                                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                DiscordBtn;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ExitBtn;                                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ExitBtnText;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                GraphicsBtn;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GraphicsBtnText;                                   // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Headliners_logo;                                   // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MessagePanel;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MessagePanelBtn;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MessageText;                                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Options;                                           // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                PlayBtn;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayBtnText;                                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SteamLoginFailedExitBtn;                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SteamLoginFailedExitBtnText;                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SteamLoginFailedOverlay;                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             VersionText;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_AudioTab_C*                          W_AudioTab;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ControlsTab_C*                       W_ControlsTab;                                     // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Credits_C*                           W_Credits;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CurrentSession_C*                    W_CurrentSession;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_GraphicsTab_C*                       W_GraphicsTab;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_LanguageSwitcher_C*                  W_LanguageSwitcher;                                // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnlineTab_C*                         W_OnlineTab;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SplashScreen_C*                      W_SplashScreen;                                    // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                WelcomeBtn;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WelcomeImage;                                      // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           WelcomePanel;                                      // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_UPPlayerController_C*               PlayerController;                                  // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   GameInstance;                                      // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        Tabs;                                              // 0x0448(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWidget*                                VisibleTab;                                        // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInLobby;                                         // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UButton*>                        OptionBtns;                                        // 0x0468(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FString                                 DiscordURL;                                        // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 SteamURL;                                          // 0x0488(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateColor                            OpacityDisabled;                                   // 0x0498(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            OpacityEnabled;                                    // 0x04AC(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          PlaytestRulesChecked;                              // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundCue*                              LobbyMusic;                                        // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        LobbyAudio;                                        // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   KickedMessageText;                                 // 0x04D8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DisconnectionMessageText;                          // 0x04F0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   JoinRequestFailedMessage;                          // 0x0508(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ApplyCheatCommand(const class FText& Command, bool* IsValidCommand, class FString* Output);
	void BndEvt__W_MainMenu_AudioBtn_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_MainMenu_CheatTextBox_K2Node_ComponentBoundEvent_6_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__W_MainMenu_ControlsBtn_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_MainMenu_CreditsBtn_K2Node_ComponentBoundEvent_8_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_MainMenu_DiscordBtn_K2Node_ComponentBoundEvent_5_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_MainMenu_ExitBtn_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_MainMenu_GraphicsBtn_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_MainMenu_MessagePanelBtn_K2Node_ComponentBoundEvent_9_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_MainMenu_OnelineBtn_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_MainMenu_PlaytestRulesStep1Btn_K2Node_ComponentBoundEvent_10_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_MainMenu_SteamLoginFailedExitBtn_K2Node_ComponentBoundEvent_7_OnButtonPressedEvent__DelegateSignature();
	void DisplayTab(class UWidget* Tab);
	void ExecuteUbergraph_W_MainMenu(int32 EntryPoint);
	class UWidget* FocusCurrentSession(EUINavigation Navigation_0);
	class UWidget* FocusLanguageSwitcher(EUINavigation Navigation_0);
	void GamepadUsageChanged(bool IsUsingGamepad);
	void HideAllTabs();
	void HideTab(class UWidget* Tab);
	void InitLobbyMusic();
	void InitMessage();
	void InitSplashScreen();
	void InitTabs();
	void InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void OnInitialized();
	void SetGamepadFocus(class UWidget* Widget);
	void ShowJoinRequestFailedMessage();
	void ShowMessage(const class FText& MessageText_0);
	void ShowWelcomePanel();
	void SplashScreenFinished();
	void StartPlayingMusic();
	void StopPlayingMusic();
	void UpdateFocus();
	void UpdateMusic();
	void VisibilityChanged(ESlateVisibility InVisibility);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_MainMenu_C">();
	}
	static class UW_MainMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_MainMenu_C>();
	}
};
static_assert(alignof(UW_MainMenu_C) == 0x000008, "Wrong alignment on UW_MainMenu_C");
static_assert(sizeof(UW_MainMenu_C) == 0x000520, "Wrong size on UW_MainMenu_C");
static_assert(offsetof(UW_MainMenu_C, UberGraphFrame) == 0x0002C0, "Member 'UW_MainMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, WelcomeAnim) == 0x0002C8, "Member 'UW_MainMenu_C::WelcomeAnim' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Exit_unhover) == 0x0002D0, "Member 'UW_MainMenu_C::Exit_unhover' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Exit_hover) == 0x0002D8, "Member 'UW_MainMenu_C::Exit_hover' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Audio_unhover) == 0x0002E0, "Member 'UW_MainMenu_C::Audio_unhover' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Audio_hover) == 0x0002E8, "Member 'UW_MainMenu_C::Audio_hover' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Graphics_unhover) == 0x0002F0, "Member 'UW_MainMenu_C::Graphics_unhover' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Graphics_hover) == 0x0002F8, "Member 'UW_MainMenu_C::Graphics_hover' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Play_UnHover) == 0x000300, "Member 'UW_MainMenu_C::Play_UnHover' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Play_hover) == 0x000308, "Member 'UW_MainMenu_C::Play_hover' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, AudioBtn) == 0x000310, "Member 'UW_MainMenu_C::AudioBtn' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, AudioBtnText) == 0x000318, "Member 'UW_MainMenu_C::AudioBtnText' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, BackgroundImg) == 0x000320, "Member 'UW_MainMenu_C::BackgroundImg' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, BlackGradient) == 0x000328, "Member 'UW_MainMenu_C::BlackGradient' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, CheatTextBox) == 0x000330, "Member 'UW_MainMenu_C::CheatTextBox' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, ControlsBtn) == 0x000338, "Member 'UW_MainMenu_C::ControlsBtn' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, ControlsBtnText) == 0x000340, "Member 'UW_MainMenu_C::ControlsBtnText' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, CreditsBtn) == 0x000348, "Member 'UW_MainMenu_C::CreditsBtn' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, CreditsBtn_text) == 0x000350, "Member 'UW_MainMenu_C::CreditsBtn_text' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Discord) == 0x000358, "Member 'UW_MainMenu_C::Discord' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, DiscordBtn) == 0x000360, "Member 'UW_MainMenu_C::DiscordBtn' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, ExitBtn) == 0x000368, "Member 'UW_MainMenu_C::ExitBtn' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, ExitBtnText) == 0x000370, "Member 'UW_MainMenu_C::ExitBtnText' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, GraphicsBtn) == 0x000378, "Member 'UW_MainMenu_C::GraphicsBtn' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, GraphicsBtnText) == 0x000380, "Member 'UW_MainMenu_C::GraphicsBtnText' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Headliners_logo) == 0x000388, "Member 'UW_MainMenu_C::Headliners_logo' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, MessagePanel) == 0x000390, "Member 'UW_MainMenu_C::MessagePanel' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, MessagePanelBtn) == 0x000398, "Member 'UW_MainMenu_C::MessagePanelBtn' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, MessageText) == 0x0003A0, "Member 'UW_MainMenu_C::MessageText' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Options) == 0x0003A8, "Member 'UW_MainMenu_C::Options' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, PlayBtn) == 0x0003B0, "Member 'UW_MainMenu_C::PlayBtn' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, PlayBtnText) == 0x0003B8, "Member 'UW_MainMenu_C::PlayBtnText' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, SteamLoginFailedExitBtn) == 0x0003C0, "Member 'UW_MainMenu_C::SteamLoginFailedExitBtn' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, SteamLoginFailedExitBtnText) == 0x0003C8, "Member 'UW_MainMenu_C::SteamLoginFailedExitBtnText' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, SteamLoginFailedOverlay) == 0x0003D0, "Member 'UW_MainMenu_C::SteamLoginFailedOverlay' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, VersionText) == 0x0003D8, "Member 'UW_MainMenu_C::VersionText' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, W_AudioTab) == 0x0003E0, "Member 'UW_MainMenu_C::W_AudioTab' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, W_ControlsTab) == 0x0003E8, "Member 'UW_MainMenu_C::W_ControlsTab' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, W_Credits) == 0x0003F0, "Member 'UW_MainMenu_C::W_Credits' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, W_CurrentSession) == 0x0003F8, "Member 'UW_MainMenu_C::W_CurrentSession' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, W_GraphicsTab) == 0x000400, "Member 'UW_MainMenu_C::W_GraphicsTab' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, W_LanguageSwitcher) == 0x000408, "Member 'UW_MainMenu_C::W_LanguageSwitcher' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, W_OnlineTab) == 0x000410, "Member 'UW_MainMenu_C::W_OnlineTab' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, W_SplashScreen) == 0x000418, "Member 'UW_MainMenu_C::W_SplashScreen' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, WelcomeBtn) == 0x000420, "Member 'UW_MainMenu_C::WelcomeBtn' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, WelcomeImage) == 0x000428, "Member 'UW_MainMenu_C::WelcomeImage' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, WelcomePanel) == 0x000430, "Member 'UW_MainMenu_C::WelcomePanel' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, PlayerController) == 0x000438, "Member 'UW_MainMenu_C::PlayerController' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, GameInstance) == 0x000440, "Member 'UW_MainMenu_C::GameInstance' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Tabs) == 0x000448, "Member 'UW_MainMenu_C::Tabs' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, VisibleTab) == 0x000458, "Member 'UW_MainMenu_C::VisibleTab' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, IsInLobby) == 0x000460, "Member 'UW_MainMenu_C::IsInLobby' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, OptionBtns) == 0x000468, "Member 'UW_MainMenu_C::OptionBtns' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, DiscordURL) == 0x000478, "Member 'UW_MainMenu_C::DiscordURL' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, SteamURL) == 0x000488, "Member 'UW_MainMenu_C::SteamURL' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, OpacityDisabled) == 0x000498, "Member 'UW_MainMenu_C::OpacityDisabled' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, OpacityEnabled) == 0x0004AC, "Member 'UW_MainMenu_C::OpacityEnabled' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, PlaytestRulesChecked) == 0x0004C0, "Member 'UW_MainMenu_C::PlaytestRulesChecked' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, LobbyMusic) == 0x0004C8, "Member 'UW_MainMenu_C::LobbyMusic' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, LobbyAudio) == 0x0004D0, "Member 'UW_MainMenu_C::LobbyAudio' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, KickedMessageText) == 0x0004D8, "Member 'UW_MainMenu_C::KickedMessageText' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, DisconnectionMessageText) == 0x0004F0, "Member 'UW_MainMenu_C::DisconnectionMessageText' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, JoinRequestFailedMessage) == 0x000508, "Member 'UW_MainMenu_C::JoinRequestFailedMessage' has a wrong offset!");

}

