#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MainHUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_MainHUD.W_MainHUD_C
// 0x0078 (0x0338 - 0x02C0)
class UW_MainHUD_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DamageWidget_C*                      W_DamageWidget;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Dialogue_C*                          W_Dialogue;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Emotes_C*                            W_Emotes;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Handicaps_C*                         W_Handicaps;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HealthIndicator_C*                   W_HealthIndicator;                                 // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Interaction_C*                       W_Interaction;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_C*                         W_Inventory;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Microphone_C*                        W_Microphone;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Notifications_C*                     W_Notifications;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Objectives_C*                        W_Objectives;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StaminaBar_C*                        W_StaminaBar;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Statistics_C*                        W_Statistics;                                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_UPPlayerCharacter_C*                LocalPlayer;                                       // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_MainHUD(int32 EntryPoint);
	void GetLocalPlayer(class ABP_UPPlayerCharacter_C** LocalPlayer_0);
	void ShouldInteractionBeVisible(bool* Visible);
	void ShouldInventoryBeVIsible(bool* Visible);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_MainHUD_C">();
	}
	static class UW_MainHUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_MainHUD_C>();
	}
};
static_assert(alignof(UW_MainHUD_C) == 0x000008, "Wrong alignment on UW_MainHUD_C");
static_assert(sizeof(UW_MainHUD_C) == 0x000338, "Wrong size on UW_MainHUD_C");
static_assert(offsetof(UW_MainHUD_C, UberGraphFrame) == 0x0002C0, "Member 'UW_MainHUD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_MainHUD_C, CanvasPanel) == 0x0002C8, "Member 'UW_MainHUD_C::CanvasPanel' has a wrong offset!");
static_assert(offsetof(UW_MainHUD_C, W_DamageWidget) == 0x0002D0, "Member 'UW_MainHUD_C::W_DamageWidget' has a wrong offset!");
static_assert(offsetof(UW_MainHUD_C, W_Dialogue) == 0x0002D8, "Member 'UW_MainHUD_C::W_Dialogue' has a wrong offset!");
static_assert(offsetof(UW_MainHUD_C, W_Emotes) == 0x0002E0, "Member 'UW_MainHUD_C::W_Emotes' has a wrong offset!");
static_assert(offsetof(UW_MainHUD_C, W_Handicaps) == 0x0002E8, "Member 'UW_MainHUD_C::W_Handicaps' has a wrong offset!");
static_assert(offsetof(UW_MainHUD_C, W_HealthIndicator) == 0x0002F0, "Member 'UW_MainHUD_C::W_HealthIndicator' has a wrong offset!");
static_assert(offsetof(UW_MainHUD_C, W_Interaction) == 0x0002F8, "Member 'UW_MainHUD_C::W_Interaction' has a wrong offset!");
static_assert(offsetof(UW_MainHUD_C, W_Inventory) == 0x000300, "Member 'UW_MainHUD_C::W_Inventory' has a wrong offset!");
static_assert(offsetof(UW_MainHUD_C, W_Microphone) == 0x000308, "Member 'UW_MainHUD_C::W_Microphone' has a wrong offset!");
static_assert(offsetof(UW_MainHUD_C, W_Notifications) == 0x000310, "Member 'UW_MainHUD_C::W_Notifications' has a wrong offset!");
static_assert(offsetof(UW_MainHUD_C, W_Objectives) == 0x000318, "Member 'UW_MainHUD_C::W_Objectives' has a wrong offset!");
static_assert(offsetof(UW_MainHUD_C, W_StaminaBar) == 0x000320, "Member 'UW_MainHUD_C::W_StaminaBar' has a wrong offset!");
static_assert(offsetof(UW_MainHUD_C, W_Statistics) == 0x000328, "Member 'UW_MainHUD_C::W_Statistics' has a wrong offset!");
static_assert(offsetof(UW_MainHUD_C, LocalPlayer) == 0x000330, "Member 'UW_MainHUD_C::LocalPlayer' has a wrong offset!");

}

