#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Notifications

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Notifications.W_Notifications_C.ExecuteUbergraph_W_Notifications
// 0x0030 (0x0030 - 0x0000)
struct W_Notifications_C_ExecuteUbergraph_W_Notifications final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Notification_C*                      CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Notification;                   // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Duration;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Notifications_C_ExecuteUbergraph_W_Notifications) == 0x000008, "Wrong alignment on W_Notifications_C_ExecuteUbergraph_W_Notifications");
static_assert(sizeof(W_Notifications_C_ExecuteUbergraph_W_Notifications) == 0x000030, "Wrong size on W_Notifications_C_ExecuteUbergraph_W_Notifications");
static_assert(offsetof(W_Notifications_C_ExecuteUbergraph_W_Notifications, EntryPoint) == 0x000000, "Member 'W_Notifications_C_ExecuteUbergraph_W_Notifications::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Notifications_C_ExecuteUbergraph_W_Notifications, CallFunc_Create_ReturnValue) == 0x000008, "Member 'W_Notifications_C_ExecuteUbergraph_W_Notifications::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Notifications_C_ExecuteUbergraph_W_Notifications, K2Node_CustomEvent_Notification) == 0x000010, "Member 'W_Notifications_C_ExecuteUbergraph_W_Notifications::K2Node_CustomEvent_Notification' has a wrong offset!");
static_assert(offsetof(W_Notifications_C_ExecuteUbergraph_W_Notifications, K2Node_CustomEvent_Duration) == 0x000020, "Member 'W_Notifications_C_ExecuteUbergraph_W_Notifications::K2Node_CustomEvent_Duration' has a wrong offset!");
static_assert(offsetof(W_Notifications_C_ExecuteUbergraph_W_Notifications, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000028, "Member 'W_Notifications_C_ExecuteUbergraph_W_Notifications::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function W_Notifications.W_Notifications_C.ShouldShowPlayerNotification
// 0x0028 (0x0028 - 0x0000)
struct W_Notifications_C_ShouldShowPlayerNotification final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                K2Node_DynamicCast_AsBP_UPPlayer_Character;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Notifications_C_ShouldShowPlayerNotification) == 0x000008, "Wrong alignment on W_Notifications_C_ShouldShowPlayerNotification");
static_assert(sizeof(W_Notifications_C_ShouldShowPlayerNotification) == 0x000028, "Wrong size on W_Notifications_C_ShouldShowPlayerNotification");
static_assert(offsetof(W_Notifications_C_ShouldShowPlayerNotification, Result) == 0x000000, "Member 'W_Notifications_C_ShouldShowPlayerNotification::Result' has a wrong offset!");
static_assert(offsetof(W_Notifications_C_ShouldShowPlayerNotification, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'W_Notifications_C_ShouldShowPlayerNotification::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Notifications_C_ShouldShowPlayerNotification, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'W_Notifications_C_ShouldShowPlayerNotification::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Notifications_C_ShouldShowPlayerNotification, K2Node_DynamicCast_AsBP_UPPlayer_Character) == 0x000018, "Member 'W_Notifications_C_ShouldShowPlayerNotification::K2Node_DynamicCast_AsBP_UPPlayer_Character' has a wrong offset!");
static_assert(offsetof(W_Notifications_C_ShouldShowPlayerNotification, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'W_Notifications_C_ShouldShowPlayerNotification::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_Notifications_C_ShouldShowPlayerNotification, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'W_Notifications_C_ShouldShowPlayerNotification::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function W_Notifications.W_Notifications_C.ShowNotification
// 0x0018 (0x0018 - 0x0000)
struct W_Notifications_C_ShowNotification final
{
public:
	class FString                                 Notification;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	double                                        Duration;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Notifications_C_ShowNotification) == 0x000008, "Wrong alignment on W_Notifications_C_ShowNotification");
static_assert(sizeof(W_Notifications_C_ShowNotification) == 0x000018, "Wrong size on W_Notifications_C_ShowNotification");
static_assert(offsetof(W_Notifications_C_ShowNotification, Notification) == 0x000000, "Member 'W_Notifications_C_ShowNotification::Notification' has a wrong offset!");
static_assert(offsetof(W_Notifications_C_ShowNotification, Duration) == 0x000010, "Member 'W_Notifications_C_ShowNotification::Duration' has a wrong offset!");

}

