#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Notification

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Notification.W_Notification_C.ExecuteUbergraph_W_Notification
// 0x0040 (0x0040 - 0x0000)
struct W_Notification_C_ExecuteUbergraph_W_Notification final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Notification;                   // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Duration;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Notification_C_ExecuteUbergraph_W_Notification) == 0x000008, "Wrong alignment on W_Notification_C_ExecuteUbergraph_W_Notification");
static_assert(sizeof(W_Notification_C_ExecuteUbergraph_W_Notification) == 0x000040, "Wrong size on W_Notification_C_ExecuteUbergraph_W_Notification");
static_assert(offsetof(W_Notification_C_ExecuteUbergraph_W_Notification, EntryPoint) == 0x000000, "Member 'W_Notification_C_ExecuteUbergraph_W_Notification::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Notification_C_ExecuteUbergraph_W_Notification, K2Node_CustomEvent_Notification) == 0x000008, "Member 'W_Notification_C_ExecuteUbergraph_W_Notification::K2Node_CustomEvent_Notification' has a wrong offset!");
static_assert(offsetof(W_Notification_C_ExecuteUbergraph_W_Notification, K2Node_CustomEvent_Duration) == 0x000018, "Member 'W_Notification_C_ExecuteUbergraph_W_Notification::K2Node_CustomEvent_Duration' has a wrong offset!");
static_assert(offsetof(W_Notification_C_ExecuteUbergraph_W_Notification, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'W_Notification_C_ExecuteUbergraph_W_Notification::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Notification_C_ExecuteUbergraph_W_Notification, CallFunc_Delay_Duration_ImplicitCast) == 0x000038, "Member 'W_Notification_C_ExecuteUbergraph_W_Notification::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function W_Notification.W_Notification_C.InitNotification
// 0x0018 (0x0018 - 0x0000)
struct W_Notification_C_InitNotification final
{
public:
	class FString                                 Notification;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	double                                        Duration;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Notification_C_InitNotification) == 0x000008, "Wrong alignment on W_Notification_C_InitNotification");
static_assert(sizeof(W_Notification_C_InitNotification) == 0x000018, "Wrong size on W_Notification_C_InitNotification");
static_assert(offsetof(W_Notification_C_InitNotification, Notification) == 0x000000, "Member 'W_Notification_C_InitNotification::Notification' has a wrong offset!");
static_assert(offsetof(W_Notification_C_InitNotification, Duration) == 0x000010, "Member 'W_Notification_C_InitNotification::Duration' has a wrong offset!");

}

