#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OnlineTab

#include "Basic.hpp"

#include "SteamIntegrationKit_structs.hpp"
#include "SlateCore_structs.hpp"
#include "S_FindSessionsResult_structs.hpp"
#include "S_OnlineSession_structs.hpp"


namespace SDK::Params
{

// Function W_OnlineTab.W_OnlineTab_C.BndEvt__W_OnlineTab_DistanceQBox_K2Node_ComponentBoundEvent_10_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_OnlineTab_C_BndEvt__W_OnlineTab_DistanceQBox_K2Node_ComponentBoundEvent_10_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OnlineTab_C_BndEvt__W_OnlineTab_DistanceQBox_K2Node_ComponentBoundEvent_10_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on W_OnlineTab_C_BndEvt__W_OnlineTab_DistanceQBox_K2Node_ComponentBoundEvent_10_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(W_OnlineTab_C_BndEvt__W_OnlineTab_DistanceQBox_K2Node_ComponentBoundEvent_10_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on W_OnlineTab_C_BndEvt__W_OnlineTab_DistanceQBox_K2Node_ComponentBoundEvent_10_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(W_OnlineTab_C_BndEvt__W_OnlineTab_DistanceQBox_K2Node_ComponentBoundEvent_10_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'W_OnlineTab_C_BndEvt__W_OnlineTab_DistanceQBox_K2Node_ComponentBoundEvent_10_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_BndEvt__W_OnlineTab_DistanceQBox_K2Node_ComponentBoundEvent_10_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'W_OnlineTab_C_BndEvt__W_OnlineTab_DistanceQBox_K2Node_ComponentBoundEvent_10_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function W_OnlineTab.W_OnlineTab_C.BndEvt__W_OnlineTab_IncludeCustomGamesQBox_K2Node_ComponentBoundEvent_11_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_OnlineTab_C_BndEvt__W_OnlineTab_IncludeCustomGamesQBox_K2Node_ComponentBoundEvent_11_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OnlineTab_C_BndEvt__W_OnlineTab_IncludeCustomGamesQBox_K2Node_ComponentBoundEvent_11_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on W_OnlineTab_C_BndEvt__W_OnlineTab_IncludeCustomGamesQBox_K2Node_ComponentBoundEvent_11_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(W_OnlineTab_C_BndEvt__W_OnlineTab_IncludeCustomGamesQBox_K2Node_ComponentBoundEvent_11_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on W_OnlineTab_C_BndEvt__W_OnlineTab_IncludeCustomGamesQBox_K2Node_ComponentBoundEvent_11_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(W_OnlineTab_C_BndEvt__W_OnlineTab_IncludeCustomGamesQBox_K2Node_ComponentBoundEvent_11_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'W_OnlineTab_C_BndEvt__W_OnlineTab_IncludeCustomGamesQBox_K2Node_ComponentBoundEvent_11_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function W_OnlineTab.W_OnlineTab_C.BndEvt__W_OnlineTab_W_CustomGame_K2Node_ComponentBoundEvent_12_OnCustomGameCreated__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_OnlineTab_C_BndEvt__W_OnlineTab_W_CustomGame_K2Node_ComponentBoundEvent_12_OnCustomGameCreated__DelegateSignature final
{
public:
	bool                                          FriendsOnly;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OnlineTab_C_BndEvt__W_OnlineTab_W_CustomGame_K2Node_ComponentBoundEvent_12_OnCustomGameCreated__DelegateSignature) == 0x000001, "Wrong alignment on W_OnlineTab_C_BndEvt__W_OnlineTab_W_CustomGame_K2Node_ComponentBoundEvent_12_OnCustomGameCreated__DelegateSignature");
static_assert(sizeof(W_OnlineTab_C_BndEvt__W_OnlineTab_W_CustomGame_K2Node_ComponentBoundEvent_12_OnCustomGameCreated__DelegateSignature) == 0x000001, "Wrong size on W_OnlineTab_C_BndEvt__W_OnlineTab_W_CustomGame_K2Node_ComponentBoundEvent_12_OnCustomGameCreated__DelegateSignature");
static_assert(offsetof(W_OnlineTab_C_BndEvt__W_OnlineTab_W_CustomGame_K2Node_ComponentBoundEvent_12_OnCustomGameCreated__DelegateSignature, FriendsOnly) == 0x000000, "Member 'W_OnlineTab_C_BndEvt__W_OnlineTab_W_CustomGame_K2Node_ComponentBoundEvent_12_OnCustomGameCreated__DelegateSignature::FriendsOnly' has a wrong offset!");

// Function W_OnlineTab.W_OnlineTab_C.CheckCustomSave
// 0x0008 (0x0008 - 0x0000)
struct W_OnlineTab_C_CheckCustomSave final
{
public:
	class UW_SessionSaveSlot_C*                   SelectedSaveSlot;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OnlineTab_C_CheckCustomSave) == 0x000008, "Wrong alignment on W_OnlineTab_C_CheckCustomSave");
static_assert(sizeof(W_OnlineTab_C_CheckCustomSave) == 0x000008, "Wrong size on W_OnlineTab_C_CheckCustomSave");
static_assert(offsetof(W_OnlineTab_C_CheckCustomSave, SelectedSaveSlot) == 0x000000, "Member 'W_OnlineTab_C_CheckCustomSave::SelectedSaveSlot' has a wrong offset!");

// Function W_OnlineTab.W_OnlineTab_C.DeleteSessionSaveSlot
// 0x0008 (0x0008 - 0x0000)
struct W_OnlineTab_C_DeleteSessionSaveSlot final
{
public:
	class UW_SessionSaveSlot_C*                   SessionSaveSlot;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OnlineTab_C_DeleteSessionSaveSlot) == 0x000008, "Wrong alignment on W_OnlineTab_C_DeleteSessionSaveSlot");
static_assert(sizeof(W_OnlineTab_C_DeleteSessionSaveSlot) == 0x000008, "Wrong size on W_OnlineTab_C_DeleteSessionSaveSlot");
static_assert(offsetof(W_OnlineTab_C_DeleteSessionSaveSlot, SessionSaveSlot) == 0x000000, "Member 'W_OnlineTab_C_DeleteSessionSaveSlot::SessionSaveSlot' has a wrong offset!");

// Function W_OnlineTab.W_OnlineTab_C.ExecuteUbergraph_W_OnlineTab
// 0x0278 (0x0278 - 0x0000)
struct W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_FindSessionsResult                  K2Node_CustomEvent_Sessions;                       // 0x0038(0x0010)(HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_FocusOpenSessions_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_MainMenu_C*                          K2Node_Event_MainMenu;                             // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPGameState_C*                      K2Node_DynamicCast_AsBP_UPGame_State;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UW_SessionSaveSlot_C*>           K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_SessionSaveSlot_C*                   K2Node_CustomEvent_SessionSaveSlot_1;              // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_SessionSaveSlot_C*                   K2Node_CustomEvent_SessionSaveSlot;                // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadCustomGameConfig_IsCustomGame;        // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_SessionSaveSlot_C*                   CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_SessionSaveSlot_C*                   CallFunc_Array_Get_Item_1;                         // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Duration;                       // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_OpenSession_C*                       K2Node_CustomEvent_OpenSession;                    // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_OpenSession_C*                       CallFunc_Create_ReturnValue;                       // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_OpenSession_C*                       CallFunc_Array_Get_Item_2;                         // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSessionName_SessionName;               // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item_3;                         // 0x0140(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESIK_LobbyDistanceFilter                      CallFunc_GetSelectedDistanceFilter_DistanceFilter; // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18E[0x2];                                      // 0x018E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDistanceOptionIndex_Index;             // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_SessionSaveSlot_C*                   CallFunc_Array_Get_Item_4;                         // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_FriendsOnly;            // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_SessionSaveSlot_C*                   K2Node_CustomEvent_SelectedSaveSlot;               // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSessionName_SessionName_1;             // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_OnlineSession                       CallFunc_Array_Get_Item_5;                         // 0x01C8(0x0028)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class UW_OpenSession_C* OpenSession)> K2Node_CreateDelegate_OutputDelegate;       // 0x01F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UW_SessionSaveSlot_C* SessionSaveSlot)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0200(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0210(0x0018)()
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UW_SessionSaveSlot_C* SessionSaveSlot)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0234(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_SessionSaveSlot_C*                   CallFunc_Array_Get_Item_6;                         // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_SessionSaveSlot_C*                   CallFunc_Array_Get_Item_7;                         // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FS_FindSessionsResult& Sessions)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0260(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue_1;                  // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_272[0x2];                                      // 0x0272(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RetriggerableDelay_Duration_ImplicitCast; // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab) == 0x000008, "Wrong alignment on W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab");
static_assert(sizeof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab) == 0x000278, "Wrong size on W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, EntryPoint) == 0x000000, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, K2Node_DynamicCast_AsBP_UPGame_Instance) == 0x000010, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::K2Node_DynamicCast_AsBP_UPGame_Instance' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, Temp_int_Array_Index_Variable) == 0x000020, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, K2Node_CustomEvent_Sessions) == 0x000038, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::K2Node_CustomEvent_Sessions' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Array_Length_ReturnValue_1) == 0x000050, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Array_IsEmpty_ReturnValue) == 0x000054, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_FocusOpenSessions_ReturnValue) == 0x000058, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_FocusOpenSessions_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, K2Node_Event_MainMenu) == 0x000060, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::K2Node_Event_MainMenu' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_GetGameState_ReturnValue) == 0x000068, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, K2Node_DynamicCast_AsBP_UPGame_State) == 0x000070, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::K2Node_DynamicCast_AsBP_UPGame_State' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_IsChecked_ReturnValue) == 0x000079, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_IsChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, Temp_int_Loop_Counter_Variable_1) == 0x00007C, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, K2Node_MakeArray_Array) == 0x000080, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Add_IntInt_ReturnValue_1) == 0x000090, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, K2Node_CustomEvent_SessionSaveSlot_1) == 0x000098, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::K2Node_CustomEvent_SessionSaveSlot_1' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, Temp_int_Array_Index_Variable_1) == 0x0000A0, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000A4, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, K2Node_CustomEvent_SessionSaveSlot) == 0x0000A8, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::K2Node_CustomEvent_SessionSaveSlot' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, Temp_int_Array_Index_Variable_2) == 0x0000B0, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Array_Length_ReturnValue_2) == 0x0000B4, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_LoadCustomGameConfig_IsCustomGame) == 0x0000B8, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_LoadCustomGameConfig_IsCustomGame' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000BC, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Array_Get_Item_1) == 0x0000C8, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Array_Length_ReturnValue_3) == 0x0000D0, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, K2Node_CustomEvent_Duration) == 0x0000D8, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::K2Node_CustomEvent_Duration' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, Temp_int_Loop_Counter_Variable_2) == 0x0000E0, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Less_IntInt_ReturnValue) == 0x0000E4, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000E8, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, K2Node_CustomEvent_OpenSession) == 0x0000F0, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::K2Node_CustomEvent_OpenSession' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Create_ReturnValue) == 0x0000F8, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, Temp_int_Array_Index_Variable_3) == 0x000100, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Array_Add_ReturnValue) == 0x000104, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Array_Get_Item_2) == 0x000108, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000110, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, K2Node_ComponentBoundEvent_SelectedItem) == 0x000118, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, K2Node_ComponentBoundEvent_SelectionType) == 0x000128, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000129, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_GetSessionName_SessionName) == 0x000130, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_GetSessionName_SessionName' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Array_Get_Item_3) == 0x000140, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Array_Length_ReturnValue_4) == 0x000158, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Conv_TextToString_ReturnValue) == 0x000160, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Less_IntInt_ReturnValue_1) == 0x000170, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, Temp_int_Loop_Counter_Variable_3) == 0x000174, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, Temp_int_Loop_Counter_Variable_4) == 0x000178, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Less_IntInt_ReturnValue_2) == 0x00017C, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Add_IntInt_ReturnValue_4) == 0x000180, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Less_IntInt_ReturnValue_3) == 0x000184, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Add_IntInt_ReturnValue_5) == 0x000188, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_GetSelectedDistanceFilter_DistanceFilter) == 0x00018C, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_GetSelectedDistanceFilter_DistanceFilter' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x00018D, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_GetDistanceOptionIndex_Index) == 0x000190, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_GetDistanceOptionIndex_Index' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, Temp_int_Array_Index_Variable_4) == 0x000194, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Array_Get_Item_4) == 0x000198, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001A0, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, K2Node_ComponentBoundEvent_FriendsOnly) == 0x0001A1, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::K2Node_ComponentBoundEvent_FriendsOnly' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, K2Node_CustomEvent_SelectedSaveSlot) == 0x0001A8, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::K2Node_CustomEvent_SelectedSaveSlot' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_GetSessionName_SessionName_1) == 0x0001B0, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_GetSessionName_SessionName_1' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, Temp_int_Array_Index_Variable_5) == 0x0001C0, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Array_Get_Item_5) == 0x0001C8, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, K2Node_CreateDelegate_OutputDelegate) == 0x0001F0, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, K2Node_CreateDelegate_OutputDelegate_1) == 0x000200, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_GetEmptyText_ReturnValue) == 0x000210, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, Temp_int_Loop_Counter_Variable_5) == 0x000228, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Less_IntInt_ReturnValue_4) == 0x00022C, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Add_IntInt_ReturnValue_6) == 0x000230, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, K2Node_CreateDelegate_OutputDelegate_2) == 0x000234, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Array_Get_Item_6) == 0x000248, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Array_Get_Item_7) == 0x000250, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Array_Length_ReturnValue_5) == 0x000258, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_Less_IntInt_ReturnValue_5) == 0x00025C, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, K2Node_CreateDelegate_OutputDelegate_3) == 0x000260, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, K2Node_ComponentBoundEvent_bIsChecked) == 0x000270, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_IsChecked_ReturnValue_1) == 0x000271, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_IsChecked_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab, CallFunc_RetriggerableDelay_Duration_ImplicitCast) == 0x000274, "Member 'W_OnlineTab_C_ExecuteUbergraph_W_OnlineTab::CallFunc_RetriggerableDelay_Duration_ImplicitCast' has a wrong offset!");

// Function W_OnlineTab.W_OnlineTab_C.FocusOpenSessions
// 0x0038 (0x0038 - 0x0000)
struct W_OnlineTab_C_FocusOpenSessions final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_OpenSession_C*                       CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_OpenSession_C*                       CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OnlineTab_C_FocusOpenSessions) == 0x000008, "Wrong alignment on W_OnlineTab_C_FocusOpenSessions");
static_assert(sizeof(W_OnlineTab_C_FocusOpenSessions) == 0x000038, "Wrong size on W_OnlineTab_C_FocusOpenSessions");
static_assert(offsetof(W_OnlineTab_C_FocusOpenSessions, Navigation_0) == 0x000000, "Member 'W_OnlineTab_C_FocusOpenSessions::Navigation_0' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_FocusOpenSessions, ReturnValue) == 0x000008, "Member 'W_OnlineTab_C_FocusOpenSessions::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_FocusOpenSessions, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'W_OnlineTab_C_FocusOpenSessions::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_FocusOpenSessions, CallFunc_Array_Get_Item) == 0x000018, "Member 'W_OnlineTab_C_FocusOpenSessions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_FocusOpenSessions, CallFunc_Array_LastIndex_ReturnValue) == 0x000020, "Member 'W_OnlineTab_C_FocusOpenSessions::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_FocusOpenSessions, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'W_OnlineTab_C_FocusOpenSessions::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_FocusOpenSessions, CallFunc_Array_IsEmpty_ReturnValue) == 0x000030, "Member 'W_OnlineTab_C_FocusOpenSessions::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");

// Function W_OnlineTab.W_OnlineTab_C.FocusOtherSession
// 0x0048 (0x0048 - 0x0000)
struct W_OnlineTab_C_FocusOtherSession final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSessionInFocus_SessionIndex;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_OpenSession_C*                       CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_OpenSession_C*                       CallFunc_Array_Get_Item_1;                         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OnlineTab_C_FocusOtherSession) == 0x000008, "Wrong alignment on W_OnlineTab_C_FocusOtherSession");
static_assert(sizeof(W_OnlineTab_C_FocusOtherSession) == 0x000048, "Wrong size on W_OnlineTab_C_FocusOtherSession");
static_assert(offsetof(W_OnlineTab_C_FocusOtherSession, Navigation_0) == 0x000000, "Member 'W_OnlineTab_C_FocusOtherSession::Navigation_0' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_FocusOtherSession, ReturnValue) == 0x000008, "Member 'W_OnlineTab_C_FocusOtherSession::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_FocusOtherSession, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'W_OnlineTab_C_FocusOtherSession::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_FocusOtherSession, CallFunc_Array_LastIndex_ReturnValue) == 0x000014, "Member 'W_OnlineTab_C_FocusOtherSession::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_FocusOtherSession, CallFunc_GetSessionInFocus_SessionIndex) == 0x000018, "Member 'W_OnlineTab_C_FocusOtherSession::CallFunc_GetSessionInFocus_SessionIndex' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_FocusOtherSession, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00001C, "Member 'W_OnlineTab_C_FocusOtherSession::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_FocusOtherSession, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'W_OnlineTab_C_FocusOtherSession::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_FocusOtherSession, CallFunc_Array_Get_Item) == 0x000028, "Member 'W_OnlineTab_C_FocusOtherSession::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_FocusOtherSession, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'W_OnlineTab_C_FocusOtherSession::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_FocusOtherSession, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'W_OnlineTab_C_FocusOtherSession::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_FocusOtherSession, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'W_OnlineTab_C_FocusOtherSession::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_FocusOtherSession, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'W_OnlineTab_C_FocusOtherSession::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function W_OnlineTab.W_OnlineTab_C.GetDistanceOptionIndex
// 0x000C (0x000C - 0x0000)
struct W_OnlineTab_C_GetDistanceOptionIndex final
{
public:
	ESIK_LobbyDistanceFilter                      DistanceFilter_0;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_0;                                           // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OnlineTab_C_GetDistanceOptionIndex) == 0x000004, "Wrong alignment on W_OnlineTab_C_GetDistanceOptionIndex");
static_assert(sizeof(W_OnlineTab_C_GetDistanceOptionIndex) == 0x00000C, "Wrong size on W_OnlineTab_C_GetDistanceOptionIndex");
static_assert(offsetof(W_OnlineTab_C_GetDistanceOptionIndex, DistanceFilter_0) == 0x000000, "Member 'W_OnlineTab_C_GetDistanceOptionIndex::DistanceFilter_0' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_GetDistanceOptionIndex, Index_0) == 0x000004, "Member 'W_OnlineTab_C_GetDistanceOptionIndex::Index_0' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_GetDistanceOptionIndex, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'W_OnlineTab_C_GetDistanceOptionIndex::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function W_OnlineTab.W_OnlineTab_C.GetSelectedDistanceFilter
// 0x000C (0x000C - 0x0000)
struct W_OnlineTab_C_GetSelectedDistanceFilter final
{
public:
	ESIK_LobbyDistanceFilter                      DistanceFilter_0;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedIndex_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OnlineTab_C_GetSelectedDistanceFilter) == 0x000004, "Wrong alignment on W_OnlineTab_C_GetSelectedDistanceFilter");
static_assert(sizeof(W_OnlineTab_C_GetSelectedDistanceFilter) == 0x00000C, "Wrong size on W_OnlineTab_C_GetSelectedDistanceFilter");
static_assert(offsetof(W_OnlineTab_C_GetSelectedDistanceFilter, DistanceFilter_0) == 0x000000, "Member 'W_OnlineTab_C_GetSelectedDistanceFilter::DistanceFilter_0' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_GetSelectedDistanceFilter, CallFunc_GetSelectedIndex_ReturnValue) == 0x000004, "Member 'W_OnlineTab_C_GetSelectedDistanceFilter::CallFunc_GetSelectedIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_GetSelectedDistanceFilter, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'W_OnlineTab_C_GetSelectedDistanceFilter::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OnlineTab_C_GetSelectedDistanceFilter, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000009, "Member 'W_OnlineTab_C_GetSelectedDistanceFilter::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function W_OnlineTab.W_OnlineTab_C.GetSessionInFocus
// 0x0028 (0x0028 - 0x0000)
struct W_OnlineTab_C_GetSessionInFocus final
{
public:
	int32                                         SessionIndex;                                      // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_OpenSession_C*                       CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasFocus_Focus;                           // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
