#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OpenSession

#include "Basic.hpp"

#include "S_OnlineSession_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_OpenSession.W_OpenSession_C.ExecuteUbergraph_W_OpenSession
// 0x0328 (0x0328 - 0x0000)
struct W_OpenSession_C_ExecuteUbergraph_W_OpenSession final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0050)(HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_CustomEvent_GameInstance;                   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_OnlineSession                       K2Node_CustomEvent_Session;                        // 0x0060(0x0028)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSessionFull_IsFull;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0098(0x0050)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_2;            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00F8(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0148(0x0050)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_3;            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01A0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x01B8(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0208(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0258(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0270(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x0280(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x02D0(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x02E8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x02F8(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0310(0x0018)()
};
static_assert(alignof(W_OpenSession_C_ExecuteUbergraph_W_OpenSession) == 0x000008, "Wrong alignment on W_OpenSession_C_ExecuteUbergraph_W_OpenSession");
static_assert(sizeof(W_OpenSession_C_ExecuteUbergraph_W_OpenSession) == 0x000328, "Wrong size on W_OpenSession_C_ExecuteUbergraph_W_OpenSession");
static_assert(offsetof(W_OpenSession_C_ExecuteUbergraph_W_OpenSession, EntryPoint) == 0x000000, "Member 'W_OpenSession_C_ExecuteUbergraph_W_OpenSession::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_OpenSession_C_ExecuteUbergraph_W_OpenSession, Temp_bool_Variable) == 0x000004, "Member 'W_OpenSession_C_ExecuteUbergraph_W_OpenSession::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_OpenSession_C_ExecuteUbergraph_W_OpenSession, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'W_OpenSession_C_ExecuteUbergraph_W_OpenSession::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_OpenSession_C_ExecuteUbergraph_W_OpenSession, K2Node_CustomEvent_GameInstance) == 0x000058, "Member 'W_OpenSession_C_ExecuteUbergraph_W_OpenSession::K2Node_CustomEvent_GameInstance' has a wrong offset!");
static_assert(offsetof(W_OpenSession_C_ExecuteUbergraph_W_OpenSession, K2Node_CustomEvent_Session) == 0x000060, "Member 'W_OpenSession_C_ExecuteUbergraph_W_OpenSession::K2Node_CustomEvent_Session' has a wrong offset!");
static_assert(offsetof(W_OpenSession_C_ExecuteUbergraph_W_OpenSession, CallFunc_IsSessionFull_IsFull) == 0x000088, "Member 'W_OpenSession_C_ExecuteUbergraph_W_OpenSession::CallFunc_IsSessionFull_IsFull' has a wrong offset!");
static_assert(offsetof(W_OpenSession_C_ExecuteUbergraph_W_OpenSession, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000090, "Member 'W_OpenSession_C_ExecuteUbergraph_W_OpenSession::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OpenSession_C_ExecuteUbergraph_W_OpenSession, K2Node_MakeStruct_FormatArgumentData_1) == 0x000098, "Member 'W_OpenSession_C_ExecuteUbergraph_W_OpenSession::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_OpenSession_C_ExecuteUbergraph_W_OpenSession, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0000E8, "Member 'W_OpenSession_C_ExecuteUbergraph_W_OpenSession::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_OpenSession_C_ExecuteUbergraph_W_OpenSession, CallFunc_Conv_IntToInt64_ReturnValue_2) == 0x0000F0, "Member 'W_OpenSession_C_ExecuteUbergraph_W_OpenSession::CallFunc_Conv_IntToInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_OpenSession_C_ExecuteUbergraph_W_OpenSession, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000F8, "Member 'W_OpenSession_C_ExecuteUbergraph_W_OpenSession::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(W_OpenSession_C_ExecuteUbergraph_W_OpenSession, K2Node_MakeStruct_FormatArgumentData_3) == 0x000148, "Member 'W_OpenSession_C_ExecuteUbergraph_W_OpenSession::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(W_OpenSession_C_ExecuteUbergraph_W_OpenSession, CallFunc_Conv_IntToInt64_ReturnValue_3) == 0x000198, "Member 'W_OpenSession_C_ExecuteUbergraph_W_OpenSession::CallFunc_Conv_IntToInt64_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_OpenSession_C_ExecuteUbergraph_W_OpenSession, CallFunc_Conv_StringToText_ReturnValue) == 0x0001A0, "Member 'W_OpenSession_C_ExecuteUbergraph_W_OpenSession::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OpenSession_C_ExecuteUbergraph_W_OpenSession, K2Node_MakeStruct_FormatArgumentData_4) == 0x0001B8, "Member 'W_OpenSession_C_ExecuteUbergraph_W_OpenSession::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(W_OpenSession_C_ExecuteUbergraph_W_OpenSession, K2Node_MakeStruct_FormatArgumentData_5) == 0x000208, "Member 'W_OpenSession_C_ExecuteUbergraph_W_OpenSession::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(W_OpenSession_C_ExecuteUbergraph_W_OpenSession, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000258, "Member 'W_OpenSession_C_ExecuteUbergraph_W_OpenSession::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_OpenSession_C_ExecuteUbergraph_W_OpenSession, K2Node_MakeArray_Array) == 0x000270, "Member 'W_OpenSession_C_ExecuteUbergraph_W_OpenSession::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_OpenSession_C_ExecuteUbergraph_W_OpenSession, K2Node_MakeStruct_FormatArgumentData_6) == 0x000280, "Member 'W_OpenSession_C_ExecuteUbergraph_W_OpenSession::K2Node_MakeStruct_FormatArgumentData_6' has a wrong offset!");
static_assert(offsetof(W_OpenSession_C_ExecuteUbergraph_W_OpenSession, CallFunc_Format_ReturnValue) == 0x0002D0, "Member 'W_OpenSession_C_ExecuteUbergraph_W_OpenSession::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OpenSession_C_ExecuteUbergraph_W_OpenSession, K2Node_MakeArray_Array_1) == 0x0002E8, "Member 'W_OpenSession_C_ExecuteUbergraph_W_OpenSession::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_OpenSession_C_ExecuteUbergraph_W_OpenSession, CallFunc_Format_ReturnValue_1) == 0x0002F8, "Member 'W_OpenSession_C_ExecuteUbergraph_W_OpenSession::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_OpenSession_C_ExecuteUbergraph_W_OpenSession, K2Node_Select_Default) == 0x000310, "Member 'W_OpenSession_C_ExecuteUbergraph_W_OpenSession::K2Node_Select_Default' has a wrong offset!");

// Function W_OpenSession.W_OpenSession_C.HasFocus
// 0x0002 (0x0002 - 0x0000)
struct W_OpenSession_C_HasFocus final
{
public:
	bool                                          Focus;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasKeyboardFocus_ReturnValue;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OpenSession_C_HasFocus) == 0x000001, "Wrong alignment on W_OpenSession_C_HasFocus");
static_assert(sizeof(W_OpenSession_C_HasFocus) == 0x000002, "Wrong size on W_OpenSession_C_HasFocus");
static_assert(offsetof(W_OpenSession_C_HasFocus, Focus) == 0x000000, "Member 'W_OpenSession_C_HasFocus::Focus' has a wrong offset!");
static_assert(offsetof(W_OpenSession_C_HasFocus, CallFunc_HasKeyboardFocus_ReturnValue) == 0x000001, "Member 'W_OpenSession_C_HasFocus::CallFunc_HasKeyboardFocus_ReturnValue' has a wrong offset!");

// Function W_OpenSession.W_OpenSession_C.InitOpenSession
// 0x0030 (0x0030 - 0x0000)
struct W_OpenSession_C_InitOpenSession final
{
public:
	class UBP_UPGameInstance_C*                   GameInstance;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_OnlineSession                       Session;                                           // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OpenSession_C_InitOpenSession) == 0x000008, "Wrong alignment on W_OpenSession_C_InitOpenSession");
static_assert(sizeof(W_OpenSession_C_InitOpenSession) == 0x000030, "Wrong size on W_OpenSession_C_InitOpenSession");
static_assert(offsetof(W_OpenSession_C_InitOpenSession, GameInstance) == 0x000000, "Member 'W_OpenSession_C_InitOpenSession::GameInstance' has a wrong offset!");
static_assert(offsetof(W_OpenSession_C_InitOpenSession, Session) == 0x000008, "Member 'W_OpenSession_C_InitOpenSession::Session' has a wrong offset!");

}

