#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerAvatarSelection

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "E_PlayerAvatar_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PlayerAvatarSelection.W_PlayerAvatarSelection_C
// 0x0050 (0x0310 - 0x02C0)
class UW_PlayerAvatarSelection_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Appearance;                                        // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                BackBtn;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ExitBtn;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                      GridBox;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UW_PlayerAvatarOption_C*>        Options;                                           // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class ABP_UPPlayerState_C*                    PlayerState;                                       // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              OpenSound;                                         // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_PlayerAvatarSelection_BackBtn_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__W_PlayerAvatarSelection_BackBtn_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_PlayerAvatarSelection_ExitBtn_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void ExecuteUbergraph_W_PlayerAvatarSelection(int32 EntryPoint);
	void GetNextGridLocation(int32* Row, int32* Column);
	void GetPlayerState(bool* IsValid, class ABP_UPPlayerState_C** PlayerState_0);
	void InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void InpActEvt_IA_MainMenu_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void OnInitialized();
	void Quit();
	void SelectAvatarOption(class UW_PlayerAvatarOption_C* AvatarOption);
	void UpdateSelection(E_PlayerAvatar SelectedAvatar);
	void VisibilityChanged(ESlateVisibility InVisibility);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_PlayerAvatarSelection_C">();
	}
	static class UW_PlayerAvatarSelection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_PlayerAvatarSelection_C>();
	}
};
static_assert(alignof(UW_PlayerAvatarSelection_C) == 0x000008, "Wrong alignment on UW_PlayerAvatarSelection_C");
static_assert(sizeof(UW_PlayerAvatarSelection_C) == 0x000310, "Wrong size on UW_PlayerAvatarSelection_C");
static_assert(offsetof(UW_PlayerAvatarSelection_C, UberGraphFrame) == 0x0002C0, "Member 'UW_PlayerAvatarSelection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_PlayerAvatarSelection_C, Appearance) == 0x0002C8, "Member 'UW_PlayerAvatarSelection_C::Appearance' has a wrong offset!");
static_assert(offsetof(UW_PlayerAvatarSelection_C, BackBtn) == 0x0002D0, "Member 'UW_PlayerAvatarSelection_C::BackBtn' has a wrong offset!");
static_assert(offsetof(UW_PlayerAvatarSelection_C, Background) == 0x0002D8, "Member 'UW_PlayerAvatarSelection_C::Background' has a wrong offset!");
static_assert(offsetof(UW_PlayerAvatarSelection_C, ExitBtn) == 0x0002E0, "Member 'UW_PlayerAvatarSelection_C::ExitBtn' has a wrong offset!");
static_assert(offsetof(UW_PlayerAvatarSelection_C, GridBox) == 0x0002E8, "Member 'UW_PlayerAvatarSelection_C::GridBox' has a wrong offset!");
static_assert(offsetof(UW_PlayerAvatarSelection_C, Options) == 0x0002F0, "Member 'UW_PlayerAvatarSelection_C::Options' has a wrong offset!");
static_assert(offsetof(UW_PlayerAvatarSelection_C, PlayerState) == 0x000300, "Member 'UW_PlayerAvatarSelection_C::PlayerState' has a wrong offset!");
static_assert(offsetof(UW_PlayerAvatarSelection_C, OpenSound) == 0x000308, "Member 'UW_PlayerAvatarSelection_C::OpenSound' has a wrong offset!");

}

