#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerAvatarSelection

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "InputCore_structs.hpp"
#include "E_PlayerAvatar_structs.hpp"


namespace SDK::Params
{

// Function W_PlayerAvatarSelection.W_PlayerAvatarSelection_C.ExecuteUbergraph_W_PlayerAvatarSelection
// 0x0158 (0x0158 - 0x0000)
struct W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UW_PlayerAvatarOption_C* AvatarOption)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0018(0x0018)(HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0058(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0080(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B[0x1];                                       // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNextGridLocation_Row;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNextGridLocation_Column;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_PlayerAvatar                                K2Node_CustomEvent_SelectedAvatar;                 // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_PlayerAvatarOption_C*                CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_PlayerAvatarOption_C*                CallFunc_Create_ReturnValue;                       // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate_1;           // 0x00D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPlayerState_IsValid;                   // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerState_C*                    CallFunc_GetPlayerState_PlayerState;               // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_103[0x1];                                      // 0x0103(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_PlayerAvatarOption_C*                K2Node_CustomEvent_AvatarOption;                   // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPlayerState_IsValid_1;                 // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerState_C*                    CallFunc_GetPlayerState_PlayerState_1;             // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0128(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_PlayerAvatarOption_C*                CallFunc_Array_Get_Item_1;                         // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance;           // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection) == 0x000008, "Wrong alignment on W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection");
static_assert(sizeof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection) == 0x000158, "Wrong size on W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, EntryPoint) == 0x000000, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, K2Node_InputKeyEvent_Key) == 0x000018, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, Temp_int_Array_Index_Variable) == 0x000030, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, Temp_bool_Variable) == 0x00003C, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, Temp_real_Variable) == 0x000040, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, Temp_real_Variable_1) == 0x000048, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, Temp_object_Variable) == 0x000050, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000058, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000078, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00007C, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000080, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, Temp_real_Variable_1_0) == 0x000088, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, Temp_real_Variable_0) == 0x000090, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000098, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, K2Node_CustomEvent_InVisibility) == 0x000099, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00009A, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_MakeLiteralInt_ReturnValue) == 0x00009C, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_GetNextGridLocation_Row) == 0x0000A0, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_GetNextGridLocation_Row' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_GetNextGridLocation_Column) == 0x0000A4, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_GetNextGridLocation_Column' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, K2Node_CustomEvent_SelectedAvatar) == 0x0000A8, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::K2Node_CustomEvent_SelectedAvatar' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_PlayAnimation_ReturnValue) == 0x0000B8, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000C4, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_Less_IntInt_ReturnValue) == 0x0000C5, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_Create_ReturnValue) == 0x0000C8, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000D0, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x0000E0, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_Array_Add_ReturnValue) == 0x0000E8, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_GetPlayerState_IsValid) == 0x0000EC, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_GetPlayerState_IsValid' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_GetPlayerState_PlayerState) == 0x0000F0, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_GetPlayerState_PlayerState' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, Temp_int_Variable) == 0x0000F8, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000FC, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_Conv_IntToByte_ReturnValue) == 0x000100, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_Less_IntInt_ReturnValue_1) == 0x000101, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000102, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000104, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, Temp_int_Variable_1) == 0x000108, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, K2Node_CustomEvent_AvatarOption) == 0x000110, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::K2Node_CustomEvent_AvatarOption' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000118, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_GetValidValue_ReturnValue) == 0x000119, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00011A, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_GetPlayerState_IsValid_1) == 0x00011B, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_GetPlayerState_IsValid_1' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_GetPlayerState_PlayerState_1) == 0x000120, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_GetPlayerState_PlayerState_1' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, K2Node_Event_Animation) == 0x000128, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000130, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_Array_Get_Item_1) == 0x000138, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, CallFunc_GetGameInstance_ReturnValue) == 0x000140, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, K2Node_DynamicCast_AsBP_UPGame_Instance) == 0x000148, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::K2Node_DynamicCast_AsBP_UPGame_Instance' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection, K2Node_DynamicCast_bSuccess) == 0x000150, "Member 'W_PlayerAvatarSelection_C_ExecuteUbergraph_W_PlayerAvatarSelection::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function W_PlayerAvatarSelection.W_PlayerAvatarSelection_C.GetNextGridLocation
// 0x0028 (0x0028 - 0x0000)
struct W_PlayerAvatarSelection_C_GetNextGridLocation final
{
public:
	int32                                         Row;                                               // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Column;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerAvatarSelection_C_GetNextGridLocation) == 0x000008, "Wrong alignment on W_PlayerAvatarSelection_C_GetNextGridLocation");
static_assert(sizeof(W_PlayerAvatarSelection_C_GetNextGridLocation) == 0x000028, "Wrong size on W_PlayerAvatarSelection_C_GetNextGridLocation");
static_assert(offsetof(W_PlayerAvatarSelection_C_GetNextGridLocation, Row) == 0x000000, "Member 'W_PlayerAvatarSelection_C_GetNextGridLocation::Row' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_GetNextGridLocation, Column) == 0x000004, "Member 'W_PlayerAvatarSelection_C_GetNextGridLocation::Column' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_GetNextGridLocation, CallFunc_GetAllChildren_ReturnValue) == 0x000008, "Member 'W_PlayerAvatarSelection_C_GetNextGridLocation::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_GetNextGridLocation, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'W_PlayerAvatarSelection_C_GetNextGridLocation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_GetNextGridLocation, CallFunc_Percent_IntInt_ReturnValue) == 0x00001C, "Member 'W_PlayerAvatarSelection_C_GetNextGridLocation::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_GetNextGridLocation, CallFunc_Divide_IntInt_ReturnValue) == 0x000020, "Member 'W_PlayerAvatarSelection_C_GetNextGridLocation::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");

// Function W_PlayerAvatarSelection.W_PlayerAvatarSelection_C.GetPlayerState
// 0x0038 (0x0038 - 0x0000)
struct W_PlayerAvatarSelection_C_GetPlayerState final
{
public:
	bool                                          IsValid;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerState_C*                    PlayerState_0;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerState_C*                    K2Node_DynamicCast_AsBP_UPPlayer_State;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerAvatarSelection_C_GetPlayerState) == 0x000008, "Wrong alignment on W_PlayerAvatarSelection_C_GetPlayerState");
static_assert(sizeof(W_PlayerAvatarSelection_C_GetPlayerState) == 0x000038, "Wrong size on W_PlayerAvatarSelection_C_GetPlayerState");
static_assert(offsetof(W_PlayerAvatarSelection_C_GetPlayerState, IsValid) == 0x000000, "Member 'W_PlayerAvatarSelection_C_GetPlayerState::IsValid' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_GetPlayerState, PlayerState_0) == 0x000008, "Member 'W_PlayerAvatarSelection_C_GetPlayerState::PlayerState_0' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_GetPlayerState, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'W_PlayerAvatarSelection_C_GetPlayerState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_GetPlayerState, CallFunc_GetPlayerPawn_ReturnValue) == 0x000018, "Member 'W_PlayerAvatarSelection_C_GetPlayerState::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_GetPlayerState, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'W_PlayerAvatarSelection_C_GetPlayerState::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_GetPlayerState, K2Node_DynamicCast_AsBP_UPPlayer_State) == 0x000028, "Member 'W_PlayerAvatarSelection_C_GetPlayerState::K2Node_DynamicCast_AsBP_UPPlayer_State' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_GetPlayerState, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'W_PlayerAvatarSelection_C_GetPlayerState::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function W_PlayerAvatarSelection.W_PlayerAvatarSelection_C.InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct W_PlayerAvatarSelection_C_InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerAvatarSelection_C_InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on W_PlayerAvatarSelection_C_InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_0");
static_assert(sizeof(W_PlayerAvatarSelection_C_InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on W_PlayerAvatarSelection_C_InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_0");
static_assert(offsetof(W_PlayerAvatarSelection_C_InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'W_PlayerAvatarSelection_C_InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

// Function W_PlayerAvatarSelection.W_PlayerAvatarSelection_C.InpActEvt_IA_MainMenu_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct W_PlayerAvatarSelection_C_InpActEvt_IA_MainMenu_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerAvatarSelection_C_InpActEvt_IA_MainMenu_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on W_PlayerAvatarSelection_C_InpActEvt_IA_MainMenu_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(W_PlayerAvatarSelection_C_InpActEvt_IA_MainMenu_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on W_PlayerAvatarSelection_C_InpActEvt_IA_MainMenu_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(W_PlayerAvatarSelection_C_InpActEvt_IA_MainMenu_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'W_PlayerAvatarSelection_C_InpActEvt_IA_MainMenu_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_InpActEvt_IA_MainMenu_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'W_PlayerAvatarSelection_C_InpActEvt_IA_MainMenu_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_InpActEvt_IA_MainMenu_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'W_PlayerAvatarSelection_C_InpActEvt_IA_MainMenu_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(W_PlayerAvatarSelection_C_InpActEvt_IA_MainMenu_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'W_PlayerAvatarSelection_C_InpActEvt_IA_MainMenu_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function W_PlayerAvatarSelection.W_PlayerAvatarSelection_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct W_PlayerAvatarSelection_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerAvatarSelection_C_OnAnimationFinished) == 0x000008, "Wrong alignment on W_PlayerAvatarSelection_C_OnAnimationFinished");
static_assert(sizeof(W_PlayerAvatarSelection_C_OnAnimationFinished) == 0x000008, "Wrong size on W_PlayerAvatarSelection_C_OnAnimationFinished");
static_assert(offsetof(W_PlayerAvatarSelection_C_OnAnimationFinished, Animation) == 0x000000, "Member 'W_PlayerAvatarSelection_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function W_PlayerAvatarSelection.W_PlayerAvatarSelection_C.SelectAvatarOption
// 0x0008 (0x0008 - 0x0000)
struct W_PlayerAvatarSelection_C_SelectAvatarOption final
{
public:
	class UW_PlayerAvatarOption_C*                AvatarOption;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerAvatarSelection_C_SelectAvatarOption) == 0x000008, "Wrong alignment on W_PlayerAvatarSelection_C_SelectAvatarOption");
static_assert(sizeof(W_PlayerAvatarSelection_C_SelectAvatarOption) == 0x000008, "Wrong size on W_PlayerAvatarSelection_C_SelectAvatarOption");
static_assert(offsetof(W_PlayerAvatarSelection_C_SelectAvatarOption, AvatarOption) == 0x000000, "Member 'W_PlayerAvatarSelection_C_SelectAvatarOption::AvatarOption' has a wrong offset!");

// Function W_PlayerAvatarSelection.W_PlayerAvatarSelection_C.UpdateSelection
// 0x0001 (0x0001 - 0x0000)
struct W_PlayerAvatarSelection_C_UpdateSelection final
{
public:
	E_PlayerAvatar                                SelectedAvatar;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerAvatarSelection_C_UpdateSelection) == 0x000001, "Wrong alignment on W_PlayerAvatarSelection_C_UpdateSelection");
static_assert(sizeof(W_PlayerAvatarSelection_C_UpdateSelection) == 0x000001, "Wrong size on W_PlayerAvatarSelection_C_UpdateSelection");
static_assert(offsetof(W_PlayerAvatarSelection_C_UpdateSelection, SelectedAvatar) == 0x000000, "Member 'W_PlayerAvatarSelection_C_UpdateSelection::SelectedAvatar' has a wrong offset!");

// Function W_PlayerAvatarSelection.W_PlayerAvatarSelection_C.VisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct W_PlayerAvatarSelection_C_VisibilityChanged final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerAvatarSelection_C_VisibilityChanged) == 0x000001, "Wrong alignment on W_PlayerAvatarSelection_C_VisibilityChanged");
static_assert(sizeof(W_PlayerAvatarSelection_C_VisibilityChanged) == 0x000001, "Wrong size on W_PlayerAvatarSelection_C_VisibilityChanged");
static_assert(offsetof(W_PlayerAvatarSelection_C_VisibilityChanged, InVisibility) == 0x000000, "Member 'W_PlayerAvatarSelection_C_VisibilityChanged::InVisibility' has a wrong offset!");

}

