#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ResultRecap

#include "Basic.hpp"

#include "S_CameroidCapture_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_ResultRecap.W_ResultRecap_C.ExecuteUbergraph_W_ResultRecap
// 0x0190 (0x0190 - 0x0000)
struct W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_CameroidCapture                     K2Node_CustomEvent_Capture;                        // 0x0020(0x0040)(HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index_1;                        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0070(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0088(0x0050)(HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Map_Find_Value;                           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F8(0x0018)()
	class UTexture2D*                             CallFunc_GetProfilePicture_ProfilePicture;         // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPGameState_C*                      K2Node_DynamicCast_AsBP_UPGame_State;              // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0130(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLastCaptureIndex_ReturnValue;          // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerState_C*                    CallFunc_GetPlayerStateById_PlayerState;           // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0178(0x0018)()
};
static_assert(alignof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap) == 0x000008, "Wrong alignment on W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap");
static_assert(sizeof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap) == 0x000190, "Wrong size on W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, EntryPoint) == 0x000000, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, K2Node_DynamicCast_AsBP_UPGame_Instance) == 0x000010, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::K2Node_DynamicCast_AsBP_UPGame_Instance' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, K2Node_CustomEvent_Capture) == 0x000020, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::K2Node_CustomEvent_Capture' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, K2Node_CustomEvent_Index_1) == 0x000060, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::K2Node_CustomEvent_Index_1' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000068, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, CallFunc_Conv_IntToText_ReturnValue) == 0x000070, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, K2Node_MakeStruct_FormatArgumentData) == 0x000088, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, CallFunc_Map_Find_Value) == 0x0000D8, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, CallFunc_Map_Find_ReturnValue) == 0x0000E0, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, K2Node_MakeArray_Array) == 0x0000E8, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, CallFunc_Format_ReturnValue) == 0x0000F8, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, CallFunc_GetProfilePicture_ProfilePicture) == 0x000110, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::CallFunc_GetProfilePicture_ProfilePicture' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, CallFunc_GetGameState_ReturnValue) == 0x000118, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, K2Node_DynamicCast_AsBP_UPGame_State) == 0x000120, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::K2Node_DynamicCast_AsBP_UPGame_State' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, K2Node_DynamicCast_bSuccess_1) == 0x000128, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, K2Node_Event_Animation) == 0x000130, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, CallFunc_PlayAnimation_ReturnValue) == 0x000138, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000140, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000141, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000142, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x000143, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, K2Node_CustomEvent_Index) == 0x000144, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, CallFunc_GetLastCaptureIndex_ReturnValue) == 0x000148, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::CallFunc_GetLastCaptureIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, CallFunc_PlayAnimation_ReturnValue_1) == 0x000150, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, CallFunc_Greater_IntInt_ReturnValue) == 0x000158, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, CallFunc_Subtract_IntInt_ReturnValue) == 0x00015C, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, CallFunc_PlayAnimation_ReturnValue_2) == 0x000160, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, CallFunc_GetPlayerStateById_PlayerState) == 0x000168, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::CallFunc_GetPlayerStateById_PlayerState' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, CallFunc_IsValid_ReturnValue) == 0x000170, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap, CallFunc_Conv_StringToText_ReturnValue) == 0x000178, "Member 'W_ResultRecap_C_ExecuteUbergraph_W_ResultRecap::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function W_ResultRecap.W_ResultRecap_C.GetLastCaptureIndex
// 0x0010 (0x0010 - 0x0000)
struct W_ResultRecap_C_GetLastCaptureIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ResultRecap_C_GetLastCaptureIndex) == 0x000004, "Wrong alignment on W_ResultRecap_C_GetLastCaptureIndex");
static_assert(sizeof(W_ResultRecap_C_GetLastCaptureIndex) == 0x000010, "Wrong size on W_ResultRecap_C_GetLastCaptureIndex");
static_assert(offsetof(W_ResultRecap_C_GetLastCaptureIndex, ReturnValue) == 0x000000, "Member 'W_ResultRecap_C_GetLastCaptureIndex::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_GetLastCaptureIndex, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'W_ResultRecap_C_GetLastCaptureIndex::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_GetLastCaptureIndex, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'W_ResultRecap_C_GetLastCaptureIndex::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_GetLastCaptureIndex, CallFunc_Min_ReturnValue) == 0x00000C, "Member 'W_ResultRecap_C_GetLastCaptureIndex::CallFunc_Min_ReturnValue' has a wrong offset!");

// Function W_ResultRecap.W_ResultRecap_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct W_ResultRecap_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ResultRecap_C_OnAnimationFinished) == 0x000008, "Wrong alignment on W_ResultRecap_C_OnAnimationFinished");
static_assert(sizeof(W_ResultRecap_C_OnAnimationFinished) == 0x000008, "Wrong size on W_ResultRecap_C_OnAnimationFinished");
static_assert(offsetof(W_ResultRecap_C_OnAnimationFinished, Animation) == 0x000000, "Member 'W_ResultRecap_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function W_ResultRecap.W_ResultRecap_C.PlayCaptureAnim
// 0x0004 (0x0004 - 0x0000)
struct W_ResultRecap_C_PlayCaptureAnim final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ResultRecap_C_PlayCaptureAnim) == 0x000004, "Wrong alignment on W_ResultRecap_C_PlayCaptureAnim");
static_assert(sizeof(W_ResultRecap_C_PlayCaptureAnim) == 0x000004, "Wrong size on W_ResultRecap_C_PlayCaptureAnim");
static_assert(offsetof(W_ResultRecap_C_PlayCaptureAnim, Index_0) == 0x000000, "Member 'W_ResultRecap_C_PlayCaptureAnim::Index_0' has a wrong offset!");

// Function W_ResultRecap.W_ResultRecap_C.SetCaptureData
// 0x0048 (0x0048 - 0x0000)
struct W_ResultRecap_C_SetCaptureData final
{
public:
	struct FS_CameroidCapture                     Capture;                                           // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ResultRecap_C_SetCaptureData) == 0x000008, "Wrong alignment on W_ResultRecap_C_SetCaptureData");
static_assert(sizeof(W_ResultRecap_C_SetCaptureData) == 0x000048, "Wrong size on W_ResultRecap_C_SetCaptureData");
static_assert(offsetof(W_ResultRecap_C_SetCaptureData, Capture) == 0x000000, "Member 'W_ResultRecap_C_SetCaptureData::Capture' has a wrong offset!");
static_assert(offsetof(W_ResultRecap_C_SetCaptureData, Index_0) == 0x000040, "Member 'W_ResultRecap_C_SetCaptureData::Index_0' has a wrong offset!");

}

