#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ResultRecap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ResultRecap.W_ResultRecap_C
// 0x0080 (0x0340 - 0x02C0)
class UW_ResultRecap_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OutroAnim;                                         // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CaptureAnim;                                       // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IntroAnim;                                         // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CaptureImg;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_119;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             IndexText;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScoreIcon;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ScoreText;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UserIcon;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             UserText;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnRecapFinished;                                   // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ABP_UPGameState_C*                      GameState;                                         // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   GameInstance;                                      // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         CaptureIndex;                                      // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_ResultRecap(int32 EntryPoint);
	int32 GetLastCaptureIndex();
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void PlayCaptureAnim(int32 Index_0);
	void PlayIntro();
	void PlayOutro();
	void SetCaptureData(const struct FS_CameroidCapture& Capture, int32 Index_0);
	void StartRecap();
	void UpdateCapture();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_ResultRecap_C">();
	}
	static class UW_ResultRecap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ResultRecap_C>();
	}
};
static_assert(alignof(UW_ResultRecap_C) == 0x000008, "Wrong alignment on UW_ResultRecap_C");
static_assert(sizeof(UW_ResultRecap_C) == 0x000340, "Wrong size on UW_ResultRecap_C");
static_assert(offsetof(UW_ResultRecap_C, UberGraphFrame) == 0x0002C0, "Member 'UW_ResultRecap_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ResultRecap_C, OutroAnim) == 0x0002C8, "Member 'UW_ResultRecap_C::OutroAnim' has a wrong offset!");
static_assert(offsetof(UW_ResultRecap_C, CaptureAnim) == 0x0002D0, "Member 'UW_ResultRecap_C::CaptureAnim' has a wrong offset!");
static_assert(offsetof(UW_ResultRecap_C, IntroAnim) == 0x0002D8, "Member 'UW_ResultRecap_C::IntroAnim' has a wrong offset!");
static_assert(offsetof(UW_ResultRecap_C, CaptureImg) == 0x0002E0, "Member 'UW_ResultRecap_C::CaptureImg' has a wrong offset!");
static_assert(offsetof(UW_ResultRecap_C, Image_119) == 0x0002E8, "Member 'UW_ResultRecap_C::Image_119' has a wrong offset!");
static_assert(offsetof(UW_ResultRecap_C, IndexText) == 0x0002F0, "Member 'UW_ResultRecap_C::IndexText' has a wrong offset!");
static_assert(offsetof(UW_ResultRecap_C, ScoreIcon) == 0x0002F8, "Member 'UW_ResultRecap_C::ScoreIcon' has a wrong offset!");
static_assert(offsetof(UW_ResultRecap_C, ScoreText) == 0x000300, "Member 'UW_ResultRecap_C::ScoreText' has a wrong offset!");
static_assert(offsetof(UW_ResultRecap_C, UserIcon) == 0x000308, "Member 'UW_ResultRecap_C::UserIcon' has a wrong offset!");
static_assert(offsetof(UW_ResultRecap_C, UserText) == 0x000310, "Member 'UW_ResultRecap_C::UserText' has a wrong offset!");
static_assert(offsetof(UW_ResultRecap_C, OnRecapFinished) == 0x000318, "Member 'UW_ResultRecap_C::OnRecapFinished' has a wrong offset!");
static_assert(offsetof(UW_ResultRecap_C, GameState) == 0x000328, "Member 'UW_ResultRecap_C::GameState' has a wrong offset!");
static_assert(offsetof(UW_ResultRecap_C, GameInstance) == 0x000330, "Member 'UW_ResultRecap_C::GameInstance' has a wrong offset!");
static_assert(offsetof(UW_ResultRecap_C, CaptureIndex) == 0x000338, "Member 'UW_ResultRecap_C::CaptureIndex' has a wrong offset!");

}

