#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ResultNeonSign

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ResultNeonSign.W_ResultNeonSign_C
// 0x0098 (0x0358 - 0x02C0)
class UW_ResultNeonSign_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             NeonText;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            TextColorAndOpacity;                               // 0x02D0(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         TextFontInfo;                                      // 0x02E8(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0340(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void UpdateText();
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_W_ResultNeonSign(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_ResultNeonSign_C">();
	}
	static class UW_ResultNeonSign_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ResultNeonSign_C>();
	}
};
static_assert(alignof(UW_ResultNeonSign_C) == 0x000008, "Wrong alignment on UW_ResultNeonSign_C");
static_assert(sizeof(UW_ResultNeonSign_C) == 0x000358, "Wrong size on UW_ResultNeonSign_C");
static_assert(offsetof(UW_ResultNeonSign_C, UberGraphFrame) == 0x0002C0, "Member 'UW_ResultNeonSign_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ResultNeonSign_C, NeonText) == 0x0002C8, "Member 'UW_ResultNeonSign_C::NeonText' has a wrong offset!");
static_assert(offsetof(UW_ResultNeonSign_C, TextColorAndOpacity) == 0x0002D0, "Member 'UW_ResultNeonSign_C::TextColorAndOpacity' has a wrong offset!");
static_assert(offsetof(UW_ResultNeonSign_C, TextFontInfo) == 0x0002E8, "Member 'UW_ResultNeonSign_C::TextFontInfo' has a wrong offset!");
static_assert(offsetof(UW_ResultNeonSign_C, Text) == 0x000340, "Member 'UW_ResultNeonSign_C::Text' has a wrong offset!");

}

