#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ResultSelectionDetails

#include "Basic.hpp"

#include "S_ScoringCategory_structs.hpp"
#include "S_CameroidActorScore_structs.hpp"
#include "S_CameroidCapture_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_ResultSelectionDetails.W_ResultSelectionDetails_C.ExecuteUbergraph_W_ResultSelectionDetails
// 0x02D8 (0x02D8 - 0x0000)
struct W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0070(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0018)()
	struct FS_CameroidCapture                     K2Node_CustomEvent_Capture;                        // 0x00A0(0x0040)(HasGetValueTypeHash)
	class ABP_Scoring_C*                          CallFunc_GetScoring_Scoring;                       // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_ScoringCategory                     CallFunc_FindCategory_Category;                    // 0x00E8(0x0028)(HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0110(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0128(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0178(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0198(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01B0(0x0018)()
	TArray<class FString>                         CallFunc_GetActorsDetails_Actors;                  // 0x01C8(0x0010)(ReferenceParm)
	TArray<class FString>                         CallFunc_GetActorsDetails_Scores;                  // 0x01D8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_JoinStringArray_ReturnValue_1;            // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0208(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0220(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0240(0x0018)()
	float                                         Temp_real_Variable;                                // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPGameState_C*                      K2Node_DynamicCast_AsBP_UPGame_State;              // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance;           // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Scoring_C*                          CallFunc_GetActorOfClass_ReturnValue;              // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A3[0x5];                                      // 0x02A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetProfilePicture_ProfilePicture;         // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerState_C*                    CallFunc_GetPlayerStateById_PlayerState;           // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x02C0(0x0018)()
};
static_assert(alignof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails) == 0x000008, "Wrong alignment on W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails");
static_assert(sizeof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails) == 0x0002D8, "Wrong size on W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, EntryPoint) == 0x000000, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000004, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000058, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, K2Node_MakeArray_Array) == 0x000060, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, CallFunc_Conv_IntToText_ReturnValue) == 0x000070, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, CallFunc_Format_ReturnValue) == 0x000088, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, K2Node_CustomEvent_Capture) == 0x0000A0, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::K2Node_CustomEvent_Capture' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, CallFunc_GetScoring_Scoring) == 0x0000E0, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::CallFunc_GetScoring_Scoring' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, CallFunc_FindCategory_Category) == 0x0000E8, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::CallFunc_FindCategory_Category' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, Temp_text_Variable) == 0x000110, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, K2Node_MakeStruct_FormatArgumentData_1) == 0x000128, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, K2Node_MakeArray_Array_1) == 0x000178, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000188, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, CallFunc_Format_ReturnValue_1) == 0x000198, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, CallFunc_Conv_StringToText_ReturnValue) == 0x0001B0, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, CallFunc_GetActorsDetails_Actors) == 0x0001C8, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::CallFunc_GetActorsDetails_Actors' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, CallFunc_GetActorsDetails_Scores) == 0x0001D8, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::CallFunc_GetActorsDetails_Scores' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, CallFunc_JoinStringArray_ReturnValue) == 0x0001E8, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::CallFunc_JoinStringArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, CallFunc_JoinStringArray_ReturnValue_1) == 0x0001F8, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::CallFunc_JoinStringArray_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000208, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000220, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, Temp_bool_Variable) == 0x000238, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, K2Node_Select_Default) == 0x000240, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, Temp_real_Variable) == 0x000258, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, Temp_real_Variable_1) == 0x00025C, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, Temp_bool_Variable_1) == 0x000260, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, K2Node_Select_Default_1) == 0x000264, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, CallFunc_GetGameState_ReturnValue) == 0x000268, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, CallFunc_GetGameInstance_ReturnValue) == 0x000270, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, K2Node_DynamicCast_AsBP_UPGame_State) == 0x000278, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::K2Node_DynamicCast_AsBP_UPGame_State' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, K2Node_DynamicCast_bSuccess) == 0x000280, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, K2Node_DynamicCast_AsBP_UPGame_Instance) == 0x000288, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::K2Node_DynamicCast_AsBP_UPGame_Instance' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, K2Node_DynamicCast_bSuccess_1) == 0x000290, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, CallFunc_GetActorOfClass_ReturnValue) == 0x000298, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, CallFunc_IsValid_ReturnValue) == 0x0002A0, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, CallFunc_IsValid_ReturnValue_1) == 0x0002A1, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, CallFunc_IsValid_ReturnValue_2) == 0x0002A2, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, CallFunc_GetProfilePicture_ProfilePicture) == 0x0002A8, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::CallFunc_GetProfilePicture_ProfilePicture' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, CallFunc_GetPlayerStateById_PlayerState) == 0x0002B0, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::CallFunc_GetPlayerStateById_PlayerState' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, CallFunc_IsValid_ReturnValue_3) == 0x0002B8, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails, CallFunc_Conv_StringToText_ReturnValue_3) == 0x0002C0, "Member 'W_ResultSelectionDetails_C_ExecuteUbergraph_W_ResultSelectionDetails::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");

// Function W_ResultSelectionDetails.W_ResultSelectionDetails_C.GetActorsDetails
// 0x00D0 (0x00D0 - 0x0000)
struct W_ResultSelectionDetails_C_GetActorsDetails final
{
public:
	TArray<class FString>                         Actors;                                            // 0x0000(0x0010)(Parm, OutParm)
	TArray<class FString>                         Scores;                                            // 0x0010(0x0010)(Parm, OutParm)
	TArray<class FString>                         _Scores;                                           // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         _Actors;                                           // 0x0030(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_CameroidActorScore>          CallFunc_GetSortedActorsScores_ActorsScores;       // 0x0048(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCapturedActorDisplayName_DisplayName;  // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMinorActorsScore_OthersScore;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x00B8(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ResultSelectionDetails_C_GetActorsDetails) == 0x000008, "Wrong alignment on W_ResultSelectionDetails_C_GetActorsDetails");
static_assert(sizeof(W_ResultSelectionDetails_C_GetActorsDetails) == 0x0000D0, "Wrong size on W_ResultSelectionDetails_C_GetActorsDetails");
static_assert(offsetof(W_ResultSelectionDetails_C_GetActorsDetails, Actors) == 0x000000, "Member 'W_ResultSelectionDetails_C_GetActorsDetails::Actors' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetActorsDetails, Scores) == 0x000010, "Member 'W_ResultSelectionDetails_C_GetActorsDetails::Scores' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetActorsDetails, _Scores) == 0x000020, "Member 'W_ResultSelectionDetails_C_GetActorsDetails::_Scores' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetActorsDetails, _Actors) == 0x000030, "Member 'W_ResultSelectionDetails_C_GetActorsDetails::_Actors' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetActorsDetails, Temp_int_Variable) == 0x000040, "Member 'W_ResultSelectionDetails_C_GetActorsDetails::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetActorsDetails, CallFunc_GetSortedActorsScores_ActorsScores) == 0x000048, "Member 'W_ResultSelectionDetails_C_GetActorsDetails::CallFunc_GetSortedActorsScores_ActorsScores' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetActorsDetails, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'W_ResultSelectionDetails_C_GetActorsDetails::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetActorsDetails, CallFunc_GetCapturedActorDisplayName_DisplayName) == 0x000060, "Member 'W_ResultSelectionDetails_C_GetActorsDetails::CallFunc_GetCapturedActorDisplayName_DisplayName' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetActorsDetails, CallFunc_Array_Add_ReturnValue) == 0x000070, "Member 'W_ResultSelectionDetails_C_GetActorsDetails::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetActorsDetails, CallFunc_Conv_IntToString_ReturnValue) == 0x000078, "Member 'W_ResultSelectionDetails_C_GetActorsDetails::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetActorsDetails, CallFunc_GetMinorActorsScore_OthersScore) == 0x000088, "Member 'W_ResultSelectionDetails_C_GetActorsDetails::CallFunc_GetMinorActorsScore_OthersScore' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetActorsDetails, CallFunc_Array_Add_ReturnValue_1) == 0x00008C, "Member 'W_ResultSelectionDetails_C_GetActorsDetails::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetActorsDetails, CallFunc_Greater_IntInt_ReturnValue) == 0x000090, "Member 'W_ResultSelectionDetails_C_GetActorsDetails::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetActorsDetails, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000098, "Member 'W_ResultSelectionDetails_C_GetActorsDetails::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetActorsDetails, CallFunc_Array_Add_ReturnValue_2) == 0x0000A8, "Member 'W_ResultSelectionDetails_C_GetActorsDetails::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetActorsDetails, CallFunc_Array_LastIndex_ReturnValue) == 0x0000AC, "Member 'W_ResultSelectionDetails_C_GetActorsDetails::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetActorsDetails, CallFunc_Min_ReturnValue) == 0x0000B0, "Member 'W_ResultSelectionDetails_C_GetActorsDetails::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetActorsDetails, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000B4, "Member 'W_ResultSelectionDetails_C_GetActorsDetails::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetActorsDetails, Temp_string_Variable) == 0x0000B8, "Member 'W_ResultSelectionDetails_C_GetActorsDetails::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetActorsDetails, CallFunc_Array_Add_ReturnValue_3) == 0x0000C8, "Member 'W_ResultSelectionDetails_C_GetActorsDetails::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");

// Function W_ResultSelectionDetails.W_ResultSelectionDetails_C.GetMinorActorsScore
// 0x0030 (0x0030 - 0x0000)
struct W_ResultSelectionDetails_C_GetMinorActorsScore final
{
public:
	TArray<struct FS_CameroidActorScore>          ActorsScores_0;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         OthersScore;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _Score;                                            // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ResultSelectionDetails_C_GetMinorActorsScore) == 0x000008, "Wrong alignment on W_ResultSelectionDetails_C_GetMinorActorsScore");
static_assert(sizeof(W_ResultSelectionDetails_C_GetMinorActorsScore) == 0x000030, "Wrong size on W_ResultSelectionDetails_C_GetMinorActorsScore");
static_assert(offsetof(W_ResultSelectionDetails_C_GetMinorActorsScore, ActorsScores_0) == 0x000000, "Member 'W_ResultSelectionDetails_C_GetMinorActorsScore::ActorsScores_0' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetMinorActorsScore, OthersScore) == 0x000010, "Member 'W_ResultSelectionDetails_C_GetMinorActorsScore::OthersScore' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetMinorActorsScore, _Score) == 0x000014, "Member 'W_ResultSelectionDetails_C_GetMinorActorsScore::_Score' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetMinorActorsScore, CallFunc_Array_LastIndex_ReturnValue) == 0x000018, "Member 'W_ResultSelectionDetails_C_GetMinorActorsScore::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetMinorActorsScore, Temp_int_Variable) == 0x00001C, "Member 'W_ResultSelectionDetails_C_GetMinorActorsScore::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetMinorActorsScore, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000020, "Member 'W_ResultSelectionDetails_C_GetMinorActorsScore::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetMinorActorsScore, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'W_ResultSelectionDetails_C_GetMinorActorsScore::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetMinorActorsScore, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'W_ResultSelectionDetails_C_GetMinorActorsScore::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function W_ResultSelectionDetails.W_ResultSelectionDetails_C.GetScoring
// 0x0018 (0x0018 - 0x0000)
struct W_ResultSelectionDetails_C_GetScoring final
{
public:
	class ABP_Scoring_C*                          Scoring_0;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Scoring_C*                          CallFunc_GetActorOfClass_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ResultSelectionDetails_C_GetScoring) == 0x000008, "Wrong alignment on W_ResultSelectionDetails_C_GetScoring");
static_assert(sizeof(W_ResultSelectionDetails_C_GetScoring) == 0x000018, "Wrong size on W_ResultSelectionDetails_C_GetScoring");
static_assert(offsetof(W_ResultSelectionDetails_C_GetScoring, Scoring_0) == 0x000000, "Member 'W_ResultSelectionDetails_C_GetScoring::Scoring_0' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetScoring, CallFunc_GetActorOfClass_ReturnValue) == 0x000008, "Member 'W_ResultSelectionDetails_C_GetScoring::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ResultSelectionDetails_C_GetScoring, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'W_ResultSelectionDetails_C_GetScoring::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function W_ResultSelectionDetails.W_ResultSelectionDetails_C.SetCapture
// 0x0040 (0x0040 - 0x0000)
struct W_ResultSelectionDetails_C_SetCapture final
{
public:
	struct FS_CameroidCapture                     Capture_0;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(W_ResultSelectionDetails_C_SetCapture) == 0x000008, "Wrong alignment on W_ResultSelectionDetails_C_SetCapture");
static_assert(sizeof(W_ResultSelectionDetails_C_SetCapture) == 0x000040, "Wrong size on W_ResultSelectionDetails_C_SetCapture");
static_assert(offsetof(W_ResultSelectionDetails_C_SetCapture, Capture_0) == 0x000000, "Member 'W_ResultSelectionDetails_C_SetCapture::Capture_0' has a wrong offset!");

}

