#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SessionSaveSlot

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function W_SessionSaveSlot.W_SessionSaveSlot_C.ExecuteUbergraph_W_SessionSaveSlot
// 0x0198 (0x0198 - 0x0000)
struct W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Slot;                           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSaveSessionInfo_IsUsed;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSaveSessionInfo_Objective;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSaveSessionInfo_DaysLeft;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSaveSessionInfo_IsCustom;              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B8(0x0018)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00D8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0128(0x0010)(ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0140(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UImage*>                         K2Node_MakeArray_Array_2;                          // 0x0160(0x0010)(ReferenceParm, ContainsInstancedReference)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsSelected;                     // 0x0185(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_186[0x2];                                      // 0x0186(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot) == 0x000008, "Wrong alignment on W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot");
static_assert(sizeof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot) == 0x000198, "Wrong size on W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, EntryPoint) == 0x000000, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, Temp_bool_Variable) == 0x000004, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, Temp_byte_Variable) == 0x000005, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, Temp_byte_Variable_1) == 0x000006, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, K2Node_Select_Default) == 0x000007, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, Temp_int_Array_Index_Variable) == 0x000008, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, Temp_byte_Variable_2) == 0x000010, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, K2Node_CustomEvent_Slot) == 0x000018, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::K2Node_CustomEvent_Slot' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, CallFunc_GetGameInstance_ReturnValue) == 0x000020, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, K2Node_DynamicCast_AsBP_UPGame_Instance) == 0x000028, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::K2Node_DynamicCast_AsBP_UPGame_Instance' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000038, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, CallFunc_GetSaveSessionInfo_IsUsed) == 0x000040, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::CallFunc_GetSaveSessionInfo_IsUsed' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, CallFunc_GetSaveSessionInfo_Objective) == 0x000044, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::CallFunc_GetSaveSessionInfo_Objective' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, CallFunc_GetSaveSessionInfo_DaysLeft) == 0x000048, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::CallFunc_GetSaveSessionInfo_DaysLeft' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, CallFunc_GetSaveSessionInfo_IsCustom) == 0x00004C, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::CallFunc_GetSaveSessionInfo_IsCustom' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, K2Node_MakeArray_Array) == 0x0000A0, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, CallFunc_Less_IntInt_ReturnValue) == 0x0000B0, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, CallFunc_Format_ReturnValue) == 0x0000B8, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0000D0, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000D8, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, K2Node_MakeArray_Array_1) == 0x000128, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, Temp_byte_Variable_3) == 0x000138, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, CallFunc_Format_ReturnValue_1) == 0x000140, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, Temp_bool_Variable_1) == 0x000158, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, K2Node_MakeArray_Array_2) == 0x000160, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, K2Node_Select_Default_1) == 0x000170, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, CallFunc_Array_Get_Item) == 0x000178, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, CallFunc_Array_Length_ReturnValue) == 0x000180, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, CallFunc_Less_IntInt_ReturnValue_1) == 0x000184, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, K2Node_CustomEvent_IsSelected) == 0x000185, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::K2Node_CustomEvent_IsSelected' has a wrong offset!");
static_assert(offsetof(W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot, CallFunc_SelectColor_ReturnValue) == 0x000188, "Member 'W_SessionSaveSlot_C_ExecuteUbergraph_W_SessionSaveSlot::CallFunc_SelectColor_ReturnValue' has a wrong offset!");

// Function W_SessionSaveSlot.W_SessionSaveSlot_C.RefreshSlot
// 0x0004 (0x0004 - 0x0000)
struct W_SessionSaveSlot_C_RefreshSlot final
{
public:
	int32                                         Slot_0;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SessionSaveSlot_C_RefreshSlot) == 0x000004, "Wrong alignment on W_SessionSaveSlot_C_RefreshSlot");
static_assert(sizeof(W_SessionSaveSlot_C_RefreshSlot) == 0x000004, "Wrong size on W_SessionSaveSlot_C_RefreshSlot");
static_assert(offsetof(W_SessionSaveSlot_C_RefreshSlot, Slot_0) == 0x000000, "Member 'W_SessionSaveSlot_C_RefreshSlot::Slot_0' has a wrong offset!");

// Function W_SessionSaveSlot.W_SessionSaveSlot_C.SetSelected
// 0x0001 (0x0001 - 0x0000)
struct W_SessionSaveSlot_C_SetSelected final
{
public:
	bool                                          IsSelected_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SessionSaveSlot_C_SetSelected) == 0x000001, "Wrong alignment on W_SessionSaveSlot_C_SetSelected");
static_assert(sizeof(W_SessionSaveSlot_C_SetSelected) == 0x000001, "Wrong size on W_SessionSaveSlot_C_SetSelected");
static_assert(offsetof(W_SessionSaveSlot_C_SetSelected, IsSelected_0) == 0x000000, "Member 'W_SessionSaveSlot_C_SetSelected::IsSelected_0' has a wrong offset!");

}

