#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SessionMember

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SessionMember.W_SessionMember_C
// 0x0058 (0x0318 - 0x02C0)
class UW_SessionMember_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                KickBtn;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MicIcon;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MuteBtn;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayerAvatar;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerName;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                SessionMemberBorder;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   GameInstance;                                      // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_UPGameState_C*                      GameState;                                         // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerState_C*                    PlayerState;                                       // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_VoiceChat_C*                        VoiceChat;                                         // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_SessionMember_KickBtn_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_SessionMember_MuteBtn_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void ExecuteUbergraph_W_SessionMember(int32 EntryPoint);
	class UWidget* FocusMainMenu(EUINavigation Navigation_0);
	class UWidget* FocusSessionMember();
	void GetVoiceChat(class ABP_VoiceChat_C** VoiceChat_0);
	void InitSessionMember(class ABP_UPPlayerState_C* PlayerState_0);
	void OnInitialized();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_SessionMember_C">();
	}
	static class UW_SessionMember_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_SessionMember_C>();
	}
};
static_assert(alignof(UW_SessionMember_C) == 0x000008, "Wrong alignment on UW_SessionMember_C");
static_assert(sizeof(UW_SessionMember_C) == 0x000318, "Wrong size on UW_SessionMember_C");
static_assert(offsetof(UW_SessionMember_C, UberGraphFrame) == 0x0002C0, "Member 'UW_SessionMember_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SessionMember_C, KickBtn) == 0x0002C8, "Member 'UW_SessionMember_C::KickBtn' has a wrong offset!");
static_assert(offsetof(UW_SessionMember_C, MicIcon) == 0x0002D0, "Member 'UW_SessionMember_C::MicIcon' has a wrong offset!");
static_assert(offsetof(UW_SessionMember_C, MuteBtn) == 0x0002D8, "Member 'UW_SessionMember_C::MuteBtn' has a wrong offset!");
static_assert(offsetof(UW_SessionMember_C, PlayerAvatar) == 0x0002E0, "Member 'UW_SessionMember_C::PlayerAvatar' has a wrong offset!");
static_assert(offsetof(UW_SessionMember_C, PlayerName) == 0x0002E8, "Member 'UW_SessionMember_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UW_SessionMember_C, SessionMemberBorder) == 0x0002F0, "Member 'UW_SessionMember_C::SessionMemberBorder' has a wrong offset!");
static_assert(offsetof(UW_SessionMember_C, GameInstance) == 0x0002F8, "Member 'UW_SessionMember_C::GameInstance' has a wrong offset!");
static_assert(offsetof(UW_SessionMember_C, GameState) == 0x000300, "Member 'UW_SessionMember_C::GameState' has a wrong offset!");
static_assert(offsetof(UW_SessionMember_C, PlayerState) == 0x000308, "Member 'UW_SessionMember_C::PlayerState' has a wrong offset!");
static_assert(offsetof(UW_SessionMember_C, VoiceChat) == 0x000310, "Member 'UW_SessionMember_C::VoiceChat' has a wrong offset!");

}

