#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SessionMember

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_SessionMember.W_SessionMember_C.ExecuteUbergraph_W_SessionMember
// 0x00D8 (0x00D8 - 0x0000)
struct W_SessionMember_C_ExecuteUbergraph_W_SessionMember final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_VoiceChat_C*                        CallFunc_GetVoiceChat_VoiceChat;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_VoiceChat_C*                        CallFunc_GetVoiceChat_VoiceChat_1;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerMuted_Muted;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0028(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   K2Node_DynamicCast_AsBP_UPGame_Instance;           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPGameState_C*                      K2Node_DynamicCast_AsBP_UPGame_State;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerState_C*                    K2Node_CustomEvent_PlayerState;                    // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerMuted_Muted_1;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_Int64Int64_ReturnValue;          // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_Int64Int64_ReturnValue_1;        // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A8(0x0018)()
	bool                                          CallFunc_HasKeyboardFocus_ReturnValue;             // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_FocusSessionMember_ReturnValue;           // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember) == 0x000008, "Wrong alignment on W_SessionMember_C_ExecuteUbergraph_W_SessionMember");
static_assert(sizeof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember) == 0x0000D8, "Wrong size on W_SessionMember_C_ExecuteUbergraph_W_SessionMember");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, EntryPoint) == 0x000000, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, CallFunc_GetVoiceChat_VoiceChat) == 0x000008, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::CallFunc_GetVoiceChat_VoiceChat' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, CallFunc_GetVoiceChat_VoiceChat_1) == 0x000018, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::CallFunc_GetVoiceChat_VoiceChat_1' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, CallFunc_IsPlayerMuted_Muted) == 0x000021, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::CallFunc_IsPlayerMuted_Muted' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, CallFunc_Not_PreBool_ReturnValue) == 0x000022, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, CallFunc_IsValid_ReturnValue_2) == 0x000023, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, CallFunc_IsVisible_ReturnValue) == 0x000024, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, K2Node_Event_MyGeometry) == 0x000028, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, K2Node_Event_InDeltaTime) == 0x000060, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, CallFunc_GetGameInstance_ReturnValue) == 0x000068, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, K2Node_DynamicCast_AsBP_UPGame_Instance) == 0x000070, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::K2Node_DynamicCast_AsBP_UPGame_Instance' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, CallFunc_GetGameState_ReturnValue) == 0x000080, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, K2Node_DynamicCast_AsBP_UPGame_State) == 0x000088, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::K2Node_DynamicCast_AsBP_UPGame_State' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, CallFunc_IsValid_ReturnValue_3) == 0x000091, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, K2Node_CustomEvent_PlayerState) == 0x000098, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::K2Node_CustomEvent_PlayerState' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, CallFunc_IsValid_ReturnValue_4) == 0x0000A0, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, CallFunc_IsPlayerMuted_Muted_1) == 0x0000A1, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::CallFunc_IsPlayerMuted_Muted_1' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, CallFunc_NotEqual_Int64Int64_ReturnValue) == 0x0000A2, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::CallFunc_NotEqual_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, CallFunc_BooleanAND_ReturnValue) == 0x0000A3, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, CallFunc_NotEqual_Int64Int64_ReturnValue_1) == 0x0000A4, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::CallFunc_NotEqual_Int64Int64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, CallFunc_IsEmpty_ReturnValue) == 0x0000A5, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A8, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, CallFunc_HasKeyboardFocus_ReturnValue) == 0x0000C0, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::CallFunc_HasKeyboardFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, CallFunc_FocusSessionMember_ReturnValue) == 0x0000C8, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::CallFunc_FocusSessionMember_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_ExecuteUbergraph_W_SessionMember, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000D0, "Member 'W_SessionMember_C_ExecuteUbergraph_W_SessionMember::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function W_SessionMember.W_SessionMember_C.FocusMainMenu
// 0x0028 (0x0028 - 0x0000)
struct W_SessionMember_C_FocusMainMenu final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerController_C*               K2Node_DynamicCast_AsBP_UPPlayer_Controller;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SessionMember_C_FocusMainMenu) == 0x000008, "Wrong alignment on W_SessionMember_C_FocusMainMenu");
static_assert(sizeof(W_SessionMember_C_FocusMainMenu) == 0x000028, "Wrong size on W_SessionMember_C_FocusMainMenu");
static_assert(offsetof(W_SessionMember_C_FocusMainMenu, Navigation_0) == 0x000000, "Member 'W_SessionMember_C_FocusMainMenu::Navigation_0' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_FocusMainMenu, ReturnValue) == 0x000008, "Member 'W_SessionMember_C_FocusMainMenu::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_FocusMainMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'W_SessionMember_C_FocusMainMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_FocusMainMenu, K2Node_DynamicCast_AsBP_UPPlayer_Controller) == 0x000018, "Member 'W_SessionMember_C_FocusMainMenu::K2Node_DynamicCast_AsBP_UPPlayer_Controller' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_FocusMainMenu, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'W_SessionMember_C_FocusMainMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function W_SessionMember.W_SessionMember_C.FocusSessionMember
// 0x0010 (0x0010 - 0x0000)
struct W_SessionMember_C_FocusSessionMember final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SessionMember_C_FocusSessionMember) == 0x000008, "Wrong alignment on W_SessionMember_C_FocusSessionMember");
static_assert(sizeof(W_SessionMember_C_FocusSessionMember) == 0x000010, "Wrong size on W_SessionMember_C_FocusSessionMember");
static_assert(offsetof(W_SessionMember_C_FocusSessionMember, ReturnValue) == 0x000000, "Member 'W_SessionMember_C_FocusSessionMember::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_FocusSessionMember, CallFunc_IsVisible_ReturnValue) == 0x000008, "Member 'W_SessionMember_C_FocusSessionMember::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_FocusSessionMember, CallFunc_IsVisible_ReturnValue_1) == 0x000009, "Member 'W_SessionMember_C_FocusSessionMember::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");

// Function W_SessionMember.W_SessionMember_C.GetVoiceChat
// 0x0018 (0x0018 - 0x0000)
struct W_SessionMember_C_GetVoiceChat final
{
public:
	class ABP_VoiceChat_C*                        VoiceChat_0;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_VoiceChat_C*                        CallFunc_GetActorOfClass_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SessionMember_C_GetVoiceChat) == 0x000008, "Wrong alignment on W_SessionMember_C_GetVoiceChat");
static_assert(sizeof(W_SessionMember_C_GetVoiceChat) == 0x000018, "Wrong size on W_SessionMember_C_GetVoiceChat");
static_assert(offsetof(W_SessionMember_C_GetVoiceChat, VoiceChat_0) == 0x000000, "Member 'W_SessionMember_C_GetVoiceChat::VoiceChat_0' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_GetVoiceChat, CallFunc_GetActorOfClass_ReturnValue) == 0x000008, "Member 'W_SessionMember_C_GetVoiceChat::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_GetVoiceChat, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'W_SessionMember_C_GetVoiceChat::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function W_SessionMember.W_SessionMember_C.InitSessionMember
// 0x0008 (0x0008 - 0x0000)
struct W_SessionMember_C_InitSessionMember final
{
public:
	class ABP_UPPlayerState_C*                    PlayerState_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SessionMember_C_InitSessionMember) == 0x000008, "Wrong alignment on W_SessionMember_C_InitSessionMember");
static_assert(sizeof(W_SessionMember_C_InitSessionMember) == 0x000008, "Wrong size on W_SessionMember_C_InitSessionMember");
static_assert(offsetof(W_SessionMember_C_InitSessionMember, PlayerState_0) == 0x000000, "Member 'W_SessionMember_C_InitSessionMember::PlayerState_0' has a wrong offset!");

// Function W_SessionMember.W_SessionMember_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_SessionMember_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SessionMember_C_Tick) == 0x000004, "Wrong alignment on W_SessionMember_C_Tick");
static_assert(sizeof(W_SessionMember_C_Tick) == 0x00003C, "Wrong size on W_SessionMember_C_Tick");
static_assert(offsetof(W_SessionMember_C_Tick, MyGeometry) == 0x000000, "Member 'W_SessionMember_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_SessionMember_C_Tick, InDeltaTime) == 0x000038, "Member 'W_SessionMember_C_Tick::InDeltaTime' has a wrong offset!");

}

