#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Shop

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "E_InventoryItem_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Shop.W_Shop_C
// 0x00C0 (0x0380 - 0x02C0)
class UW_Shop_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OrderConfirmation;                                 // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                BackgroundExitBtn;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DescriptionBorder;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DescriptionText;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ExitBtn;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                      ItemsGrid;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                OrderBtn;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                WindowBorder;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              WindowScaleBox;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_UPPlayerController_C*               PlayerController;                                  // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_UPGameInstance_C*                   GameInstance;                                      // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UW_ShopItem_C*>                  ItemsWidgets;                                      // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UBPC_PlayerInventory_C*                 PlayerInventory;                                   // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ShopItem_C*                          SelectedWidget;                                    // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CanOrder;                                          // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           OrderEnabledColor;                                 // 0x0344(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           OrderDisabledColor;                                // 0x0354(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundCue*                              InitSound;                                         // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              OrderSound;                                        // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              CantOrderSound;                                    // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateOrderBtn();
	void UpdateDescription();
	void ShouldDisplayInShop(const struct FS_InventoryItem& Item, bool* Result);
	void SendBuyItemAnalyticsEvent(E_InventoryItem Item);
	void SelectionChanged(class UW_ShopItem_C* ItemWidget);
	void OnInitialized();
	void InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void ExecuteUbergraph_W_Shop(int32 EntryPoint);
	void CreateItemWidget(class UW_ShopItem_C** ItemWidget);
	void CanBuyShopItem(class UW_ShopItem_C* ItemWidget, bool* Result);
	void BndEvt__W_Shop_OrderBtn_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_Shop_ExitButton_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_Shop_ExitBtn_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void AdaptToAspectRatio();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Shop_C">();
	}
	static class UW_Shop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Shop_C>();
	}
};
static_assert(alignof(UW_Shop_C) == 0x000008, "Wrong alignment on UW_Shop_C");
static_assert(sizeof(UW_Shop_C) == 0x000380, "Wrong size on UW_Shop_C");
static_assert(offsetof(UW_Shop_C, UberGraphFrame) == 0x0002C0, "Member 'UW_Shop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Shop_C, OrderConfirmation) == 0x0002C8, "Member 'UW_Shop_C::OrderConfirmation' has a wrong offset!");
static_assert(offsetof(UW_Shop_C, BackgroundExitBtn) == 0x0002D0, "Member 'UW_Shop_C::BackgroundExitBtn' has a wrong offset!");
static_assert(offsetof(UW_Shop_C, DescriptionBorder) == 0x0002D8, "Member 'UW_Shop_C::DescriptionBorder' has a wrong offset!");
static_assert(offsetof(UW_Shop_C, DescriptionText) == 0x0002E0, "Member 'UW_Shop_C::DescriptionText' has a wrong offset!");
static_assert(offsetof(UW_Shop_C, ExitBtn) == 0x0002E8, "Member 'UW_Shop_C::ExitBtn' has a wrong offset!");
static_assert(offsetof(UW_Shop_C, ItemsGrid) == 0x0002F0, "Member 'UW_Shop_C::ItemsGrid' has a wrong offset!");
static_assert(offsetof(UW_Shop_C, OrderBtn) == 0x0002F8, "Member 'UW_Shop_C::OrderBtn' has a wrong offset!");
static_assert(offsetof(UW_Shop_C, WindowBorder) == 0x000300, "Member 'UW_Shop_C::WindowBorder' has a wrong offset!");
static_assert(offsetof(UW_Shop_C, WindowScaleBox) == 0x000308, "Member 'UW_Shop_C::WindowScaleBox' has a wrong offset!");
static_assert(offsetof(UW_Shop_C, PlayerController) == 0x000310, "Member 'UW_Shop_C::PlayerController' has a wrong offset!");
static_assert(offsetof(UW_Shop_C, GameInstance) == 0x000318, "Member 'UW_Shop_C::GameInstance' has a wrong offset!");
static_assert(offsetof(UW_Shop_C, ItemsWidgets) == 0x000320, "Member 'UW_Shop_C::ItemsWidgets' has a wrong offset!");
static_assert(offsetof(UW_Shop_C, PlayerInventory) == 0x000330, "Member 'UW_Shop_C::PlayerInventory' has a wrong offset!");
static_assert(offsetof(UW_Shop_C, SelectedWidget) == 0x000338, "Member 'UW_Shop_C::SelectedWidget' has a wrong offset!");
static_assert(offsetof(UW_Shop_C, CanOrder) == 0x000340, "Member 'UW_Shop_C::CanOrder' has a wrong offset!");
static_assert(offsetof(UW_Shop_C, OrderEnabledColor) == 0x000344, "Member 'UW_Shop_C::OrderEnabledColor' has a wrong offset!");
static_assert(offsetof(UW_Shop_C, OrderDisabledColor) == 0x000354, "Member 'UW_Shop_C::OrderDisabledColor' has a wrong offset!");
static_assert(offsetof(UW_Shop_C, InitSound) == 0x000368, "Member 'UW_Shop_C::InitSound' has a wrong offset!");
static_assert(offsetof(UW_Shop_C, OrderSound) == 0x000370, "Member 'UW_Shop_C::OrderSound' has a wrong offset!");
static_assert(offsetof(UW_Shop_C, CantOrderSound) == 0x000378, "Member 'UW_Shop_C::CantOrderSound' has a wrong offset!");

}

