#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ShopItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "S_InventoryItem_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ShopItem.W_ShopItem_C
// 0x0260 (0x0520 - 0x02C0)
class UW_ShopItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Price;                                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            BorderBrush;                                       // 0x02F0(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            SelectedBrush;                                     // 0x03C0(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FS_InventoryItem                       Item;                                              // 0x0490(0x0068)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UW_ShopItem_C* ItemWidget)> OnSelection;                     // 0x04F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UBP_UPGameInstance_C*                   GameInstance;                                      // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerController_C*               PlayerController;                                  // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x0518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetSelected(bool Selected);
	void Init(const struct FS_InventoryItem& Item_0);
	void ExecuteUbergraph_W_ShopItem(int32 EntryPoint);
	void BndEvt__W_ShopItem_Button_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_ShopItem_C">();
	}
	static class UW_ShopItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ShopItem_C>();
	}
};
static_assert(alignof(UW_ShopItem_C) == 0x000010, "Wrong alignment on UW_ShopItem_C");
static_assert(sizeof(UW_ShopItem_C) == 0x000520, "Wrong size on UW_ShopItem_C");
static_assert(offsetof(UW_ShopItem_C, UberGraphFrame) == 0x0002C0, "Member 'UW_ShopItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ShopItem_C, Border) == 0x0002C8, "Member 'UW_ShopItem_C::Border' has a wrong offset!");
static_assert(offsetof(UW_ShopItem_C, Button) == 0x0002D0, "Member 'UW_ShopItem_C::Button' has a wrong offset!");
static_assert(offsetof(UW_ShopItem_C, Icon) == 0x0002D8, "Member 'UW_ShopItem_C::Icon' has a wrong offset!");
static_assert(offsetof(UW_ShopItem_C, Name_0) == 0x0002E0, "Member 'UW_ShopItem_C::Name_0' has a wrong offset!");
static_assert(offsetof(UW_ShopItem_C, Price) == 0x0002E8, "Member 'UW_ShopItem_C::Price' has a wrong offset!");
static_assert(offsetof(UW_ShopItem_C, BorderBrush) == 0x0002F0, "Member 'UW_ShopItem_C::BorderBrush' has a wrong offset!");
static_assert(offsetof(UW_ShopItem_C, SelectedBrush) == 0x0003C0, "Member 'UW_ShopItem_C::SelectedBrush' has a wrong offset!");
static_assert(offsetof(UW_ShopItem_C, Item) == 0x000490, "Member 'UW_ShopItem_C::Item' has a wrong offset!");
static_assert(offsetof(UW_ShopItem_C, OnSelection) == 0x0004F8, "Member 'UW_ShopItem_C::OnSelection' has a wrong offset!");
static_assert(offsetof(UW_ShopItem_C, GameInstance) == 0x000508, "Member 'UW_ShopItem_C::GameInstance' has a wrong offset!");
static_assert(offsetof(UW_ShopItem_C, PlayerController) == 0x000510, "Member 'UW_ShopItem_C::PlayerController' has a wrong offset!");
static_assert(offsetof(UW_ShopItem_C, IsSelected) == 0x000518, "Member 'UW_ShopItem_C::IsSelected' has a wrong offset!");

}

