#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ShopItem

#include "Basic.hpp"

#include "S_InventoryItem_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_ShopItem.W_ShopItem_C.SetSelected
// 0x0001 (0x0001 - 0x0000)
struct W_ShopItem_C_SetSelected final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ShopItem_C_SetSelected) == 0x000001, "Wrong alignment on W_ShopItem_C_SetSelected");
static_assert(sizeof(W_ShopItem_C_SetSelected) == 0x000001, "Wrong size on W_ShopItem_C_SetSelected");
static_assert(offsetof(W_ShopItem_C_SetSelected, Selected) == 0x000000, "Member 'W_ShopItem_C_SetSelected::Selected' has a wrong offset!");

// Function W_ShopItem.W_ShopItem_C.Init
// 0x0068 (0x0068 - 0x0000)
struct W_ShopItem_C_Init final
{
public:
	struct FS_InventoryItem                       Item_0;                                            // 0x0000(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(W_ShopItem_C_Init) == 0x000008, "Wrong alignment on W_ShopItem_C_Init");
static_assert(sizeof(W_ShopItem_C_Init) == 0x000068, "Wrong size on W_ShopItem_C_Init");
static_assert(offsetof(W_ShopItem_C_Init, Item_0) == 0x000000, "Member 'W_ShopItem_C_Init::Item_0' has a wrong offset!");

// Function W_ShopItem.W_ShopItem_C.ExecuteUbergraph_W_ShopItem
// 0x01F0 (0x01F0 - 0x0000)
struct W_ShopItem_C_ExecuteUbergraph_W_ShopItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Selected;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_InventoryItem                       K2Node_CustomEvent_Item;                           // 0x0098(0x0068)(HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_Select_Default;                             // 0x0100(0x00D0)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerController_C*               K2Node_DynamicCast_AsBP_UPPlayer_Controller;       // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ShopItem_C_ExecuteUbergraph_W_ShopItem) == 0x000010, "Wrong alignment on W_ShopItem_C_ExecuteUbergraph_W_ShopItem");
static_assert(sizeof(W_ShopItem_C_ExecuteUbergraph_W_ShopItem) == 0x0001F0, "Wrong size on W_ShopItem_C_ExecuteUbergraph_W_ShopItem");
static_assert(offsetof(W_ShopItem_C_ExecuteUbergraph_W_ShopItem, EntryPoint) == 0x000000, "Member 'W_ShopItem_C_ExecuteUbergraph_W_ShopItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ShopItem_C_ExecuteUbergraph_W_ShopItem, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000008, "Member 'W_ShopItem_C_ExecuteUbergraph_W_ShopItem::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopItem_C_ExecuteUbergraph_W_ShopItem, K2Node_CustomEvent_Selected) == 0x000010, "Member 'W_ShopItem_C_ExecuteUbergraph_W_ShopItem::K2Node_CustomEvent_Selected' has a wrong offset!");
static_assert(offsetof(W_ShopItem_C_ExecuteUbergraph_W_ShopItem, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'W_ShopItem_C_ExecuteUbergraph_W_ShopItem::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_ShopItem_C_ExecuteUbergraph_W_ShopItem, K2Node_MakeArray_Array) == 0x000068, "Member 'W_ShopItem_C_ExecuteUbergraph_W_ShopItem::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_ShopItem_C_ExecuteUbergraph_W_ShopItem, CallFunc_Format_ReturnValue) == 0x000078, "Member 'W_ShopItem_C_ExecuteUbergraph_W_ShopItem::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopItem_C_ExecuteUbergraph_W_ShopItem, Temp_bool_Variable) == 0x000090, "Member 'W_ShopItem_C_ExecuteUbergraph_W_ShopItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_ShopItem_C_ExecuteUbergraph_W_ShopItem, K2Node_CustomEvent_Item) == 0x000098, "Member 'W_ShopItem_C_ExecuteUbergraph_W_ShopItem::K2Node_CustomEvent_Item' has a wrong offset!");
static_assert(offsetof(W_ShopItem_C_ExecuteUbergraph_W_ShopItem, K2Node_Select_Default) == 0x000100, "Member 'W_ShopItem_C_ExecuteUbergraph_W_ShopItem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_ShopItem_C_ExecuteUbergraph_W_ShopItem, CallFunc_GetPlayerController_ReturnValue) == 0x0001D0, "Member 'W_ShopItem_C_ExecuteUbergraph_W_ShopItem::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ShopItem_C_ExecuteUbergraph_W_ShopItem, K2Node_DynamicCast_AsBP_UPPlayer_Controller) == 0x0001D8, "Member 'W_ShopItem_C_ExecuteUbergraph_W_ShopItem::K2Node_DynamicCast_AsBP_UPPlayer_Controller' has a wrong offset!");
static_assert(offsetof(W_ShopItem_C_ExecuteUbergraph_W_ShopItem, K2Node_DynamicCast_bSuccess) == 0x0001E0, "Member 'W_ShopItem_C_ExecuteUbergraph_W_ShopItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

