#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Spectate

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Spectate.W_Spectate_C.ExecuteUbergraph_W_Spectate
// 0x0078 (0x0078 - 0x0000)
struct W_Spectate_C_ExecuteUbergraph_W_Spectate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UPPlayerCharacter_C*                CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UPPlayerState_C*                    CallFunc_GetPlayerState_PlayerState;               // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
};
static_assert(alignof(W_Spectate_C_ExecuteUbergraph_W_Spectate) == 0x000008, "Wrong alignment on W_Spectate_C_ExecuteUbergraph_W_Spectate");
static_assert(sizeof(W_Spectate_C_ExecuteUbergraph_W_Spectate) == 0x000078, "Wrong size on W_Spectate_C_ExecuteUbergraph_W_Spectate");
static_assert(offsetof(W_Spectate_C_ExecuteUbergraph_W_Spectate, EntryPoint) == 0x000000, "Member 'W_Spectate_C_ExecuteUbergraph_W_Spectate::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Spectate_C_ExecuteUbergraph_W_Spectate, K2Node_Event_MyGeometry) == 0x000004, "Member 'W_Spectate_C_ExecuteUbergraph_W_Spectate::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Spectate_C_ExecuteUbergraph_W_Spectate, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'W_Spectate_C_ExecuteUbergraph_W_Spectate::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_Spectate_C_ExecuteUbergraph_W_Spectate, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'W_Spectate_C_ExecuteUbergraph_W_Spectate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Spectate_C_ExecuteUbergraph_W_Spectate, CallFunc_Array_Get_Item) == 0x000048, "Member 'W_Spectate_C_ExecuteUbergraph_W_Spectate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_Spectate_C_ExecuteUbergraph_W_Spectate, CallFunc_GetPlayerState_PlayerState) == 0x000050, "Member 'W_Spectate_C_ExecuteUbergraph_W_Spectate::CallFunc_GetPlayerState_PlayerState' has a wrong offset!");
static_assert(offsetof(W_Spectate_C_ExecuteUbergraph_W_Spectate, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'W_Spectate_C_ExecuteUbergraph_W_Spectate::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Spectate_C_ExecuteUbergraph_W_Spectate, CallFunc_IsValid_ReturnValue_2) == 0x000059, "Member 'W_Spectate_C_ExecuteUbergraph_W_Spectate::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Spectate_C_ExecuteUbergraph_W_Spectate, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00005A, "Member 'W_Spectate_C_ExecuteUbergraph_W_Spectate::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Spectate_C_ExecuteUbergraph_W_Spectate, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'W_Spectate_C_ExecuteUbergraph_W_Spectate::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function W_Spectate.W_Spectate_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_Spectate_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Spectate_C_Tick) == 0x000004, "Wrong alignment on W_Spectate_C_Tick");
static_assert(sizeof(W_Spectate_C_Tick) == 0x00003C, "Wrong size on W_Spectate_C_Tick");
static_assert(offsetof(W_Spectate_C_Tick, MyGeometry) == 0x000000, "Member 'W_Spectate_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Spectate_C_Tick, InDeltaTime) == 0x000038, "Member 'W_Spectate_C_Tick::InDeltaTime' has a wrong offset!");

}

