#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Spectate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Spectate.W_Spectate_C
// 0x0020 (0x02E0 - 0x02C0)
class UW_Spectate_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             PlayerName;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_InputKey_C*                          W_InputKey;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_UPPlayerSpectator_C*                Spectator;                                         // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Spectate(int32 EntryPoint);
	void OnInitialized();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Spectate_C">();
	}
	static class UW_Spectate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Spectate_C>();
	}
};
static_assert(alignof(UW_Spectate_C) == 0x000008, "Wrong alignment on UW_Spectate_C");
static_assert(sizeof(UW_Spectate_C) == 0x0002E0, "Wrong size on UW_Spectate_C");
static_assert(offsetof(UW_Spectate_C, UberGraphFrame) == 0x0002C0, "Member 'UW_Spectate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Spectate_C, PlayerName) == 0x0002C8, "Member 'UW_Spectate_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UW_Spectate_C, W_InputKey) == 0x0002D0, "Member 'UW_Spectate_C::W_InputKey' has a wrong offset!");
static_assert(offsetof(UW_Spectate_C, Spectator) == 0x0002D8, "Member 'UW_Spectate_C::Spectator' has a wrong offset!");

}

