#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SplashScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SplashScreen.W_SplashScreen_C
// 0x0038 (0x02F8 - 0x02C0)
class UW_SplashScreen_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Fade;                                              // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Appear;                                            // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 KafiLogo;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 KafiText;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnSplashAnimationFinished;                         // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_W_SplashScreen(int32 EntryPoint);
	void MakeLogoAppear();
	void MakeLogoDisappear();
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void PlaySpashAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_SplashScreen_C">();
	}
	static class UW_SplashScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_SplashScreen_C>();
	}
};
static_assert(alignof(UW_SplashScreen_C) == 0x000008, "Wrong alignment on UW_SplashScreen_C");
static_assert(sizeof(UW_SplashScreen_C) == 0x0002F8, "Wrong size on UW_SplashScreen_C");
static_assert(offsetof(UW_SplashScreen_C, UberGraphFrame) == 0x0002C0, "Member 'UW_SplashScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SplashScreen_C, Fade) == 0x0002C8, "Member 'UW_SplashScreen_C::Fade' has a wrong offset!");
static_assert(offsetof(UW_SplashScreen_C, Appear) == 0x0002D0, "Member 'UW_SplashScreen_C::Appear' has a wrong offset!");
static_assert(offsetof(UW_SplashScreen_C, KafiLogo) == 0x0002D8, "Member 'UW_SplashScreen_C::KafiLogo' has a wrong offset!");
static_assert(offsetof(UW_SplashScreen_C, KafiText) == 0x0002E0, "Member 'UW_SplashScreen_C::KafiText' has a wrong offset!");
static_assert(offsetof(UW_SplashScreen_C, OnSplashAnimationFinished) == 0x0002E8, "Member 'UW_SplashScreen_C::OnSplashAnimationFinished' has a wrong offset!");

}

